&НаКлиенте
Процедура УправлениеДоступностью()
	Если Не Запись.БазаРаспределения = ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат") Тогда
		Элементы.СписокСтатейЗатрат.Доступность = Ложь;
	Иначе
		Элементы.СписокСтатейЗатрат.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов формы

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="БазаРаспределения" Тогда
		УправлениеДоступностью();
		Если Не Запись.БазаРаспределения = ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат") 
			И Не Запись.СписокСтатейЗатрат = ПредопределенноеЗначение("Справочник.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов.ПустаяСсылка") Тогда
			Если Вопрос("Установлена база распределения: " + Запись.БазаРаспределения + ",
				|для которой указание списка прямых затрат некорректно.
				|Очистить список прямых затрат?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да) <> КодВозвратаДиалога.Нет Тогда
				Запись.СписокСтатейЗатрат = ПредопределенноеЗначение("Справочник.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов.ПустаяСсылка") ;
				Элементы.СписокСтатейЗатрат.Доступность = Ложь;
			Иначе
				Запись.БазаРаспределения = ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат"); 
				Элементы.СписокСтатейЗатрат.Доступность = Истина;
			КонецЕсли;
		КонецЕсли;
		Элементы.СписокСтатейЗатрат.Доступность = (Запись.БазаРаспределения = ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Атрибут_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элемент.Имя="СчетЗатрат" Тогда
		СтандартнаяОбработка=Ложь;
		СписокСчетов=Новый СписокЗначений;
		СписокСчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы"));
		СписокСчетов.Добавить(ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы"));

		ПараметрыФормы=Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", СписокСчетов));
		ПараметрыФормы.Вставить("РежимВыбора", Истина);

		ОткрытьФорму("ПланСчетов.Хозрасчетный.ФормаСписка", ПараметрыФормы, Элемент, УникальныйИдентификатор);
  КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДоступностью();
КонецПроцедуры