&НаКлиенте
Процедура НазадГод(Команда)
	Год=Год-1; Элементы.ВыбратьГод.Заголовок=СокрЛП(Год);
КонецПроцедуры

&НаКлиенте
Процедура ВпередГод(Команда)
	Год=Год+1; Элементы.ВыбратьГод.Заголовок=СокрЛП(Год);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьГод(Команда)
	Дата1=Дата(Год, 1, 1);
	Дата2=Дата(Год, 12, 31, 23, 59, 59);

	ВыбратьПериод();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод()
	Закрыть(Новый Структура("ДатаНачала, ДатаКонца", Дата1, Дата2));
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов формы

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Лев(Элемент.Имя, 5)="Месяц" Тогда		
		Дата1=Дата(Год, Месяц, 1);
		Дата2=КонецМесяца(Дата(Год, Месяц, 1));

	ИначеЕсли Лев(Элемент.Имя, 7)="Квартал" Тогда
		Дата1=НачалоКвартала(Дата(Год, 3 * Квартал, 1));
		Дата2=КонецМесяца(Дата(Год, 3 * Квартал, 1));

	ИначеЕсли Лев(Элемент.Имя, 9)="Полугодие" Тогда
		Дата1=Дата(Год, ?(Полугодие=1, 1 ,7), 1);
		Дата2=КонецМесяца(Дата(Год, 6 * Полугодие, 1));
		
	ИначеЕсли Элемент.Имя="Интервал1" Тогда
		Выполнить("Дата1="+Интервал1+"(ТекущаяДата())");

	ИначеЕсли Элемент.Имя="Интервал2" Тогда		
		Выполнить("Дата2="+Интервал2+"(ТекущаяДата())");
	КонецЕсли;
	Элементы.ДекорацияИнтервал.Заголовок="Интервал ("+Формат(Дата1, "ДФ=dd.MM.yyyy")+" - "+Формат(Дата2, "ДФ=dd.MM.yyyy")+")";

	Если НЕ Элемент.Имя="Интервал1" И НЕ Элемент.Имя="Интервал2" Тогда
		ВыбратьПериод();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Атрибут_Нажатие(Элемент)
	Если Элемент.Имя="ДекорацияИнтервал" Тогда
		ВыбратьПериод();
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Год=Год(ТекущаяДата());
	//***День=ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ВыбратьГод.Заголовок=СокрЛП(Год);
КонецПроцедуры