&НаКлиенте
Процедура Выполнитьдействие(Команда)
	Если Команда.Имя="" Тогда
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСсылку(Команда)
  	Объект=Новый COMОбъект("htmlfile");
    Объект.ParentWindow.ClipboardData.Setdata("Text", Ссылка);
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоСсылке(Команда)
	Записать(); НачатьЗапускПриложения(, "http://"+Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовФормы()
	Элементы.ДатаУдаления.Видимость=Запись.ВариантУдаления=2;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов формы

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="ВариантУдаления" Тогда
		ВидимостьЭлементовФормы();
		
	ИначеЕсли Элемент.Имя="ФорматСсылки" Тогда
		Запись.Тип=ФорматСсылки;
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ТабличныйДокумент", ТабличныйДокумент);
	Если ТабличныйДокумент=Неопределено Тогда Отказ=Истина; Возврат; КонецЕсли;

	Элементы.ФорматСсылки.СписокВыбора.Добавить("HTML", "HTML",,БиблиотекаКартинок.ФорматHTML);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("XLSX", "XLSX",,БиблиотекаКартинок.ФорматExcel);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("PDF", "PDF",,БиблиотекаКартинок.ФорматPDF);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("ODS", "ODS",,БиблиотекаКартинок.ФорматWord);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("DOCX", "DOCX",,БиблиотекаКартинок.ФорматWord);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("HTML3", "HTML 3",,БиблиотекаКартинок.ФорматHTML);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("HTML4", "HTML 4",,БиблиотекаКартинок.ФорматHTML);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("HTML5", "HTML 5",,БиблиотекаКартинок.ФорматHTML);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("MXL", "MXL",,БиблиотекаКартинок.ФорматMXL);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("MXL7", "MXL 7",,БиблиотекаКартинок.ФорматMXL);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("ANSITXT", "ANSITXT",,БиблиотекаКартинок.ФорматTXT);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("TXT", "TXT",,БиблиотекаКартинок.ФорматTXT);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("XLS95", "XLS 95",,БиблиотекаКартинок.ФорматExcel);
	Элементы.ФорматСсылки.СписокВыбора.Добавить("XLS97", "XLS 97",,БиблиотекаКартинок.ФорматExcel);

	ФорматСсылки="HTML";

	Запись.ID=Новый УникальныйИдентификатор;
	Запись.Автор=ПараметрыСеанса.ТекущийПользователь;
	Запись.Тип=ФорматСсылки;
	Запись.ВариантУдаления=1;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПараметрыПубликации=УправлениеКонфигурациейСервер.ПараметрыПубликацииИБ();
	Если НЕ ТипЗнч(ПараметрыПубликации)=Тип("Структура") Тогда
		ПоказатьПредупреждение(, "Не настроены параметры формирования ссылки!", 20, "Внимание");
		Отказ=Истина; Возврат;
	КонецЕсли;
	Ссылка=СокрЛП(ПараметрыПубликации.Сервер)+":"+СтрЗаменить(СокрЛП(ПараметрыПубликации.Порт), Символы.НПП, "")+"\"+СокрЛП(ПараметрыПубликации.База)+"\hs\Share\"+СокрЛП(Запись.ID);
	ВидимостьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	////стрФайл=ПолучитьИмяВременногоФайла(Запись.Тип);
	////ТабличныйДокумент.Записать(стрФайл, ТипФайлаТабличногоДокумента[Запись.Тип]);
	////ДвоичныеДанные=Новый ДвоичныеДанные(стрФайл);
	////ТекущийОбъект.Данные=Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));

	Поток=Новый ПотокВПамяти;
	ТабличныйДокумент.Записать(Поток, ТипФайлаТабличногоДокумента[Запись.Тип]);	
	ТекущийОбъект.Данные=Новый ХранилищеЗначения(Поток.ЗакрытьИПолучитьДвоичныеДанные(), Новый СжатиеДанных(9));	
КонецПроцедуры
