&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Форма=ПараметрыВыполненияКоманды.Источник;
	Если НЕ ТипЗнч(Форма)=Тип("УправляемаяФорма") Тогда Возврат; КонецЕсли;

	стрТабличнаяЧасть=Форма.ТекущийЭлемент.Имя;
	Объект=Форма.Объект;
	
	МассивСтрок=КопированиеСтрокСервер.МассивСтрок();
	Для каждого СтрокаКоллекции Из МассивСтрок Цикл
		НоваяСтрока=Объект[стрТабличнаяЧасть].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКоллекции);
		Если СтрокаКоллекции.Свойство("ID") Тогда
			НоваяСтрока.ID=СокрЛП(Новый УникальныйИдентификатор);
			СтрокаКоллекции.ID=НоваяСтрока.ID; //Для возможной обработки в модуле вызова установки значений ID_Товары,ID_Владелец и т.д. (что бы можно было найти добавленные строки)
		КонецЕсли;
		Если СтрокаКоллекции.Свойство("ТОП") Тогда
			НоваяСтрока.ТОП=ПредопределенноеЗначение("Справочник.ТиповыеОперации.ПустаяСсылка");
			//ОбработкаТабличныхЧастей.УстановитьТиповуюОперацию(СтрокаКоллекции, Объект, Форма, стрТабличнаяЧасть);
		КонецЕсли;
	КонецЦикла;
	Форма.Элементы[стрТабличнаяЧасть].Обновить();

	КопированиеСтрокКлиент.ОповеститьПользователяОВставкеСтрок(МассивСтрок.Количество());
КонецПроцедуры