&НаКлиенте
Процедура ОК(Команда)
	ТекстОшибки="";	
	Если ПустаяСтрока(ПериодичностьНалога) Тогда
		ТекстОшибки="Не указана периодичность налога.";
	КонецЕсли;

	Если ПустаяСтрока(НомерПериода) Тогда
		ТекстОшибки=ТекстОшибки+"
		|Не указан номер периода.";
	КонецЕсли;

	Если ПустаяСтрока(ГодПериода) Тогда
		ТекстОшибки=ТекстОшибки+"
		|Не указан год периода.";
	КонецЕсли;

	Если СтрДлина(ТекстОшибки)>0 Тогда
		ТекстОшибки=ТекстОшибки+"
		|Продолжить?";

		ОписаниеОповещения=Новый ОписаниеОповещения("Применить", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстОшибки, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет, "Внимание", КодВозвратаДиалога.Нет);
	Иначе
		Применить(КодВозвратаДиалога.Да);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Применить(Параметр1) Экспорт
	Если НЕ Параметр1=КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли; 
	
	Если ПериодичностьНалога="-" Тогда
		П107=Строка(Формат(ДатаПоказателя,"ДФ='дд.ММ.гггг'"));
	Иначе
		СтрПериодПл=?(СтрДлина(СокрЛП(НомерПериода))=1,"0"+НомерПериода, НомерПериода);
		П107=ПериодичностьНалога+"."+СтрПериодПл+"."+СтрЗаменить(Строка(ГодПериода),Символы.НПП, "");
	КонецЕсли;
	ПоказательПериода=?(ПустаяСтрока(СокрЛП(СтрЗаменить(П107,"."," "))),"", П107);
	Закрыть(ПоказательПериода);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПериодичностьУплаты()
	Если НЕ(ПериодичностьНалога=Неопределено) Тогда
		Если (ПериодичностьНалога="Д1") Или (ПериодичностьНалога = "Д2") Или (ПериодичностьНалога="Д3") Или (ПериодичностьНалога="МС") Тогда
			НомерПериода=1;	
			Элементы.НомерПериода.МинимальноеЗначение = 1;
			Элементы.НомерПериода.МаксимальноеЗначение = 12;
			Элементы.НомерПериода.Доступность = Истина;
			Элементы.НомерПериода.Заголовок="Месяц периода:";

		ИначеЕсли ПериодичностьНалога="КВ" Тогда
			НомерПериода=1;	
			Элементы.НомерПериода.МинимальноеЗначение = 1;
			Элементы.НомерПериода.МаксимальноеЗначение = 4;
			Элементы.НомерПериода.Доступность=Истина;
			Элементы.НомерПериода.Заголовок="Квартал периода:";

		ИначеЕсли ПериодичностьНалога="ПЛ" Тогда
			НомерПериода=1;	
			Элементы.НомерПериода.МинимальноеЗначение = 1;
			Элементы.НомерПериода.МаксимальноеЗначение = 2;
			Элементы.НомерПериода.Доступность = Истина;
			Элементы.НомерПериода.Заголовок="Полугодие периода:";

		ИначеЕсли ПериодичностьНалога="ГД" Тогда
			НомерПериода=0;	
			Элементы.НомерПериода.МинимальноеЗначение = 0;
			Элементы.НомерПериода.МаксимальноеЗначение = 1;
			Элементы.НомерПериода.Доступность = Ложь;
			Элементы.НомерПериода.Заголовок="";
		КонецЕсли;
	КонецЕсли;
	
	Если Найти("-", ПериодичностьНалога) > 0 Тогда
		Элементы.ДатаПоказателя.Видимость=Истина;
		Элементы.ГруппаПериод.Видимость=Ложь;
	Иначе
		Элементы.ДатаПоказателя.Видимость=Ложь;
		Элементы.ГруппаПериод.Видимость=Истина;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="ПериодичностьНалога" Тогда
		ОбработкаИзмененияПериодичностьУплаты();
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокВыбора=Элементы.ПериодичностьНалога.СписокВыбора;
	СписокВыбора.Добавить("МС","МС, Месячные платежи");
	СписокВыбора.Добавить("КВ","КВ, Квартальные платежи");
	СписокВыбора.Добавить("ПЛ","ПЛ, Полугодовые платежи");
	СписокВыбора.Добавить("ГД","ГД, Годовые платежи");
	СписокВыбора.Добавить("-",  "Платеж по конкретной дате");
	ГодПериода=Год(ТекущаяДата());
	ОбработкаИзмененияПериодичностьУплаты();
КонецПроцедуры
