Процедура Share_УдалитьСсылкиПоДате() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ДатаУдаления", НачалоДня(ТекущаяДата()));
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ИсточникДанных.ID КАК ID
	|ИЗ
	|	РегистрСведений.Share КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.ВариантУдаления = 2
	|	И ИсточникДанных.ДатаУдаления <= &ДатаУдаления
	|";
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи=РегистрыСведений.Share.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ID=Выборка.ID;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура Share_ДобавитьРоль() Экспорт
	Если НЕ РольДоступна(Метаданные.Роли.Share) Тогда
		ТекущийПользователь=ПользователиИнформационнойБазы.ТекущийПользователь();	
		ТекущийПользователь.Роли.Добавить(Метаданные.Роли.Share);
		ТекущийПользователь.Записать();
	КонецЕсли;
КонецПроцедуры