&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	Если Команда.Имя="РедакторВстроенногоЯзыка" Тогда
		СтруктураПараметров=Новый Структура;
		СтруктураПараметров.Вставить("Алгоритм", Объект.Алгоритм);

		ОписаниеОповещения=Новый ОписаниеОповещения("ОбработчикОповещения_РедакторВстроенногоЯзыка", ЭтотОбъект);

		ОткрытьФорму("Справочник.Алгоритмы.Форма.ФормаРедактораВстроенногоЯзыка", СтруктураПараметров, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещения_РедакторВстроенногоЯзыка(Параметр1, Параметр2) Экспорт
	Если Параметр1=Неопределено Тогда Возврат; КонецЕсли;
	Объект.Алгоритм=Параметр1;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов формы

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="Путь" Тогда
		Объект.Наименование=Элементы.Путь.СписокВыбора.НайтиПоЗначению(Объект.ИмяОбработки).Представление;
		Объект.Код=Объект.ИмяОбработки;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого мдОбъект Из Метаданные.Обработки Цикл
		Элементы.Путь.СписокВыбора.Добавить(мдОбъект.Имя, мдОбъект.Представление());
	КонецЦикла;
КонецПроцедуры