Процедура СтруктураПечатныхФорм(Структура) Экспорт
	Структура.Вставить("ДолевоеРаспределениеЗатрат", "Долевое распределение затрат (БУ и НУ)");
	Структура.Вставить("БухгалтерскаяСправка", "Бухгалтерская cправка");
КонецПроцедуры

Функция Печать(СтруктураПараметров, КоличествоЭкземпляров=1, НаПринтер=Ложь, ТабДокумент=Неопределено) Экспорт
	Если СтруктураПараметров.ИмяМакета="ДолевоеРаспределениеЗатрат" Тогда
		Сообщить("Находится в разработке!");

	ИначеЕсли СтруктураПараметров.ИмяМакета="БухгалтерскаяСправка" Тогда
		ТабДокумент=ПечатныеФормыСервер.БухгалтерскаяСправка(СтруктураПараметров, "Хозрасчетный");
	КонецЕсли;

	Возврат ТабДокумент;
КонецФункции