Процедура ВыполнитьПравило(Форма, Объект, Событие, Отказ=Ложь, СтандартнаяОбработка=Истина, СтруктураПараметров=Неопределено) Экспорт
	Если Форма=Неопределено Тогда
		стрТипВидОбъект=Объект.Метаданные().ПолноеИмя();		
	Иначе
		СтруктураОбъекта=Справочники.РегистрыПравил.СтруктураОбъекта(Форма.ИмяФормы);
		стрТипВидОбъект=СтруктураОбъекта.Тип+"."+СтруктураОбъекта.Вид;
	КонецЕсли;
	Если стрТипВидОбъект="Справочник.РегистрыПравил" Тогда Возврат; КонецЕсли;	

	Если СтруктураПараметров=Неопределено Тогда
		СтруктураПараметров=Новый Структура;
	КонецЕсли;
	СтруктураПараметров.Вставить("Форма", Форма);
	СтруктураПараметров.Вставить("Объект", Объект);
	СтруктураПараметров.Вставить("Отказ", Отказ);
	СтруктураПараметров.Вставить("Событие", Событие);
	СтруктураПараметров.Вставить("ИсточникДанных", Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", стрТипВидОбъект));

	Справочники.РегистрыПравил.ВыполнитьПравило_УправлениеРегистрамиПравил(СтруктураПараметров, Отказ);
	//СтандартнаяОбработка=СтруктураПараметров.СтандартнаяОбработка;
КонецПроцедуры