Процедура ДвиженияПоРегистрам(Отказ)
	//Движения регистра "Книга учета доходов и расходов (раздел I)"
	тзДвиженияКУДиР=Движения.КнигаУчетаДоходовИРасходов.Выгрузить();
	тзДвиженияРасходыПриУСН=Движения.РасходыПриУСН.Выгрузить();
	Для Каждого СтрокаКоллекции ИЗ Расшифровка Цикл
		Если СтрокаКоллекции.СуммаПринятыхРасходов<>0 ИЛИ СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда 
			Если (СтрокаКоллекции.СтатусыОплатыРасходовОплаты=СтрокаКоллекции.СтатусыОплатыРасходовПокупки) И
				(СтрокаКоллекции.ДокументОплаты=СтрокаКоллекции.ДокументПокупки) И НЕ ЗначениеЗаполнено(СтрокаКоллекции.ДокументСписания) Тогда /// Тогда достаточно одной строки
				НоваяСтрока=тзДвиженияРасходыПриУСН.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции);
				НоваяСтрока.РасчетныйДокумент=СтрокаКоллекции.ДокументПокупки;
				НоваяСтрока.СтатусыОплатыРасходов=СтрокаКоллекции.СтатусыОплатыРасходовПокупки;
				НоваяСтрока.ТОП=СтрокаКоллекции.ТОППокупки;
				НоваяСтрока.НеПринимаетсяУСН=СтрокаКоллекции.НеПринимаетсяУСН_Покупки;
				Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаНеПринимаетсяУСН;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаНеПринимаетсяУСН_НДС;
				Иначе
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаПринятыхРасходов;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
				КонецЕсли;	
				
			ИначеЕсли (СтрокаКоллекции.СтатусыОплатыРасходовОплаты=СтрокаКоллекции.СтатусыОплатыРасходовПокупки) И
				(СтрокаКоллекции.ДокументОплаты=СтрокаКоллекции.ДокументПокупки) И ЗначениеЗаполнено(СтрокаКоллекции.ДокументСписания) Тогда /// Тогда достаточно одной строки
				НоваяСтрока=тзДвиженияРасходыПриУСН.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции);
				НоваяСтрока.РасчетныйДокумент=СтрокаКоллекции.ДокументПокупки;
				НоваяСтрока.СтатусыОплатыРасходов=СтрокаКоллекции.СтатусыОплатыРасходовПокупки;
				НоваяСтрока.ТОП=СтрокаКоллекции.ТОППокупки;
				НоваяСтрока.НеПринимаетсяУСН=СтрокаКоллекции.НеПринимаетсяУСН_Покупки;
				Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаНеПринимаетсяУСН;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаНеПринимаетсяУСН_НДС;
				Иначе
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаПринятыхРасходов;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
				КонецЕсли;	
				
				НоваяСтрока=тзДвиженияРасходыПриУСН.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции,,"ДоговорКонтрагента");
				НоваяСтрока.РасчетныйДокумент=СтрокаКоллекции.ДокументСписания;
				НоваяСтрока.СтатусыОплатыРасходов=СтрокаКоллекции.СтатусыОплатыРасходовСписания;
				НоваяСтрока.ТОП=СтрокаКоллекции.ТОПСписания;
				НоваяСтрока.НеПринимаетсяУСН=СтрокаКоллекции.НеПринимаетсяУСН_Списание;
				
				Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаНеПринимаетсяУСН;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаНеПринимаетсяУСН_НДС;
				Иначе
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаПринятыхРасходов;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
				КонецЕсли;	
				
			Иначе	/// Иначе несколько строк
				НоваяСтрока=тзДвиженияРасходыПриУСН.Добавить();
				Если НЕ ТипЗнч(СтрокаКоллекции.ДокументОплаты)=тип("ДокументСсылка.АвансовыйОтчет") И НЕ ТипЗнч(СтрокаКоллекции.ДокументОплаты)=тип("ДокументСсылка.ДокументРасчетовСКонтрагентом") тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции,,"Номенклатура");
				Иначе
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции);
				КонецЕсли;
				НоваяСтрока.РасчетныйДокумент=СтрокаКоллекции.ДокументОплаты;
				НоваяСтрока.СтатусыОплатыРасходов=СтрокаКоллекции.СтатусыОплатыРасходовОплаты;
				НоваяСтрока.ТОП=СтрокаКоллекции.ТОПОплаты;
				НоваяСтрока.НеПринимаетсяУСН=СтрокаКоллекции.НеПринимаетсяУСН_Оплата;
				Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаНеПринимаетсяУСН;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаНеПринимаетсяУСН_НДС;
				Иначе
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаПринятыхРасходов;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
				КонецЕсли;	

				НоваяСтрока=тзДвиженияРасходыПриУСН.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции);
				НоваяСтрока.РасчетныйДокумент=СтрокаКоллекции.ДокументПокупки;
				НоваяСтрока.СтатусыОплатыРасходов=СтрокаКоллекции.СтатусыОплатыРасходовПокупки;
				НоваяСтрока.ТОП=СтрокаКоллекции.ТОППокупки;
				НоваяСтрока.НеПринимаетсяУСН=СтрокаКоллекции.НеПринимаетсяУСН_Покупки;
				Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаНеПринимаетсяУСН;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаНеПринимаетсяУСН_НДС;
				Иначе
					НоваяСтрока.Сумма=СтрокаКоллекции.СуммаПринятыхРасходов;
					НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаКоллекции.ДокументСписания) Тогда
					НоваяСтрока=тзДвиженияРасходыПриУСН.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции,,"ДоговорКонтрагента");
					НоваяСтрока.РасчетныйДокумент=СтрокаКоллекции.ДокументСписания;
					НоваяСтрока.СтатусыОплатыРасходов=СтрокаКоллекции.СтатусыОплатыРасходовСписания;
					НоваяСтрока.ТОП=СтрокаКоллекции.ТОПСписания;
					НоваяСтрока.НеПринимаетсяУСН=СтрокаКоллекции.НеПринимаетсяУСН_Списание;
					
					Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда
						НоваяСтрока.Сумма=СтрокаКоллекции.СуммаНеПринимаетсяУСН;
						НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаНеПринимаетсяУСН_НДС;
					Иначе
						НоваяСтрока.Сумма=СтрокаКоллекции.СуммаПринятыхРасходов;
						НоваяСтрока.СуммаНДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;		
		
		Если СтрокаКоллекции.СуммаНеПринимаетсяУСН<>0 Тогда Продолжить; КонецЕсли; 
		Если СтрокаКоллекции.СуммаПринятыхРасходов=0 Тогда Продолжить; КонецЕсли;
		
		НоваяСтрока=тзДвиженияКУДиР.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции);
		
		НоваяСтрока.Графа7=СтрокаКоллекции.СуммаПринятыхРасходов;
		НоваяСтрока.НДС=СтрокаКоллекции.СуммаПринятыхРасходовНДС;
		
		НоваяСтрока.Содержание=СтрокаКоллекции.Содержание;
		
		Если ЗначениеЗаполнено(СтрокаКоллекции.ДокументОплаты) И ЗначениеЗаполнено(СтрокаКоллекции.ДокументПокупки) И ЗначениеЗаполнено(СтрокаКоллекции.ДокументСписания) Тогда
			Если НачалоДня(СтрокаКоллекции.ДокументОплаты.Дата)<НачалоДня(СтрокаКоллекции.ДокументСписания.Дата)  Тогда
				НоваяСтрока.Дата=СтрокаКоллекции.ДокументСписания.Дата;
				НоваяСтрока.Графа2="№ "+СокрЛП(СтрокаКоллекции.ДокументСписания.Номер)+" от "+СокрЛП(СтрокаКоллекции.ДокументСписания.Дата);
			Иначе
				НоваяСтрока.Дата=СтрокаКоллекции.ДокументОплаты.Дата;
				НоваяСтрока.Графа2="№ "+СокрЛП(СтрокаКоллекции.ДокументОплаты.Номер)+" от "+СокрЛП(СтрокаКоллекции.ДокументОплаты.Дата);
			КонецЕсли;	
		ИначеЕсли ЗначениеЗаполнено(СтрокаКоллекции.ДокументОплаты) И ЗначениеЗаполнено(СтрокаКоллекции.ДокументПокупки) Тогда
			Если НачалоДня(СтрокаКоллекции.ДокументОплаты.Дата)<НачалоДня(СтрокаКоллекции.ДокументПокупки.Дата) Тогда
				НоваяСтрока.Дата=СтрокаКоллекции.ДокументПокупки.Дата;
				НоваяСтрока.Графа2="№ "+СокрЛП(СтрокаКоллекции.ДокументПокупки.Номер)+" от "+СокрЛП(СтрокаКоллекции.ДокументПокупки.Дата);
			Иначе
				НоваяСтрока.Дата=СтрокаКоллекции.ДокументОплаты.Дата;
				НоваяСтрока.Графа2="№ "+СокрЛП(СтрокаКоллекции.ДокументОплаты.Номер)+" от "+СокрЛП(СтрокаКоллекции.ДокументОплаты.Дата);
			КонецЕсли;	
		ИначеЕсли ЗначениеЗаполнено(СтрокаКоллекции.ДокументОплаты) И НЕ ЗначениеЗаполнено(СтрокаКоллекции.ДокументПокупки) Тогда
			НоваяСтрока.Дата=СтрокаКоллекции.ДокументОплаты.Дата;
			НоваяСтрока.Графа2="№ "+СокрЛП(СтрокаКоллекции.ДокументОплаты.Номер)+" от "+СокрЛП(СтрокаКоллекции.ДокументОплаты.Дата);
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаКоллекции.ДокументОплаты) И ЗначениеЗаполнено(СтрокаКоллекции.ДокументПокупки) Тогда
			НоваяСтрока.Дата=СтрокаКоллекции.ДокументПокупки.Дата;
			НоваяСтрока.Графа2="№ "+СокрЛП(СтрокаКоллекции.ДокументПокупки.Номер)+" от "+СокрЛП(СтрокаКоллекции.ДокументПокупки.Дата);
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаКоллекции.ДокументОплаты) И НЕ ЗначениеЗаполнено(СтрокаКоллекции.ДокументПокупки) Тогда
			НоваяСтрока.Дата=Дата;
			НоваяСтрока.Графа2="№     от "+СокрЛП(Дата);
		КонецЕсли;		
	КонецЦикла;	
	
	тзДвиженияРасходыПриУСН.ЗаполнитьЗначения(Организация, "Организация");
	тзДвиженияРасходыПриУСН.ЗаполнитьЗначения(Истина, "Активность");
	тзДвиженияРасходыПриУСН.ЗаполнитьЗначения(Дата, "Период");
	тзДвиженияРасходыПриУСН.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
	
	тзДвиженияКУДиР.ЗаполнитьЗначения(Организация, "Организация");
	тзДвиженияКУДиР.ЗаполнитьЗначения(Истина, "Активность");
	тзДвиженияКУДиР.ЗаполнитьЗначения(Дата, "Период");
	
	
	Движения.КнигаУчетаДоходовИРасходов.Загрузить(тзДвиженияКУДиР);
	Движения.РасходыПриУСН.Загрузить(тзДвиженияРасходыПриУСН);
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий модуля

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УправлениеДокументамиСервер.ПередПроведением(Отказ, РежимПроведения, ЭтотОбъект);
	Если Отказ Тогда Возврат; КонецЕсли; 
	
	ДвиженияПоРегистрам(Отказ);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Операторы основной программы

УправлениеДокументамиСервер.ИнициализацияМодуля(ДополнительныеСвойства);