&НаКлиенте
Процедура ТабличныйДокумент_Выбор(Элемент, Область, СтандартнаяОбработка)
	ВыбранныйКод=ТабличныйДокумент.Область(Область.Верх, 1, Область.Верх, 1).Текст;
	Если ПустаяСтрока(ВыбранныйКод) ИЛИ (НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(ВыбранныйКод)) Тогда
		ПоказатьПредупреждение(, "Выберите строку с кодом", 20); Возврат;
	КонецЕсли;	
	ОповеститьОВыборе(ВыбранныйКод);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ИмяМакета="АдминистраторДохода" Тогда
		Заголовок="Выберите администратора доходов из классификатора";
	Иначе //АдминистраторыДоходовБюджетов
		Заголовок="Выберите статью доходов из классификатора";
	КонецЕсли;
	ТабличныйДокумент.Вывести(РегистрыСведений.РеквизитыУплатыНалоговИПлатежейВБюджет.ПолучитьМакет(Параметры.ИмяМакета));
	ТабличныйДокумент.ФиксацияСверху=1;	
КонецПроцедуры