Процедура УстановитьОтборПоВладельцу(Форма, ДинамическийСписок) Экспорт
	Если НЕ Форма.ВладелецФормы=Неопределено Тогда
		МассивВладельцев=УправлениеМетаданными.ВладельцыОбъекта(Форма.ИмяФормы);
		Если НЕ МассивВладельцев.Количество()=0 Тогда
			МассивТиповВладельцев=Новый Массив;
			Для каждого ПолноеИмя Из МассивВладельцев Цикл
				МассивТиповВладельцев.Добавить(Тип(стрЗаменить(ПолноеИмя, ".", "Ссылка.")));
			КонецЦикла;
			
			Если Форма.ВладелецФормы.Имя="КомпоновщикНастроекНастройкиОтборПравоеЗначение" Тогда
				СписокЗначенийВладельцев=Новый СписокЗначений;
				
				МассивВидовСравнения=Новый Массив;
				МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
				МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
				МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
				МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии);
				
				ФормаНастройкиОтчета=ОбщегоНазначенияКлиент.ОбъектФормыПоЭлементу(Форма.ВладелецФормы, "ФормаКлиентскогоПриложения");			
				Для каждого СтрокаКоллекции Из ФормаНастройкиОтчета.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
					Если НЕ ЗначениеЗаполнено(СтрокаКоллекции.ПравоеЗначение) Тогда Продолжить; КонецЕсли;
					//Если МассивВидовСравнения.Найти(СтрокаКоллекции.ВидСравнения)=Неопределено Тогда Продолжить; КонецЕсли; 
					
					Если МассивВидовСравнения.Найти(СтрокаКоллекции.ВидСравнения)=Неопределено Тогда
						Тип=ТипЗнч(СтрокаКоллекции.ПравоеЗначение);
					Иначе
						Тип=СтрокаКоллекции.ПравоеЗначение.ТипЗначения.Типы()[0];
					КонецЕсли; 
					
					Если МассивТиповВладельцев.Найти(Тип)=Неопределено Тогда Продолжить; КонецЕсли;
					
					СписокЗначенийВладельцев.Добавить(СтрокаКоллекции.ПравоеЗначение);
				КонецЦикла;
				
				Если НЕ СписокЗначенийВладельцев.Количество()=0 Тогда
					ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ДинамическийСписок, "Владелец", СписокЗначенийВладельцев, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 