&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	Если Команда.Имя="РедактироватьНастройку" Тогда
		ПараметрыФормы=Новый Структура("Документ", Запись.Документ);
		ОписаниеОповещения=Новый ОписаниеОповещения("ОбработчикОповещения_РедактироватьНастройку", ЭтотОбъект);
		ОткрытьФорму("РегистрСведений.СтруктураПодчиненности.Форма.ФормаНастройки", ПараметрыФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	ИначеЕсли Команда.Имя="СформироватьЗапросПоУмолчанию" Тогда
		СформироватьЗапросПоУмолчаниюНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещения_РедактироватьНастройку(Параметр1, Параметр2) Экспорт
	Если НЕ Параметр1=Неопределено Тогда Запись.Запрос=Параметр1; КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьЗапросПоУмолчаниюНаСервере()
	Запись.Запрос=РегистрыСведений.СтруктураПодчиненности.СформироватьЗапросПоУмолчанию(Запись.Документ);
	Если ПустаяСтрока(Запись.Запрос) Тогда
		Сообщить("Ошибка: не удалось сформировать запрос!");
	КонецЕсли;
	Запись.ЗапросРодители=РегистрыСведений.СтруктураПодчиненности.СформироватьЗапросПоУмолчанию_Родитель(Запись.Документ, Истина);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	тзБуфер=ТекущийОбъект.Оформление.Получить();
	Если ТипЗнч(тзБуфер)=Тип("ТаблицаЗначений") Тогда
		Для каждого СтрокаКоллекции Из тзБуфер Цикл
			ЗаполнитьЗначенияСвойств(тзОформление.Добавить(), СтрокаКоллекции);
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.Оформление=Новый ХранилищеЗначения(РеквизитФормыВЗначение("тзОформление"));
КонецПроцедуры