Процедура ВидимостьЭлементовФормы()
	Элементы.ГруппаБанк.Видимость=Объект.ТипОплаты=ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.БанковскийКредит");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="ТипОплаты" Тогда
		ВидимостьЭлементовФормы();
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементовФормы();
КонецПроцедуры
