Процедура Открыть(ИмяТабличнойЧасти, Форма, Объект) Экспорт
	КомпоновщикНастроек=СортировкаТабличнойЧастиСервер.СформироватьКомпоновщикНастроек(ИмяТабличнойЧасти, Объект.Ссылка, Форма.УникальныйИдентификатор);

	ПараметрыФормы=Новый Структура;
	ПараметрыФормы.Вставить("КомпоновщикНастроек", КомпоновщикНастроек);

	ОписаниеОповещения=Новый ОписаниеОповещения("ОбработчикОповещения_Сортировка", СортировкаТабличнойЧастиКлиент, Новый Структура("Форма,ИмяТабличнойЧасти", Форма, ИмяТабличнойЧасти));
	ОткрытьФорму("ОбщаяФорма.Сортировка", ПараметрыФормы, Форма, Форма.УникальныйИдентификатор,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

Процедура ОбработчикОповещения_Сортировка(Параметр1, Параметр2) Экспорт
	Если Параметр1=Неопределено Тогда Возврат; КонецЕсли;
	
	стрСортировка="";
	Для каждого СтрокаКоллекции Из Параметр1.Настройки.Порядок.Элементы Цикл
		стрИмя=СокрЛП(СтрокаКоллекции.Поле);
		Если ПустаяСтрока(стрИмя) Тогда Продолжить; КонецЕсли;
		стрСортировка=стрСортировка+?(ПустаяСтрока(стрСортировка), "", ",")+стрИмя+" "+?(СтрокаКоллекции.ТипУпорядочивания=НаправлениеСортировкиКомпоновкиДанных.Возр, "Возр", "Убыв");
	КонецЦикла;
	Если ПустаяСтрока(стрСортировка) Тогда Возврат; КонецЕсли;

	Параметр2.Форма.ВыполнитьСортировкуТабличнойЧасти(Параметр2.ИмяТабличнойЧасти, стрСортировка);
КонецПроцедуры