&НаКлиенте
Процедура ОбработчикОповещения_ВводПериода(Параметр1, Параметр2) Экспорт
	Если НЕ Параметр1=КодВозвратаДиалога.Да Тогда
		Запись.Период=ТекущаяДата();
	КонецЕсли;
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="Период" Тогда
		Если Запись.Период > ТекущаяДата() Тогда
			ОписаниеОповещения=Новый ОписаниеОповещения("ОбработчикОповещения_ВводПериода", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения,"Вы действительно хотите ввести данные" + Символы.ПС + "о инвалидности сотрудника на будущую дату?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет, "Внимание", КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","Инвалидность"), Запись.Сотрудник);
КонецПроцедуры