&НаКлиенте
Процедура ЗаполнитьТекстКорреспондента()
	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда Возврат; КонецЕсли;

	ТипВладельца=ТипЗнч(Объект.Владелец);
	Если ТипВладельца=Тип("СправочникСсылка.Организации") Тогда
		СтрКорреспондента=СокрЛП(ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Владелец, "НаименованиеПолное"));
	ИначеЕсли ТипВладельца=Тип("СправочникСсылка.Контрагенты") Тогда
		СтрКорреспондента=СокрЛП(ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Владелец, "НаименованиеПолное"));
	КонецЕсли;

	Если НЕ Объект.БанкДляРасчетов.Пустая() Тогда
		СтрКорреспондента=СтрКорреспондента+" р/с "+Объект.НомерСчета+" в "+Объект.Банк+" "+ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Банк, "Город"); 
	КонецЕсли;

	Объект.ТекстКорреспондента=СтрКорреспондента;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если (НЕ ЗначениеЗаполнено(Объект.ВалютаДенежныхСредств)) ИЛИ (Объект.ВалютаДенежныхСредств=ВалютныйУчетСервер.ВалютаБухУчета()) Тогда
		Элементы.НомерИДатаРазрешения.Видимость=Ложь;
	Иначе
		Элементы.НомерИДатаРазрешения.Видимость=Истина;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов формы

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="Банк" Или Элемент.Имя="НомеСчета" Или Элемент.Имя="БанкДляРасчетов" Тогда
		ЗаполнитьТекстКорреспондента();
	ИначеЕсли Элемент.Имя="ВалютаДенежныхСредств" Тогда
		УстановитьВидимость();
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СобытияФормыСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПустаяСтрока(Объект.ВидСчета) Тогда
		Объект.ВидСчета="Расчетный";
	КонецЕсли;	
	ЗаполнитьТекстКорреспондента();
	
	УстановитьВидимость();

	СобытияФормыКлиент.ПриОткрытии(Отказ, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СобытияФормыКлиент.ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СобытияФормыКлиент.ПриЗакрытии(ЗавершениеРаботы, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	СобытияФормыКлиент.ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	СобытияФормыКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	СобытияФормыКлиент.ОбработкаАктивизации(АктивныйОбъект, Источник, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	СобытияФормыКлиент.ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка, ЭтаФорма, Объект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	СобытияФормыСервер.ПриЧтенииНаСервере(ТекущийОбъект, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СобытияФормыКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма, Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СобытияФормыСервер.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма, Объект);	
КонецПроцедуры
 
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	СобытияФормыСервер.ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма, Объект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)	
	СобытияФормыСервер.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	СобытияФормыКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	СобытияФормыКлиент.ВнешнееСобытие(Источник, Событие, Данные, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначения(СтандартнаяОбработка)
	СобытияФормыКлиент.ВыборЗначения(СтандартнаяОбработка, ЭтаФорма, Объект);
КонецПроцедуры