Процедура ОбработкаЗагрузки(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, Пользователь)
	Если ТипЗнч(КлючНастроек)=Тип("СправочникСсылка.ВариантыОтчетов") Тогда
		Настройки=КлючНастроек.Настройка.Получить();
		Настройки.ДополнительныеСвойства.Вставить("Заголовок", СокрЛП(КлючНастроек.Владелец)+" (Вариант:"+СокрЛП(КлючНастроек)+")");
		Настройки.ДополнительныеСвойства.Вставить("ДатаНачала", КлючНастроек.ДатаНачала);
		Настройки.ДополнительныеСвойства.Вставить("ДатаКонца", КлючНастроек.ДатаКонца);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаСохранения(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, Пользователь)
	Если ТипЗнч(КлючНастроек)=Тип("СправочникСсылка.ВариантыОтчетов") Тогда
		СправочникОбъект=КлючНастроек.ПолучитьОбъект();
		СправочникОбъект.Настройка=Новый ХранилищеЗначения(Настройки);
		СправочникОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

