&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	Если Команда.Имя="Заполнить" Тогда
		тзДокументы_Заполнить();

	ИначеЕсли Команда.Имя="ОК" Тогда
		СтруктураОтбора=Новый Структура;
		СтруктураОтбора.Вставить("Использование", Истина);
		МассивЗначений=тзДокументы.НайтиСтроки(СтруктураОтбора);
		Если МассивЗначений.Количество()=0 Тогда Возврат; КонецЕсли;

		Соответствие=Новый Соответствие;
		Для Каждого СтркаКоллекции из МассивЗначений Цикл
			Если ТипЗнч(СтркаКоллекции.Объект)=Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
				Данные=ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта(СтркаКоллекции.Объект, "Дата,Номер");
				Соответствие.Вставить(Данные.Номер, Данные.Дата);
			Иначе
				Данные=ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта(СтркаКоллекции.Объект, "ДатаВходящегоДокумента,НомерВходящегоДокумента");
				Соответствие.Вставить(Данные.НомерВходящегоДокумента, Данные.ДатаВходящегоДокумента);
			КонецЕсли;
		КонецЦикла;

		ЭтаФорма.Закрыть(Соответствие);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура тзДокументы_Заполнить()
	тзДокументы.Очистить();
	
	СтруктураОтбора=Новый Структура;
	СтруктураОтбора.Вставить("Использование", Истина);
	МассивЗначений=тзВидыДокументов.НайтиСтроки(СтруктураОтбора);
	Если МассивЗначений.Количество()=0 Тогда Возврат; КонецЕсли;

	стрУсловий="";
	Для Каждого СтрокиМассива из МассивЗначений Цикл
		стрУсловий = стрУсловий+ ?(стрУсловий="", "", "ИЛИ ")+" Регистратор Ссылка Документ."+СтрокиМассива.Идентификатор+" ";	
	КонецЦикла;
	ПоДокументамРасчета=Ложь;
	УчетнаяПолитика=ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, Ложь, Организация);
	Если УчетнаяПолитика.ОрганизацияНеЯвляетсяПлательщикомНДС Тогда ПоДокументамРасчета=Истина;	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца", ДатаКонца);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);                                                
	Запрос.Текст="ВЫБРАТЬ
	|	Источник.Регистратор,
	|	Источник."+?(ПоДокументамРасчета,"СуммаБухРасход", "СуммаРасход")+" КАК СуммаБух,
	|	"+?(ПоДокументамРасчета,"Источник.СуммаВалРасход ", 0)+" КАК СуммаВал
	|ИЗ
	|	РегистрНакопления."+?(ПоДокументамРасчета, "ВзаиморасчетыСКонтрагентами", "НДСРасчетыСПокупателями")+".Обороты(
	|			&ДатаНачала,
	|			&ДатаКонца,
	|			Регистратор,
	|			ДоговорКонтрагента = &ДоговорКонтрагента
	|				И "+?(ПоДокументамРасчета, "Контрагент", "Покупатель")+" = &Контрагент
	|				И Организация = &Организация) КАК Источник
	|ГДЕ
	| "+стрУсловий+" 
	|
	|СГРУППИРОВАТЬ ПО
	|	Источник.Регистратор,
	|	Источник."+?(ПоДокументамРасчета, "СуммаБухРасход", "СуммаРасход")+",
	|	"+?(ПоДокументамРасчета, "Источник.СуммаВалРасход", 0)+"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Источник.Регистратор.Дата
	|";
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока=тзДокументы.Добавить();
		НоваяСтрока.Объект=Выборка.Регистратор;
		НоваяСтрока.СуммаБух=Выборка.СуммаБух;
		НоваяСтрока.СуммаВал=Выборка.СуммаВал;
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий табличного поля "Виды документов"

&НаКлиенте
Процедура тпВидыДокументов_ДобавитьСтроку(Идентификатор, Представление)
	НоваяСтрока=тзВидыДокументов.Добавить();
	НоваяСтрока.Идентификатор=Идентификатор;
	НоваяСтрока.Представление=Представление;
	НоваяСтрока.Использование=Истина;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Дата", Дата);
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Контрагент", Контрагент);	
	Параметры.Свойство("ДоговорКонтрагента", ДоговорКонтрагента);
	
	ДатаНачала=НачалоМесяца(ТекущаяДата());
	ДатаКонца=ТекущаяДата();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	тпВидыДокументов_ДобавитьСтроку("ПриходныйКассовыйОрдер", "Приходный кассовый ордер");
	тпВидыДокументов_ДобавитьСтроку("РасходныйКассовыйОрдер", "Расходный кассовый ордер");	
	тпВидыДокументов_ДобавитьСтроку("ПлатежноеПоручениеВходящее", "Платежное поручение входящее");
	тпВидыДокументов_ДобавитьСтроку("ПлатежноеПоручениеИсходящее", "Платежное поручение исходящее");
	тпВидыДокументов_ДобавитьСтроку("ПлатежныйОрдерПоступлениеДенежныхСредств", "Платежный ордер: поступление денежных средств");
КонецПроцедуры
