
&НаКлиенте
Процедура ПоказатьЗаголовок()
	Заголовок="Фамилия, имя, отчество физ. лица: ";
	Если ЗначениеЗаполнено(Запись.ФизЛицо) Тогда
		Заголовок=Заголовок+ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Запись.ФизЛицо, "Наименование");
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="ФизЛицо" Тогда
		ПоказатьЗаголовок();
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Запись.Фамилия=СокрЛП(Запись.Фамилия);
	Запись.Имя=СокрЛП(Запись.Имя);
	Запись.Отчество=СокрЛП(Запись.Отчество);
КонецПроцедуры
