&НаКлиенте
Процедура УстановитьОтборыДинамическихСписков()
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(дсКонтактнаяИнформация, "Объект", Объект.Ссылка);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(дсПаспортныеДанные, "ФизЛицо", Объект.Ссылка);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики оповещений

&НаКлиенте
Процедура ОбработчикОповещения_ВыборКартинки(Параметр1, Параметр2) Экспорт
	Если НЕ ТипЗнч(Параметр1)=Тип("Массив") Тогда Возврат; КонецЕсли;
	АдресКартинки=ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Параметр1[0]), УникальныйИдентификатор);
КонецПроцедуры	 

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов формы

&НаКлиенте
Процедура Атрибут_Нажатие(Элемент, СтандартнаяОбработка)
	Если Элемент.Имя="Картинка" Тогда
		СтандартнаяОбработка=Ложь;
		ДиалогОткрытияФайла=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогОткрытияФайла.ПолноеИмяФайла="";
		//ДиалогОткрытияФайла.Каталог=Каталог;
			//Если Фильтр="Картинки" Тогда
			//	Фильтр="Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|" 
			//	+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
			//	+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
			//	+ "Формат TIFF (*.tif)|*.tif|"
			//	+ "Формат GIF (*.gif)|*.gif|"
			//	+ "Формат PNG (*.png)|*.png|"
			//	+ "Формат icon (*.ico)|*.ico|"
			//	+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|";
			//КонецЕсли;		
			//ДиалогОткрытияФайла.Фильтр=Фильтр;
		//ДиалогОткрытияФайла.ИндексФильтра=ИндексФильтра;
		ДиалогОткрытияФайла.Заголовок="Выберите фото";
		ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("ОбработчикОповещения_ВыборКартинки", ЭтотОбъект));	
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий днамического списка "Контактная информация"

&НаКлиенте
Процедура дсКонтактнаяИнформация_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	КонтактнаяИнформацияКлиент.ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр, ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура дсКонтактнаяИнформация_ПередНачаломИзменения(Элемент, Отказ)
	КонтактнаяИнформацияКлиент.ПередНачаломИзменения(Элемент, Отказ, ЭтаФорма);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СобытияФормыСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборыДинамическихСписков();
	СобытияФормыКлиент.ПриОткрытии(Отказ, ЭтаФорма, Объект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда 
		ДвоичныеДанные=ПолучитьИзВременногоХранилища(АдресКартинки);
		ТекущийОбъект.ОсновноеИзображение=Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	КонецЕсли;	
	СобытияФормыСервер.ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма, Объект);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СобытияФормыСервер.ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма, Объект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	АдресКартинки=ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "ОсновноеИзображение");
	СобытияФормыСервер.ПриЧтенииНаСервере(ТекущийОбъект, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьОтборыДинамическихСписков();
	СобытияФормыКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма, Объект);
КонецПроцедуры

