&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	стрКрманда=?(ТипЗнч(Команда)=Тип("Строка"), Команда, Команда.Имя);
	Если стрКрманда="Выбрать" Тогда
		ТекущиеДанные=Элементы.дзИсточникДанных.ТекущиеДанные;
		Если ТекущиеДанные=Неопределено Тогда Возврат; КонецЕсли;
		ЭтаФорма.Закрыть(ТекущиеДанные.Источник);
	КонецЕсли;	 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий элементов формы

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если СтарыйМетаконфигуратор Тогда
		дзИсточникДанных_Инициализация("МетаКонфигуратор");
	Иначе
		дзИсточникДанных_Инициализация("ИдентификаторыОбъектовМетаданных");
	КонецЕсли;	 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики табличного поля "Источник данных"

Процедура дзИсточникДанных_Инициализация(стрИмя)
	МетаКонфигуратор=Справочники[стрИмя];
	
	дзБуфер=РеквизитФормыВЗначение("дзИсточникДанных");
	дзБуфер.Строки.Очистить();

	//Документы
	НоваяСтрока=дзБуфер.Строки.Добавить();
	НоваяСтрока.Источник=МетаКонфигуратор.Документы;
	НоваяСтрока.Картинка=БиблиотекаКартинок.Документ;

	//Регистры накопления
	НоваяВетка=дзБуфер.Строки.Добавить();
	НоваяВетка.Источник=МетаКонфигуратор.РегистрыНакопления;
	НоваяВетка.Картинка=БиблиотекаКартинок.РегистрНакопления;
	Выборка=МетаКонфигуратор.Выбрать(НоваяВетка.Источник);
	Пока Выборка.Следующий() Цикл
		НоваяСтрока=НоваяВетка.Строки.Добавить();
		НоваяСтрока.Источник=Выборка.Ссылка;
		НоваяСтрока.Картинка=БиблиотекаКартинок.РегистрНакопления;
	КонецЦикла;

	//Регистры бухгалтерии
	НоваяВетка=дзБуфер.Строки.Добавить();
	НоваяВетка.Источник=МетаКонфигуратор.РегистрыБухгалтерии;
	НоваяВетка.Картинка=БиблиотекаКартинок.РегистрБухгалтерии;
	Выборка=МетаКонфигуратор.Выбрать(НоваяВетка.Источник);
	Пока Выборка.Следующий() Цикл
		НоваяСтрока=НоваяВетка.Строки.Добавить();
		НоваяСтрока.Источник=Выборка.Ссылка;
		НоваяСтрока.Картинка=БиблиотекаКартинок.РегистрБухгалтерии;
	КонецЦикла;

	ЗначениеВРеквизитФормы(дзБуфер, "дзИсточникДанных");
КонецПроцедуры	 

&НаКлиенте
Процедура дзИсточникДанных_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыполнитьДействие("Выбрать");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	дзИсточникДанных_Инициализация("ИдентификаторыОбъектовМетаданных");
КонецПроцедуры
