&НаКлиенте
Процедура ВидимостьЭлементовФормы()
	Элементы.СтраницаУСН.Видимость=НЕ Запись.СистемаНалогообложения=ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Общая");
КонецПроцедуры
	
&НаКлиенте
Процедура ОткрытьРаспределениеЗатрат(Команда)
	ПараметрыФормы=Новый Структура("Отбор", Новый Структура("Организация", Запись.Организация));
	ОткрытьФорму("РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокПрямыхРасходов(Команда)
	ПараметрыФормы=Новый Структура("Отбор", Новый Структура("Организация", Запись.Организация));
	ОткрытьФорму("РегистрСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокСтавкиНалогаНаПрибуль(Команда)
	ПараметрыФормы=Новый Структура("Отбор", Новый Структура("Организация", Запись.Организация));
	ОткрытьФорму("РегистрСведений.СтавкиНалогаНаПрибыль.Форма.ФормаСписка", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="СистемаНалогообложения" Тогда
		ВидимостьЭлементовФормы();	
	КонецЕсли;	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ИсполняемыеФункции", ИсполняемыеФункции);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьЭлементовФормы();
	Если ТипЗнч(ИсполняемыеФункции)=Тип("Структура") И ИсполняемыеФункции.Свойство("ПриОткрытии") Тогда
		Выполнить(ИсполняемыеФункции.ПриОткрытии);
	КонецЕсли;
КонецПроцедуры
