&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	ДинамическиеСпискиКлиент.ВыполнитьДействие(Команда.Имя, ЭтаФорма);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий табличного поля "Динамический список"

&НаКлиенте
Процедура ДинамическийСписок_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДинамическиеСпискиКлиент.Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписок_ВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Если ТипЗнч(Значение)=Тип("Массив") Тогда
		ОповеститьОВыборе(Значение[0]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписок_ПриСменеТекущегоРодителя(Элемент)
	//Сообщить(111);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ДинамическиеСпискиСервер.НастройкаПоПравилам(ДинамическийСписок, ЭтаФорма);
	Элементы.ДинамическийСписок.РежимВыбора=Параметры.РежимВыбора;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДинамическиеСпискиКлиент.ПриОткрытии(Отказ, ДинамическийСписок, ЭтаФорма);
	Элементы.ДинамическийСписок.Отображение=ОтображениеТаблицы.Список;

	//Временная мера..
	////Если НЕ ДинамическийСписок.Отбор.Элементы.Количество()=0 Тогда
	////	стрИмя=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ДинамическийСписок.Отбор.Элементы[0].ПравоеЗначение, "ИмяПредопределенныхДанных");
	////	ДинамическийСписок.Отбор.Элементы.Очистить();
	////	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ДинамическийСписок, "ПолноеИмя", стрИмя);			
	////КонецЕсли; 
КонецПроцедуры