&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда Возврат; КонецЕсли;

	Если Объект.Владелец.Предопределенный Тогда
		МассивСтрок=СтрРазделить(Объект.Владелец.ИмяПредопределенныхДанных, "_");
	Иначе
		МассивСтрок=СтрРазделить(Объект.Владелец.ПолноеИмя, ".");
	КонецЕсли;
	Если МассивСтрок.Количество() < 2 Тогда Возврат; КонецЕсли;

	Ссылка=XMLЗначение(Тип(МассивСтрок[0]+"Ссылка."+МассивСтрок[1]), Объект.Код);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ=Истина;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ПоказатьЗначение(, Ссылка);
	КонецЕсли;
КонецПроцедуры