Процедура ЗаполнитьПоУмолчанию() Экспорт
	Макет=Справочники.ДокументыУдостоверяющиеЛичность.ПолучитьМакет("КлассификаторИМНС");
	Таблица=Новый ТабличныйДокумент;
	Таблица.Вывести(Макет);
	Для НомерСтроки=4 По Таблица.ВысотаТаблицы Цикл
		КодИФНС=Таблица.Область(НомерСтроки, 2, НомерСтроки, 2).Текст; //Код ИФНС
		СправочникСсылка=Справочники.ДокументыУдостоверяющиеЛичность.НайтиПоКоду(КодИФНС);
		Если СправочникСсылка.Пустая() Тогда
			СправочникОбъект=Справочники.ДокументыУдостоверяющиеЛичность.СоздатьЭлемент();
			СправочникОбъект.Код=КодИФНС;
		Иначе
			СправочникОбъект=СправочникСсылка.ПолучитьОбъект();
		КонецЕсли;
		СправочникОбъект.КодИМНС=КодИФНС;
		СправочникОбъект.КодПФР=Таблица.Область(НомерСтроки, 3, НомерСтроки, 3).Текст;
		СправочникОбъект.Наименование=Таблица.Область(НомерСтроки, 4, НомерСтроки, 4).Текст;		
		СправочникОбъект.Записать();
	КонецЦикла;
КонецПроцедуры	 