&НаКлиенте
Процедура НастройкаСоставаРегистров(Команда)
	СписокИспользуемыхРегистров=Новый СписокЗначений;
	Для Каждого Строка Из Объект.ТаблицаРегистров Цикл
		СписокИспользуемыхРегистров.Добавить(Строка.Имя);
	КонецЦикла;
	ОткрытьФорму("Документ.КорректировкаЗаписейРегистров.Форма.ФормаВыбораРегистра", Новый Структура("СписокИспользуемыхРегистров", СписокИспользуемыхРегистров),,,,, Новый ОписаниеОповещения("НастройкаСоставаРегистровЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСоставаРегистровЗавершение(Результат, ДополнительныеПараметры) Экспорт
    Если ТипЗнч(Результат)=Тип("СписокЗначений") Тогда
        ОбработатьИзменениеРегистров(Результат);        
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьСтраницу(ИмяСтраницы, Заголовок, Родитель)
	НовыйЭлемент=Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), Родитель);
	НовыйЭлемент.Вид=ВидГруппыФормы.Страница;
	НовыйЭлемент.Заголовок=Заголовок;
	НовыйЭлемент.РастягиватьПоВертикали=Истина;
	НовыйЭлемент.РастягиватьПоГоризонтали=Истина;

	Возврат НовыйЭлемент;
КонецФункции

&НаСервере
Функция ПолучитьИмяСтраницыРегистра(ИмяРегистра)
	Возврат "Страница" + ИмяРегистра;
КонецФункции

&НаСервере
Процедура УдалитьСтраницуРегистра(ИмяРегистра)
	Элементы.Удалить(Элементы.Найти(ПолучитьИмяСтраницыРегистра(ИмяРегистра)));
КонецПроцедуры

Функция СоздатьСвязиПараметровВыбора(ИсходныйМассив, ПутьКДанным)
	НовыйМассив = Новый Массив;
	Для Каждого Элемент Из ИсходныйМассив Цикл
		НовыйМассив.Добавить(Новый СвязьПараметраВыбора(Элемент.Имя, ПутьКДанным + "." + Элемент.ПутьКДанным, Элемент.ИзменениеЗначения));
	КонецЦикла;
	Возврат Новый ФиксированныйМассив(НовыйМассив);
КонецФункции

&НаСервере
Функция СоздатьТаблицуФормыРегистра(ИмяРегистра, КолонкиТаблицы, Родитель)
	ТаблицаФормы=Элементы.Добавить("ТаблицаДвижений"+ИмяРегистра, Тип("ТаблицаФормы"), Родитель);
	ТаблицаФормы.ПутьКДанным="Объект.Движения."+ИмяРегистра;
	Родитель.ПутьКДаннымЗаголовка=ТаблицаФормы.ПутьКДанным+".КоличествоСтрок";

	МассивДобавленныхПолей = Новый Массив;
	Для Каждого Колонка Из КолонкиТаблицы Цикл
		ПолеФормы = Элементы.Добавить(ТаблицаФормы.Имя + Колонка.Имя, Тип("ПолеФормы"), ТаблицаФормы);
		ПолеФормы.ПутьКДанным           = ТаблицаФормы.ПутьКДанным + "." + Колонка.Имя;
		ПолеФормы.Заголовок             = Колонка.Заголовок;
		ПолеФормы.Вид                   = ВидПоляФормы.ПолеВвода;

		МассивДобавленныхПолей.Добавить(ПолеФормы);
	КонецЦикла;

	Счетчик=0;
	Для Каждого ПолеФормы Из МассивДобавленныхПолей Цикл
		Если КолонкиТаблицы[Счетчик].СвязиПараметровВыбора <> Неопределено И КолонкиТаблицы[Счетчик].СвязиПараметровВыбора.Количество() > 0 Тогда
			ПолеФормы.СвязиПараметровВыбора = СоздатьСвязиПараметровВыбора(КолонкиТаблицы[Счетчик].СвязиПараметровВыбора, "Элементы."+ТаблицаФормы.Имя+".ТекущиеДанные");
		КонецЕсли;
		Счетчик=Счетчик+1;
	КонецЦикла;

	Возврат ТаблицаФормы;
КонецФункции

&НаСервере
Функция СоздатьМассивПолейРегистра(МенеджерРегистра, МетаданныеРегистра)

	ТаблицаРегистра = МенеджерРегистра.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ТаблицаРегистра.Колонки.Удалить("Регистратор");
	Если ТаблицаРегистра.Колонки.Найти("МоментВремени") <> Неопределено Тогда
		ТаблицаРегистра.Колонки.Удалить("МоментВремени");
	КонецЕсли;

	МассивКолонок = Новый Массив;
	Для Каждого Колонка Из ТаблицаРегистра.Колонки Цикл
		ИнформацияОКолонке = Новый Структура("Имя, Заголовок, СвязиПараметровВыбора", Колонка.Имя);
		МассивКолонок.Добавить(ИнформацияОКолонке);
	КонецЦикла;

	// Обновление заголовков колонок таблицы по синонимам полей регистра.
	МассивПолейРегистра = Новый Массив;
	МассивПолейРегистра.Добавить("Измерения");
	МассивПолейРегистра.Добавить("Ресурсы");
	МассивПолейРегистра.Добавить("Реквизиты");

	Для Каждого ВидПоля Из МассивПолейРегистра Цикл
		Для Каждого Поле Из МетаданныеРегистра[ВидПоля] Цикл
			Для Каждого ЭлементМассива Из МассивКолонок Цикл
				Если ЭлементМассива.Имя = Поле.Имя Тогда
					ЭлементМассива.Заголовок             = Поле.Синоним;
					ЭлементМассива.СвязиПараметровВыбора = Поле.СвязиПараметровВыбора;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	Возврат МассивКолонок;
КонецФункции

&НаСервере
Процедура ПоказатьТаблицуРегистраНаСтранице(Знач СтрокаТЧ)

	Если НЕ Метаданные.РегистрыНакопления.Найти(СтрокаТЧ.Имя)=Неопределено Тогда
		СтраницаРегистра      = Элементы.НастройкаРегистровНакопления;
		МенеджерРегистра      = РегистрыНакопления[СтрокаТЧ.Имя];
		МетаданныеРегистра    = Метаданные.РегистрыНакопления[СтрокаТЧ.Имя];
		РегистрИмеетПолеПериод= Истина;

	ИначеЕсли НЕ Метаданные.РегистрыСведений.Найти(СтрокаТЧ.Имя)=Неопределено Тогда
		СтраницаРегистра      = Элементы.НастройкаРегистровСведений;
		МенеджерРегистра      = РегистрыСведений[СтрокаТЧ.Имя];
		МетаданныеРегистра    = Метаданные.РегистрыСведений[СтрокаТЧ.Имя];
		РегистрИмеетПолеПериод = НЕ МетаданныеРегистра.ПериодичностьРегистраСведений=Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический;

	ИначеЕсли НЕ Метаданные.РегистрыБухгалтерии.Найти(СтрокаТЧ.Имя)=Неопределено Тогда
		СтраницаРегистра      = Элементы.НастройкаРегистровБухгалтерии;
		МенеджерРегистра      = РегистрыБухгалтерии[СтрокаТЧ.Имя];
		МетаданныеРегистра    = Метаданные.РегистрыБухгалтерии[СтрокаТЧ.Имя];
		РегистрИмеетПолеПериод= Истина;

	Иначе
		Возврат;
	КонецЕсли;

	МассивКолонок=СоздатьМассивПолейРегистра(МенеджерРегистра, МетаданныеРегистра);

	СтраницаДляРегистра=СоздатьСтраницу(ПолучитьИмяСтраницыРегистра(СтрокаТЧ.Имя), МетаданныеРегистра.Синоним, СтраницаРегистра);

	ТаблицаФормы = СоздатьТаблицуФормыРегистра(СтрокаТЧ.Имя, МассивКолонок, СтраницаДляРегистра);

	Если РегистрИмеетПолеПериод Тогда
		//*** ТаблицаФормы.УстановитьДействие("ПриНачалеРедактирования", "Подключаемый_ТаблицаПриНачалеРедактирования");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоказатьРегистры()
	Для Каждого СтрокаТаб Из Объект.ТаблицаРегистров Цикл
		ПоказатьТаблицуРегистраНаСтранице(СтрокаТаб);
	КонецЦикла;
КонецПроцедуры

&НаСервере
// Процедура служит для включения/исключение регистров из списка редактируемых.
//
Процедура ОбработатьИзменениеРегистров(СписокРегистров)
	Для Каждого Элемент Из СписокРегистров Цикл
		// Нужно добавить новый регистр.
		Если Элемент.Пометка Тогда
			СтрокаТЧ=Объект.ТаблицаРегистров.Добавить();
			СтрокаТЧ.Имя=Элемент.Значение;
			ПоказатьТаблицуРегистраНаСтранице(СтрокаТЧ);
		Иначе
			Для Каждого Строка Из Объект.ТаблицаРегистров.НайтиСтроки(Новый Структура("Имя", Элемент.Значение)) Цикл
				Объект.ТаблицаРегистров.Удалить(Строка);
			КонецЦикла;
			Объект.Движения[Элемент.Значение].Очистить();
			УдалитьСтраницуРегистра(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	Модифицированность = Истина;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоказатьРегистры();	
КонецПроцедуры