Функция ПолучитьНазваниеРегионаПоКоду(КодРег)

	Если ПустоеЗначение(КодРег) Тогда
		Возврат "";
	КонецЕсли;

	Попытка
		КодРегЧисло = Число(КодРег);
	Исключение
		Возврат "";
	КонецПопытки;

	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	АдресныйКлассификатор.КодРегионаВКоде,
	               |	АдресныйКлассификатор.ТипАдресногоЭлемента,
	               |	АдресныйКлассификатор.Наименование,
	               |	АдресныйКлассификатор.Код
	               |ИЗ
	               |	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	               |
	               |ГДЕ
	               |	АдресныйКлассификатор.ТипАдресногоЭлемента = &ТипАдресногоЭлемента И
	               |	АдресныйКлассификатор.КодРегионаВКоде = &КодРегионаВКоде";

	Запрос.УстановитьПараметр("КодРегионаВКоде", КодРегЧисло);
	Запрос.УстановитьПараметр("ТипАдресногоЭлемента", 1);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Количество() > 0 Тогда
		
		Выборка.Следующий();
		Возврат КонтактнаяИнформацияСервер.ПолучитьПолноеНазвание(Выборка.Код);
		
	Иначе

		Возврат "";

	КонецЕсли;

КонецФункции // ПолучитьНазваниеРегионаПоКоду

// Определяет страну, гражданином которой является ФизЛицо по состоянию на ДатуЗначения
Функция ПолучитьГражданство(ФизЛицо, ДатаЗначения) 
	
	Гражд = РегистрыСведений.ГражданствоФизЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизЛицо", ФизЛицо));

	Если Гражд.Количество() > 0 Тогда
		Возврат Гражд[0].Страна;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает паспортные данные ФизЛица по состоянию на ДатуЗначения
Функция ПолучитьУдЛичн(ФизЛицо, ДатаЗначения)
	
	Удостоверения = РегистрыСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизЛицо", ФизЛицо));

	Если Удостоверения.Количество() > 0 Тогда
		Возврат Удостоверения[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСУчетомКэша(Кэш, Параметр, ФизЛицо = Неопределено)
	Перем ЗначениеПараметра;
	Перем Ставки;
	
	Если Кэш.Свойство(Параметр, ЗначениеПараметра) Тогда
		Возврат ЗначениеПараметра;
	КонецЕсли;
	
	Если Параметр = "СтавкаНалогаНаПрибыль" Тогда
		Если Метаданные.РегистрыСведений.Найти("СтавкиНалогаНаПрибыль") <> Неопределено Тогда
			Результат = РегистрыСведений.СтавкиНалогаНаПрибыль.СрезПоследних(Кэш.ДатаЗначения, Новый Структура("Организация", Кэш.Организация.Ссылка));
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	ИначеЕсли Параметр = "ЮрАдресОрганизации" Тогда
		ЭлементЮрАдрес = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
		Данные = Новый Структура("Объект, Тип, Вид", Кэш.Организация.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, ЭлементЮрАдрес);
		Результат = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателе" Тогда
		Если ИДКонфигурации() = "ББУ" или ИДКонфигурации() = "ЗБУ" Тогда
			Результат = Неопределено;
		ИначеЕсли Кэш.Организация.Метаданные().Реквизиты.Найти("ИндивидуальныйПредприниматель") <> Неопределено Тогда
			Результат = Новый Массив;
			Результат.Добавить(Новый Структура("ФизическоеЛицо", Кэш.Организация.ИндивидуальныйПредприниматель));
		Иначе
			Данные = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо", Кэш.Организация.Ссылка, Перечисления.ОтветственныеЛицаОрганизаций.ИндивидуальныйПредприниматель);
			Результат = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Кэш.ДатаЗначения, Данные);
		КонецЕсли;
	ИначеЕсли Параметр = "СведенияОРуководителе" Тогда
		Данные = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо, ВидДокумента", Кэш.Организация.Ссылка, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка());
		Результат = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Кэш.ДатаЗначения, Данные);

	ИначеЕсли Параметр = "СведенияОБухгалтере" Тогда
		Данные = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо, ВидДокумента", Кэш.Организация.Ссылка, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка());
		Результат = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Кэш.ДатаЗначения, Данные);

	ИначеЕсли Параметр = "СведенияОбИсполнителе" Тогда
		Если ИДКонфигурации() = "ББУ" Тогда
			Если Метаданные.Перечисления.ОтветственныеЛицаОрганизаций.ЗначенияПеречисления.Найти("Исполнитель") <> Неопределено Тогда
				Данные = Новый Структура("Учреждение, ВидОтветственногоЛица", Кэш.Организация.Ссылка, Перечисления.ОтветственныеЛицаОрганизаций.Исполнитель);
			Иначе
				Данные = Новый Структура("Учреждение, ВидОтветственногоЛица", Кэш.Организация.Ссылка, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
			КонецЕсли;
			Результат = РегистрыСведений.ОтветственныеЛицаУчреждений.СрезПоследних(Кэш.ДатаЗначения, Данные);
		Иначе
			Если Метаданные.Перечисления.ОтветственныеЛицаОрганизаций.ЗначенияПеречисления.Найти("Исполнитель") <> Неопределено Тогда
				Данные = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо, ВидДокумента", Кэш.Организация.Ссылка, Перечисления.ОтветственныеЛицаОрганизаций.Исполнитель, Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка());
			Иначе
				Данные = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо, ВидДокумента", Кэш.Организация.Ссылка, Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка());
			КонецЕсли;
			Результат = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Кэш.ДатаЗначения, Данные);
		КонецЕсли;
	ИначеЕсли Параметр = "СведенияОУполномоченномПредставителе" Тогда
		Если ИДКонфигурации() = "ББУ" Тогда
			Результат = Неопределено;
		Иначе
			Данные = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо, ВидДокумента", Кэш.Организация.Ссылка, Перечисления.ОтветственныеЛицаОрганизаций.Уполномоченныйпредставитель, Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка());
			Результат = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Кэш.ДатаЗначения, Данные);
		КонецЕсли;
	ИначеЕсли Параметр = "ТелефонОрганизации" Тогда
		Если Кэш.ПБОЮЛ Тогда
			Если СвойствоОпределено(Справочники.ВидыКонтактнойИнформации, "ТелефонФизЛицаСлужебный") Тогда
				ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный;
			ИначеЕсли СвойствоОпределено(Справочники.ВидыКонтактнойИнформации, "ТелефонФизЛицаДомашний") Тогда
				ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаДомашний;
			Иначе
				ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица;
			КонецЕсли;
			Данные = Новый Структура("Объект, Тип, Вид", Кэш.Организация.ИндивидуальныйПредприниматель, Перечисления.ТипыКонтактнойИнформации.Телефон, ВидКонтактнойИнформации);
			Результат = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
		Иначе
			ЭлементТелефон = ?(ИДКонфигурации() = "ББУ", Справочники.ВидыКонтактнойИнформации.ТелефонУчреждения, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
			Данные = Новый Структура("Объект, Тип, Вид", Кэш.Организация.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, ЭлементТелефон);
			Результат = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
		КонецЕсли;
	ИначеЕсли Параметр = "УчетнаяПолитикаНалоговыйУчет" Тогда
		ИдКонф = ИДКонфигурации();
		Если ИдКонф = "ББУ" Тогда
			Результат = Неопределено;
		ИначеЕсли ИдКонф = "БП" Тогда
			Результат = РегистрыСведений.УчетнаяПолитика.СрезПоследних(Кэш.ДатаЗначения, Новый Структура("Организация", Кэш.Организация.Ссылка));
		ИначеЕсли ИдКонф = "УПП" Тогда
			ПризнакОтказа = Ложь;
			ПараметрыУчетнойПолитики = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Кэш.ДатаЗначения, ПризнакОтказа, Кэш.Организация.Ссылка, "Нал", Ложь);
			Результат = ?(ПризнакОтказа, Неопределено, ПараметрыУчетнойПолитики);
		Иначе
			Результат = РегистрыСведений.УчетнаяПолитика.СрезПоследних(Кэш.ДатаЗначения, Новый Структура("Организация", Кэш.Организация.Ссылка));
		КонецЕсли;
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные" 
		ИЛИ Параметр = "СведенияОРуководителеПаспортныеДанные" 
		ИЛИ Параметр = "СведенияОБухгалтереПаспортныеДанные" 
		ИЛИ Параметр = "СведенияОУполномоченномПредставителеПаспортныеДанные" Тогда
		
		Результат = ПолучитьУдЛичн(ФизЛицо, Кэш.ДатаЗначения);
		
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателеАдрес" 
		ИЛИ Параметр = "СведенияОРуководителеАдрес" 
		ИЛИ Параметр = "СведенияОБухгалтереАдрес" 
		ИЛИ Параметр = "СведенияОУполномоченномПредставителеАдрес" Тогда
		
		Данные = Новый Структура("Объект, Тип, Вид", ФизЛицо, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
		Результат = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
		
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателеАдресПрописки" Тогда
		
		Если ИДКонфигурации() = "ББУ" или ИДКонфигурации() = "ЗБУ" Тогда
			Результат = Неопределено;
		Иначе
			Данные = Новый Структура("Объект, Тип, Вид", ФизЛицо, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
			Результат = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
		КонецЕсли;
		
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателеГражданство" 
		ИЛИ Параметр = "СведенияОРуководителеГражданство" 
		ИЛИ Параметр = "СведенияОБухгалтереГражданство" 
		ИЛИ Параметр = "СведенияОУполномоченномПредставителеГражданство" Тогда
		
		Если ИДКонфигурации() = "ББУ" или ИДКонфигурации() = "ЗБУ" Тогда
			Результат = Справочники.КлассификаторСтранМира.РОССИЯ;
		Иначе
			Результат = ПолучитьГражданство(ФизЛицо, Кэш.ДатаЗначения);
		КонецЕсли;
		
	КонецЕсли;
				
	Кэш.Вставить(Параметр, Результат);
	Возврат Результат;
	
КонецФункции

Функция ИДКонфигурации() Экспорт
	Возврат "БП"; //для работы регл.отчетности
КонецФункции

Функция СвойствоОпределено(Объект, ИмяСвойства) Экспорт
	
	ГУИД = Новый УникальныйИдентификатор;
	ВремСтрукт = Новый Структура(ИмяСвойства, ГУИД);
	ЗаполнитьЗначенияСвойств(ВремСтрукт, Объект);
	Возврат (ВремСтрукт[ИмяСвойства] <> ГУИД);
	
КонецФункции

// Проверяет соответствие ИНН требованиям
// Параметры:
//		ИНН - строка - проверяемый индивидуальный номер налогоплательщика,
//		ВладелецИНН - ПеречислениеСсылка.ЮрФизЛицо - тип владельца ИНН: физлицо или юрлицо
Функция ИННСоответствуетТребованиям(Знач ИНН, Знач ТипФизЛица) Экспорт

	ИНН = СокрЛП(ИНН);
	ДлинаИНН =  СтрДлина(ИНН);

	Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(ИНН) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Метаданные.Перечисления.Найти("ЮрФизЛицо") = Неопределено Тогда
		ПроверяетсяИННФизЛица = ТипФизЛица;
	Иначе
		ПроверяетсяИННФизЛица = (ТипФизЛица = Истина ИЛИ ТипФизЛица = Перечисления.ЮрФизЛицо.ФизЛицо);
	КонецЕсли;
	
	Если ДлинаИНН = 10  И НЕ ПроверяетсяИННФизЛица Тогда

		КонтрольнаяСумма = 0;

		Для Н = 1 По 9 Цикл

			Если 	  Н = 1 Тогда
				Множитель = 2;
			ИначеЕсли Н = 2 Тогда
				Множитель = 4;
			ИначеЕсли Н = 3 Тогда
				Множитель = 10;
			ИначеЕсли Н = 4 Тогда
				Множитель = 3;
			ИначеЕсли Н = 5 Тогда
				Множитель = 5;
			ИначеЕсли Н = 6 Тогда
				Множитель = 9;
			ИначеЕсли Н = 7 Тогда
				Множитель = 4;
			ИначеЕсли Н = 8 Тогда
				Множитель = 6;
			ИначеЕсли Н = 9 Тогда
				Множитель = 8;
			КонецЕсли; 
			
			Цифра = Число(Сред(ИНН,Н,1));
			КонтрольнаяСумма = КонтрольнаяСумма + Цифра * Множитель;
			
		КонецЦикла; 
		
		КонтрольныйРазряд = (КонтрольнаяСумма %11) %10;
		
		Если КонтрольныйРазряд <> Число(Сред(ИНН,10,1)) Тогда
			Возврат Ложь;
		КонецЕсли; 
		
	ИначеЕсли ДлинаИНН =12 И ПроверяетсяИННФизЛица Тогда
		
		КонтрольнаяСумма11 = 0;
		КонтрольнаяСумма12 = 0;
		
		Для Н=1 По 11 Цикл
			
			// Расчет множителя для 11-го и 12-го разрядов
			Если Н = 1 Тогда
				Множитель11 = 7;
				Множитель12 = 3;
			ИначеЕсли Н = 2 Тогда
				Множитель11 = 2;
				Множитель12 = 7;
			ИначеЕсли Н = 3 Тогда
				Множитель11 = 4;
				Множитель12 = 2;
			ИначеЕсли Н = 4 Тогда
				Множитель11 = 10;
				Множитель12 = 4;
			ИначеЕсли Н = 5 Тогда
				Множитель11 = 3;
				Множитель12 = 10;
			ИначеЕсли Н = 6 Тогда
				Множитель11 = 5;
				Множитель12 = 3;
			ИначеЕсли Н = 7 Тогда
				Множитель11 = 9;
				Множитель12 = 5;
			ИначеЕсли Н = 8 Тогда
				Множитель11 = 4;
				Множитель12 = 9;
			ИначеЕсли Н = 9 Тогда
				Множитель11 = 6;
				Множитель12 = 4;
			ИначеЕсли Н = 10 Тогда
				Множитель11 = 8;
				Множитель12 = 6;
			ИначеЕсли Н = 11 Тогда
				Множитель11 = 0;
				Множитель12 = 8;
			КонецЕсли; 
			
			Цифра = Число(Сред(ИНН,Н,1));
			КонтрольнаяСумма11 = КонтрольнаяСумма11 + Цифра * Множитель11;
			КонтрольнаяСумма12 = КонтрольнаяСумма12 + Цифра * Множитель12;
			
		КонецЦикла; 
		
		КонтрольныйРазряд11 = (КонтрольнаяСумма11 %11) %10;
		КонтрольныйРазряд12 = (КонтрольнаяСумма12 %11) %10;
		
		Если КонтрольныйРазряд11 <> Число(Сред(ИНН,11,1))
			ИЛИ КонтрольныйРазряд12 <> Число(Сред(ИНН,12,1)) Тогда
			Возврат Ложь;
		КонецЕсли; 
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

// Проверяет соответствие ИНН требованиям. 
// Используется в тех случаях, когда невозможно определить тип владельца ИНН.
// Во всех остальных случаях следует использовать функцию ИННсоответствуетТребованиям(Знач ИНН, ВладелецИНН)
// Параметры:
//		ИНН - строка - проверяемый индивидуальный номер налогоплательщика
Функция ИННСоответствуетТребованиямБезТипа(Знач ИНН) Экспорт
	
	ИННСтр = СокрЛП(ИНН);
	ДлинаИНН =  СтрДлина(ИННСтр);
	
	Если ДлинаИНН = 10 Тогда
		ВладелецИННФизЛицо = Ложь;
	ИначеЕсли ДлинаИНН = 12 Тогда
		ВладелецИННФизЛицо = Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ИННСоответствуетТребованиям(ИНН, ВладелецИННФизЛицо);
	
КонецФункции

// Проверяет соответствие КПП требованиям
// Параметры:
// КПП - строка - проверяемый код причины постановки на учет
Функция КППСоответствуетТребованиям(Знач КПП) Экспорт
	
	Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(КПП) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрДлина(СтрЗаменить(Строка(КПП), "0", "1")) <> 9 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Проверяет соответствие ОГРН требованиям
// Параметры:
// ОГРН - строка - проверяемый основной государственный регистрационный номер
Функция ОГРНсоответствуетТребованиям(Знач ОГРН) Экспорт
	Попытка
		ОГРНБезВедущихНулей = Формат(ОГРН,"ЧГ=0");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	ОГРН = Строка(ОГРНБезВедущихНулей);
	Если СтрДлина(ОГРН) <> 13 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;//проверка временно отключена
	КонецЕсли;
	ОГРН12 = Число(Лев(ОГРН, 12));
	Если Прав(Формат(ОГРН12%11, "ЧН=0; ЧГ=0"), 1) = Прав(ОГРН, 1) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
	
//Проверяет на наличие только русских букв (допускаются пробелы и дефис и некоторые спец символы)
Функция СтрокаНаписанаПоРусски(Знач СтрокаПараметр) Экспорт

	СтрокаПараметр = СокрЛП(СтрокаПараметр);	

	СписокДопустимыхЗначений = Новый Массив;
	СписокДопустимыхЗначений.Добавить(184); 
	СписокДопустимыхЗначений.Добавить(168);
	СписокДопустимыхЗначений.Добавить(45);
	СписокДопустимыхЗначений.Добавить(46);
	СписокДопустимыхЗначений.Добавить(32);
	СписокДопустимыхЗначений.Добавить(48);
	СписокДопустимыхЗначений.Добавить(49);
	СписокДопустимыхЗначений.Добавить(50);
	СписокДопустимыхЗначений.Добавить(51);
	СписокДопустимыхЗначений.Добавить(52);
	СписокДопустимыхЗначений.Добавить(53);
	СписокДопустимыхЗначений.Добавить(54);
	СписокДопустимыхЗначений.Добавить(55);
	СписокДопустимыхЗначений.Добавить(56);
	СписокДопустимыхЗначений.Добавить(57);

	Для Сч = 1 По СтрДлина(СтрокаПараметр) Цикл
		Код = КодСимвола(СтрокаПараметр, Сч);
		Если (Код < 192) И (СписокДопустимыхЗначений.Найти(Код) = Неопределено) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;
	
КонецФункции 

//Собирает из элементов структуры адреса строку записи адреса в формате 9 запятых
Функция СобратьАдрес(Знач СтруктураАдрес) Экспорт

	Возврат ""+ СтруктураАдрес.Страна + "," + СтруктураАдрес.Индекс + ","+ СтруктураАдрес.Регион + ","
	+ СтруктураАдрес.Район  + "," + СтруктураАдрес.Город  + ","+ СтруктураАдрес.НаселенныйПункт + ","
	+ СтруктураАдрес.Улица  + "," + СтруктураАдрес.Дом    + ","+ СтруктураАдрес.Корпус + "," + СтруктураАдрес.Квартира

КонецФункции	 

//Возвращает строковое представление места рождения
Функция ПредставлениеМестаРождения(Знач СтрокаМестоРождения) Экспорт

	СтруктураМестоРождения = РазложитьМестоРождения(СтрокаМестоРождения, Ложь);

    Если СтруктураМестоРождения.Особое = 1 Тогда
	
		Представление	=	"особое" +
		?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.НаселенныйПункт),		"",	"  "	+	СокрЛП(СтруктураМестоРождения.НаселенныйПункт))
		+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Район),	"",	"  "	+	СокрЛП(СтруктураМестоРождения.Район))
		+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Область),	"",	"  "	+	СокрЛП(СтруктураМестоРождения.Область))
		+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Страна),	"",	"  "	+	СокрЛП(СтруктураМестоРождения.Страна));
	
	Иначе
	
		Представление	= "," + ?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.НаселенныйПункт),		",",	СокрЛП(СтруктураМестоРождения.НаселенныйПункт))
		+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Район),	",",	", " + СокрЛП(СтруктураМестоРождения.Район))
		+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Область),	",",	", "	+	СокрЛП(СтруктураМестоРождения.Область))
		+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Страна),	",",	", "	+	СокрЛП(СтруктураМестоРождения.Страна));
		
		//Если Лев(Представление, 1) = ","  Тогда
		//	Представление = Сред(Представление, 2)
		//КонецЕсли;
			
	КонецЕсли; 

	Возврат Представление;
КонецФункции	 

//Функция раскладывает строку с данными об адресе (в формате 9 запятых) на элементы структуры
Функция РазложитьАдрес(Знач СтрокаАдрес) Экспорт
	
	Страна = "";
	Индекс = "";
	Регион = "";
	Район = "";
	Город = "";
	НаселенныйПункт = "";
	Улица ="";
	Дом ="";
	Корпус ="";
	Квартира ="";
	
	ТипДома ="";
	ТипКорпуса ="";
	ТипКвартиры ="";


	МассивАдрес	=	ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрокаАдрес);
	ЭлементовВМассиве = МассивАдрес.Количество();   
	Если ЭлементовВМассиве	>	0	тогда   // Заглушка добавился код страны
		Если СокрЛП(МассивАдрес[0])="643" Тогда
			МассивАдрес.Удалить(0);
			ЭлементовВМассиве = МассивАдрес.Количество();   
		КонецЕсли;	
    КонецЕсли;
		
	Если ЭлементовВМассиве	>	0	тогда
		Страна	=	СокрЛП(МассивАдрес[0]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	1	тогда
		Индекс	=	СокрЛП(МассивАдрес[1]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	2	тогда
		Регион	=	СокрЛП(МассивАдрес[2]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	3	тогда
		Район	=	СокрЛП(МассивАдрес[3]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	4	тогда
		Город	=	СокрЛП(МассивАдрес[4]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	5	тогда
		НаселенныйПункт	=	СокрЛП(МассивАдрес[5]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	6	тогда
		Улица	=	СокрЛП(МассивАдрес[6]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	7	тогда
		Дом	=	СокрЛП(МассивАдрес[7]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	8	тогда
		Корпус	=	СокрЛП(МассивАдрес[8]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	9	тогда
		Квартира	=	СокрЛП(МассивАдрес[9]);
	КонецЕсли;
	
	//Расширенное представление
	Если ЭлементовВМассиве	>	10	тогда
		ТипДома	    = СокрЛП(МассивАдрес[10]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	11	тогда
		ТипКорпуса	= СокрЛП(МассивАдрес[11]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	12	тогда
		ТипКвартиры = СокрЛП(МассивАдрес[12]);
	КонецЕсли;


	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Страна",Страна);
	СтруктураВозврата.Вставить("Индекс",Индекс);
	СтруктураВозврата.Вставить("Регион",Регион);
	СтруктураВозврата.Вставить("Район",Район);
	СтруктураВозврата.Вставить("Город",Город);
	СтруктураВозврата.Вставить("НаселенныйПункт",НаселенныйПункт);
	СтруктураВозврата.Вставить("Улица",Улица);
	СтруктураВозврата.Вставить("Дом",Дом);
	СтруктураВозврата.Вставить("Корпус",Корпус);
	СтруктураВозврата.Вставить("Квартира",Квартира);
	СтруктураВозврата.Вставить("ТипДома",ТипДома);
	СтруктураВозврата.Вставить("ТипКорпуса",ТипКорпуса);
	СтруктураВозврата.Вставить("ТипКвартиры",ТипКвартиры);

	Возврат СтруктураВозврата;
	
КонецФункции	 

//Функция раскладывает строку с данными о месте рождения на элементы структуры
Функция РазложитьМестоРождения(Знач СтрокаМестоРождения, ВерхнийРегистр = Истина) Экспорт

	Особое=0; НаселенныйПункт=""; Район=""; Область=""; Страна="";
	МассивМестоРождения	=	ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(?(ВерхнийРегистр, Врег(СтрокаМестоРождения), СтрокаМестоРождения));
	
	ЭлементовВМассиве = МассивМестоРождения.Количество();   
	Если ЭлементовВМассиве	>	0	тогда
		Если СокрЛП(МассивМестоРождения[0]) = "1" тогда
			Особое	=	1;
		КонецЕсли;	 
	КонецЕсли;
	Если ЭлементовВМассиве	>	1	тогда
		НаселенныйПункт	=	СокрЛП(МассивМестоРождения[1]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	2	тогда
		Район	=	СокрЛП(МассивМестоРождения[2]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	3	тогда
		Область	=	СокрЛП(МассивМестоРождения[3]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	4	тогда
		Страна	=	СокрЛП(МассивМестоРождения[4]);
	КонецЕсли;

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Особое",Особое);
	СтруктураВозврата.Вставить("НаселенныйПункт",НаселенныйПункт);
	СтруктураВозврата.Вставить("Район",Район);
	СтруктураВозврата.Вставить("Область",Область);
	СтруктураВозврата.Вставить("Страна",Страна);
	Возврат СтруктураВозврата;
	
КонецФункции	 

// Определяет, является ли переданная в качестве параметра организация ПБОЮЛ
Функция ЭтоПБОЮЛ(Организация) Экспорт
	Если Организация.ИностраннаяОрганизация Тогда Возврат Ложь; КонецЕсли;
	Возврат (Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо);
КонецФункции

// Извлекает сведения об организации по списку, переданному в параметре.
// 
// Параметры:
//  Показатели     - Список значений. Содержит в виде представлений перечень 
//                   сведений, которые надо получить. 
//                   
Функция ПолучитьСведенияОбОрганизации(Знач Организация, Знач ДатаЗначения = Неопределено, Знач СписокПоказателей = Неопределено) Экспорт
	
	Перем ОргСведения;
	Перем Значение;

	// Структура, в которой будут возвращаться найденные значения
	ОргСведения = Новый Структура;
	//Ставки = Новый Структура("Организация", Организация);
	
	Если Организация = Неопределено ИЛИ Организация = ОбщегоНазначения.ПустоеЗначениеТипа("СправочникСсылка.Организации") Тогда
		Возврат ОргСведения;
	КонецЕсли;
	
	Если ДатаЗначения = Неопределено Тогда
		ДатаЗначения = ТекущаяДата();
	КонецЕсли;
	ДатаЗначения = КонецДня(ДатаЗначения);
	
	ПустаяДата = '00010101000000';
	ПустойАдрес = ",,,,,,,,,";
	
	Организация = Организация.ПолучитьОбъект();
	Организация.Прочитать();
	
	Кэш = Новый Структура;
	Кэш.Вставить("Организация", Организация);
	Кэш.Вставить("ДатаЗначения", ДатаЗначения);
	
	ИдКонф = ИДКонфигурации();
	ПБОЮЛ = ЭтоПБОЮЛ(Организация);
	Кэш.Вставить("ПБОЮЛ", ПБОЮЛ);
	
	ДомашнийТелефонФизЛица = ?(СвойствоОпределено(Справочники.ВидыКонтактнойИнформации, "ТелефонФизЛицаДомашний"), Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаДомашний, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);
	
	Если СписокПоказателей = Неопределено Тогда
		
		СписокПоказателей = Новый Массив;
		СписокПоказателей.Добавить("СтавкаПрибФед");
		СписокПоказателей.Добавить("СтавкаПрибРесп");
		СписокПоказателей.Добавить("СтавкаПрибМест");
		СписокПоказателей.Добавить("ТипНП");
		СписокПоказателей.Добавить("КатНП");
		СписокПоказателей.Добавить("НаимНО");
		СписокПоказателей.Добавить("КодНО");
		СписокПоказателей.Добавить("ОснВидДеят");
		СписокПоказателей.Добавить("ОКВЭД");
		СписокПоказателей.Добавить("ОГРН");
		СписокПоказателей.Добавить("ОКАТО");
		СписокПоказателей.Добавить("ОКТМО");
		СписокПоказателей.Добавить("РегНомПФР");
		СписокПоказателей.Добавить("ОКПО");
		СписокПоказателей.Добавить("ОргПравФорм");
		СписокПоказателей.Добавить("ОКОПФ");
		СписокПоказателей.Добавить("ФормСобств");
		СписокПоказателей.Добавить("ОКФС");
		СписокПоказателей.Добавить("ДатаРегистрации");
		СписокПоказателей.Добавить("АдрПочт");
		СписокПоказателей.Добавить("СвидСН");
		СписокПоказателей.Добавить("СвидДВ");
		СписокПоказателей.Добавить("СвидНО");
		СписокПоказателей.Добавить("СвидНОКод");
		СписокПоказателей.Добавить("НаимЮЛПол");
		СписокПоказателей.Добавить("ИННЮЛ");
		СписокПоказателей.Добавить("КППЮЛ");
		СписокПоказателей.Добавить("АдрЮР");
		СписокПоказателей.Добавить("ОргИндекс");
		СписокПоказателей.Добавить("ОргСубъект");
		СписокПоказателей.Добавить("ОргКодСубъект");
		СписокПоказателей.Добавить("ОргРайон");
		СписокПоказателей.Добавить("ОргГород");
		СписокПоказателей.Добавить("ОргНПункт");
		СписокПоказателей.Добавить("ОргУлица");
		СписокПоказателей.Добавить("ОргДом");
		СписокПоказателей.Добавить("ОргКорпус");
		СписокПоказателей.Добавить("ОргКвартира");
		СписокПоказателей.Добавить("НаимОППол");
		СписокПоказателей.Добавить("КППОП");
		СписокПоказателей.Добавить("АдрОП");
		СписокПоказателей.Добавить("ИндексОП");
		СписокПоказателей.Добавить("СубъектОП");
		СписокПоказателей.Добавить("КодСубъектОП");
		СписокПоказателей.Добавить("РайонОП");
		СписокПоказателей.Добавить("ГородОП");
		СписокПоказателей.Добавить("НПунктОП");
		СписокПоказателей.Добавить("УлицаОП");
		СписокПоказателей.Добавить("ДомОП");
		СписокПоказателей.Добавить("КорпусОП");
		СписокПоказателей.Добавить("КвартираОП");
		СписокПоказателей.Добавить("КодТелАдрОП");
		СписокПоказателей.Добавить("ТелАдрОП");
		СписокПоказателей.Добавить("ФаксАдрОП");
		СписокПоказателей.Добавить("НаимОИОПол");
		СписокПоказателей.Добавить("ИННИО");
		СписокПоказателей.Добавить("КППИО");
		СписокПоказателей.Добавить("АдрОтдИОРФ");
		СписокПоказателей.Добавить("ИндексОИО");
		СписокПоказателей.Добавить("СубъектОИО");
		СписокПоказателей.Добавить("КодСубъектОИО");
		СписокПоказателей.Добавить("РайонОИО");
		СписокПоказателей.Добавить("ГородОИО");
		СписокПоказателей.Добавить("НПунктОИО");
		СписокПоказателей.Добавить("УлицаОИО");
		СписокПоказателей.Добавить("ДомОИО");
		СписокПоказателей.Добавить("КорпусОИО");
		СписокПоказателей.Добавить("КвартираОИО");
		СписокПоказателей.Добавить("КодИОСтрРег");
		СписокПоказателей.Добавить("НаимИОПол");
		СписокПоказателей.Добавить("СтрИО");
		СписокПоказателей.Добавить("КодСтрИО");
		СписокПоказателей.Добавить("СтрПостИО");
		СписокПоказателей.Добавить("КодСтрПостИО");
		СписокПоказателей.Добавить("АдрИО");
		СписокПоказателей.Добавить("ФИО");
		СписокПоказателей.Добавить("ФИООтпрФЛ");
		СписокПоказателей.Добавить("ИННФЛ");
		СписокПоказателей.Добавить("ДатаРожд");
		СписокПоказателей.Добавить("МестоРожд");
		СписокПоказателей.Добавить("Пол");
		СписокПоказателей.Добавить("Гражд");
		СписокПоказателей.Добавить("ГраждСтрана");
		СписокПоказателей.Добавить("КодУдЛичн");
		СписокПоказателей.Добавить("ВидУдЛичн");
		СписокПоказателей.Добавить("ОрганВыданУдЛичн");
		СписокПоказателей.Добавить("СерияУдЛичн");
		СписокПоказателей.Добавить("НомерУдЛичн");
		СписокПоказателей.Добавить("ДатаУдЛичн");
		СписокПоказателей.Добавить("АдрПрописки");
		СписокПоказателей.Добавить("АдрМЖ");
		СписокПоказателей.Добавить("ИндексМЖ");
		СписокПоказателей.Добавить("СубъектМЖ");
		СписокПоказателей.Добавить("КодСубъектМЖ");
		СписокПоказателей.Добавить("РайонМЖ");
		СписокПоказателей.Добавить("ГородМЖ");
		СписокПоказателей.Добавить("НПунктМЖ");
		СписокПоказателей.Добавить("УлицаМЖ");
		СписокПоказателей.Добавить("ДомМЖ");
		СписокПоказателей.Добавить("КорпусМЖ");
		СписокПоказателей.Добавить("КвартираМЖ");
		СписокПоказателей.Добавить("ТелСлуж");
		СписокПоказателей.Добавить("ТелДом");
		СписокПоказателей.Добавить("ФИОРук");
		СписокПоказателей.Добавить("ИННРук");
		СписокПоказателей.Добавить("ДатаРождРук");
		СписокПоказателей.Добавить("МестоРождРук");
		СписокПоказателей.Добавить("ПолРук");
		СписокПоказателей.Добавить("ГраждРук");
		СписокПоказателей.Добавить("ГраждСтранаРук");
		СписокПоказателей.Добавить("ТелРук");
		СписокПоказателей.Добавить("КодУдЛичнРук");
		СписокПоказателей.Добавить("ВидУдЛичнРук");
		СписокПоказателей.Добавить("ОрганВыданУдЛичнРук");
		СписокПоказателей.Добавить("СерияУдЛичнРук");
		СписокПоказателей.Добавить("НомерУдЛичнРук");
		СписокПоказателей.Добавить("ДатаУдЛичнРук");
		СписокПоказателей.Добавить("АдрМЖРукРФ");
		СписокПоказателей.Добавить("ИндексМЖРук");
		СписокПоказателей.Добавить("СубъектМЖРук");
		СписокПоказателей.Добавить("КодСубъектМЖРук");
		СписокПоказателей.Добавить("РайонМЖРук");
		СписокПоказателей.Добавить("ГородМЖРук");
		СписокПоказателей.Добавить("НПунктМЖРук");
		СписокПоказателей.Добавить("УлицаМЖРук");
		СписокПоказателей.Добавить("ДомМЖРук");
		СписокПоказателей.Добавить("КорпусМЖРук");
		СписокПоказателей.Добавить("КвартираМЖРук");
		СписокПоказателей.Добавить("ФИОБух");
		СписокПоказателей.Добавить("ФИООтпр");
		СписокПоказателей.Добавить("ИННБух");
		СписокПоказателей.Добавить("ДатаРождРук");
		СписокПоказателей.Добавить("МестоРождБух");
		СписокПоказателей.Добавить("ПолБух");
		СписокПоказателей.Добавить("ПолУпПред");
		СписокПоказателей.Добавить("ГраждБух");
		СписокПоказателей.Добавить("ГраждУпПред");
		СписокПоказателей.Добавить("ГраждСтранаБух");
		СписокПоказателей.Добавить("ГраждСтранаУпПред");
		СписокПоказателей.Добавить("ТелБух");
		СписокПоказателей.Добавить("ТелОтпр");
		СписокПоказателей.Добавить("КодУдЛичнБух");
		СписокПоказателей.Добавить("ВидУдЛичнБух");
		СписокПоказателей.Добавить("ОрганВыданУдЛичнБух");
		СписокПоказателей.Добавить("СерияУдЛичнБух");
		СписокПоказателей.Добавить("НомерУдЛичнБух");
		СписокПоказателей.Добавить("ДатаУдЛичнБух");
		СписокПоказателей.Добавить("АдрМЖБухРФ");
		СписокПоказателей.Добавить("ИндексМЖБух");
		СписокПоказателей.Добавить("СубъектМЖБух");
		СписокПоказателей.Добавить("КодСубъектМЖБух");
		СписокПоказателей.Добавить("РайонМЖБух");
		СписокПоказателей.Добавить("ГородМЖБух");
		СписокПоказателей.Добавить("НПунктМЖБух");
		СписокПоказателей.Добавить("УлицаМЖБух");
		СписокПоказателей.Добавить("ДомМЖБух");
		СписокПоказателей.Добавить("КорпусМЖБух");
		СписокПоказателей.Добавить("КвартираМЖБух");
		СписокПоказателей.Добавить("ФИОУпПред");
		СписокПоказателей.Добавить("ИННУпПред");
		СписокПоказателей.Добавить("ТелУпПред");
		СписокПоказателей.Добавить("КодУдЛичнУпПред");
		СписокПоказателей.Добавить("ВидУдЛичнУпПред");
		СписокПоказателей.Добавить("ОрганВыданУдЛичнУпПред");
		СписокПоказателей.Добавить("СерияУдЛичнУпПред");
		СписокПоказателей.Добавить("НомерУдЛичнУпПред");
		СписокПоказателей.Добавить("ДатаУдЛичнУпПред");
		СписокПоказателей.Добавить("ДатаРождУпПред");
		СписокПоказателей.Добавить("АдрМЖУпПредРФ");
		СписокПоказателей.Добавить("МестоРождУпПред");
		СписокПоказателей.Добавить("ИндексМЖУпПред");
		СписокПоказателей.Добавить("СубъектМЖУпПред");
		СписокПоказателей.Добавить("КодСубъектМЖУпПред");
		СписокПоказателей.Добавить("РайонМЖУпПред");
		СписокПоказателей.Добавить("ГородМЖУпПред");
		СписокПоказателей.Добавить("НПунктМЖУпПред");
		СписокПоказателей.Добавить("УлицаМЖУпПред");
		СписокПоказателей.Добавить("ДомМЖУпПред");
		СписокПоказателей.Добавить("КорпусМЖУпПред");
		СписокПоказателей.Добавить("КвартираМЖУпПред");
		СписокПоказателей.Добавить("ФаксИсп");
		СписокПоказателей.Добавить("ДолжнОтпр");
		СписокПоказателей.Добавить("СтавкаРефинансирования");
		СписокПоказателей.Добавить("ДатаПереходаНаУСН");
		СписокПоказателей.Добавить("БанкСчетНомер");
		СписокПоказателей.Добавить("БанкСчетНаимБанка");
		СписокПоказателей.Добавить("БанкСчетКоррСчетБанка");
		СписокПоказателей.Добавить("БанкСчетБИКБанка");
		СписокПоказателей.Добавить("РегистрационныйНомерФСС");
		СписокПоказателей.Добавить("КодОКОНХ");
		СписокПоказателей.Добавить("СтраховойТариф");
		СписокПоказателей.Добавить("ТелОрганизации");
		СписокПоказателей.Добавить("ФаксОрганизации");
		СписокПоказателей.Добавить("ОбъектНалогообложенияУСН");
		СписокПоказателей.Добавить("НаимГоловнОрг");
		СписокПоказателей.Добавить("КППГоловнОрг");
		СписокПоказателей.Добавить("ФИОИсп");
		СписокПоказателей.Добавить("ДолжнИсп");
		СписокПоказателей.Добавить("ТелИсп");

	ИначеЕсли ТипЗнч(СписокПоказателей) = Тип("Строка") Тогда
		
		СписокПоказателейСтрока = Строка(СписокПоказателей);
		СписокПоказателей = Новый Массив;
		ВхождениеЗапятой = Найти(СписокПоказателейСтрока, ",");
		Пока ВхождениеЗапятой <> 0 Цикл
			ИмяПоказателя = СокрЛП(Лев(СписокПоказателейСтрока, ВхождениеЗапятой - 1));
			СписокПоказателейСтрока = Сред(СписокПоказателейСтрока, ВхождениеЗапятой + 1);
			Если ПустаяСтрока(ИмяПоказателя) Тогда
				Продолжить;
			КонецЕсли;
			СписокПоказателей.Добавить(ИмяПоказателя);
			ВхождениеЗапятой = Найти(СписокПоказателейСтрока, ",");
		КонецЦикла;
		ИмяПоказателя = СокрЛП(СписокПоказателейСтрока);
		Если НЕ ПустаяСтрока(ИмяПоказателя) Тогда
			СписокПоказателей.Добавить(ИмяПоказателя);
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтоМассив = (ТипЗнч(СписокПоказателей) = Тип("Массив"));
	
	Для Каждого Показатель Из СписокПоказателей Цикл

		ИмяПоказателя = ?(ЭтоМассив, Показатель, Показатель.Представление);
		
		Если ИмяПоказателя = "СтавкаПрибФед" Тогда
			
			Ставки = ПолучитьСУчетомКэша(Кэш, "СтавкаНалогаНаПрибыль");
			Если Ставки <> Неопределено И Ставки.Количество() > 0 Тогда
				Значение = Ставки[0].СтавкаФБ;
			Иначе
				Значение = 0;
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "СтавкаПрибРесп" Тогда
			Ставки = ПолучитьСУчетомКэша(Кэш, "СтавкаНалогаНаПрибыль");
			Если Ставки <> Неопределено И Ставки.Количество() > 0 Тогда
				Значение = Ставки[0].СтавкаСубъектРФ;
			Иначе
				Значение = 0;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СтавкаПрибМест" Тогда
			Ставки = ПолучитьСУчетомКэша(Кэш, "СтавкаНалогаНаПрибыль");
			Если Ставки <> Неопределено И Ставки.Количество() > 0 Тогда
				Значение = Ставки[0].СтавкаМестный;
			Иначе
				Значение = 0;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТипНП" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" Тогда
				Значение = ?(Организация.ГоловнаяОрганизация.Пустая(), 1, 2);
			ИначеЕсли Организация.ИностраннаяОрганизация Тогда
				Значение = 5;
			Иначе
				Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
					Если ПБОЮЛ Тогда
						Значение = 3;
					Иначе
						Значение = 1;
					КонецЕсли;
				Иначе
					Значение = 2;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КатНП" Тогда
			
			Значение = "01";
			
		ИначеЕсли Имяпоказателя = "НаимНО" Тогда
			
			Если ИдКонф = "ББУ" Тогда
				Значение = Организация.НаименованиеИФНС;
			Иначе
				Значение = Организация.НаименованиеИМНС;
			КонецЕсли;
			
		ИначеЕсли Имяпоказателя = "КодНО" Тогда
			
			Если ИдКонф = "ББУ" Тогда
				Значение = Организация.КодИФНС;
			Иначе
				Значение = Организация.КодИМНС;
			КонецЕсли;
			
		ИначеЕсли Имяпоказателя = "ОснВидДеят" Тогда
			
			Значение = Организация.НаименованиеОКВЭД;
			
		ИначеЕсли Имяпоказателя = "ОКВЭД" Тогда
			
			Значение = Организация.КодОКВЭД;
			
		ИначеЕсли ИмяПоказателя	= "ОГРН" Тогда
			
			Значение = Организация.ОГРН;
			
		ИначеЕсли ИмяПоказателя = "ОКАТО" Тогда
			
			Если ИДКонф = "ББУ" Тогда
				Значение = "";
			Иначе
				Значение = Строка(Организация.КодПоОКАТО);
			КонецЕсли;
					
		ИначеЕсли ИмяПоказателя = "ОКТМО" Тогда
			
			Если ИДКонф = "ББУ" Тогда
				Значение = "";
			Иначе
				Значение = Строка(Организация.КодПоОКТМО);
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "РегНомПФР" Тогда
			
			Если ИдКонф = "ББУ" Тогда
				Значение = "";
			Иначе
				Значение = Организация.РегистрационныйНомерПФР;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОКПО" Тогда
			
			Если ИдКонф = "ББУ" Тогда
				Значение = Организация.КодОКПО;
			Иначе
				Значение = Организация.КодПоОКПО;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргПравФорм" Тогда
			
			Если ИдКонф = "ББУ" Тогда
				Значение  = Организация.КодКОПФ.Наименование;
			Иначе
				Значение  = Организация.НаименованиеОКОПФ;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОКОПФ" Тогда
			
			Если ИдКонф = "ББУ" Тогда
				Значение = Организация.КодКОПФ.Код;
			Иначе
				Значение  = Организация.КодОКОПФ;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ФормСобств" Тогда
			
			Если ИдКонф = "ББУ" Тогда
				Значение = Организация.НаименованиеКФС;
			Иначе
				Значение = Организация.НаименованиеОКФС;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОКФС" Тогда
			
			Если ИдКонф = "ББУ" Тогда
				Значение = Организация.КодКФС;
			Иначе
				Значение = Организация.КодОКФС;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "РегистрационныйНомерФСС" Тогда
			
			Если ИдКонф = "ББУ" Тогда
				Значение = "";
			Иначе
				Значение = Организация.РегистрационныйНомерФСС;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодОКОНХ" Тогда
			
			Если ИдКонф = "ББУ" Тогда
				Значение = "";
			Иначе
				Значение = Организация.КодОКОНХ;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаРегистрации" Тогда
			
			Если Метаданные.Справочники.Организации.Реквизиты.Найти("ДатаРегистрации") <> Неопределено Тогда
				Значение = Организация.ДатаРегистрации;
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СтраховойТариф" Тогда
			
			Если ИДКонф = "ББУ" Тогда
				Значение = 0;
			Иначе
				Результат = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.СрезПоследних(ДатаЗначения, Новый Структура("Организация", Организация.Ссылка));
				Если Результат.Количество() > 0 Тогда
					Значение = Результат[0].Ставка;
				Иначе
					Значение = 0;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрПочт" ИЛИ ИмяПоказателя = "ПолныйАдрПочт" Тогда
			
			ИмяПредопределенного = ?(ИдКонф = "ББУ", Справочники.ВидыКонтактнойИнформации.ПочтАдресУчреждения, Справочники.ВидыКонтактнойИнформации.АдресОрганизацииПочтовый);
			Данные = Новый Структура("Объект, Тип, Вид",Организация.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, ИмяПредопределенного);

			Результат = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);

			Если Результат <> Неопределено Тогда
				Значение = АдресВФормате9Запятых(Результат);
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СвидСН" Тогда
			
			Если Метаданные.Справочники.Организации.Реквизиты.Найти("СвидетельствоСерияНомер") <> Неопределено Тогда
				Значение = Организация.СвидетельствоСерияНомер;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СвидДВ" Тогда
			
			Если Метаданные.Справочники.Организации.Реквизиты.Найти("СвидетельствоДатаВыдачи") <> Неопределено Тогда
				Значение = Организация.СвидетельствоДатаВыдачи;
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СвидНО" Тогда
			
			Если Метаданные.Справочники.Организации.Реквизиты.Найти("СвидетельствоНаименованиеОргана") <> Неопределено Тогда
				Значение = Организация.СвидетельствоНаименованиеОргана;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СвидНОКод" Тогда
			
			Если Метаданные.Справочники.Организации.Реквизиты.Найти("СвидетельствоКодОргана") <> Неопределено Тогда
				Значение = Организация.СвидетельствоКодОргана;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НаимЮЛПол" Тогда
			
			Значение = Организация.НаименованиеПолное;
			
		ИначеЕсли ИмяПоказателя = "ИННЮЛ" Тогда
			
			Значение = СокрЛП(Организация.ИНН);
			
		ИначеЕсли ИмяПоказателя = "КППЮЛ" Тогда
			
			Значение = Организация.КПП;
			
		ИначеЕсли ИмяПоказателя = "АдрЮР" ИЛИ ИмяПоказателя = "ПолныйАдрЮР" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = АдресВФормате9Запятых(Результат);
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТелОрганизации" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ТелефонОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Представление;
				//Значение = Результат.Поле3 + ?(ПустаяСтрока(Результат.Поле4), "", " (" + Результат.Поле4 + ")");
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ФаксОрганизации" Тогда
			
			Если Кэш.ПБОЮЛ Тогда
				Значение = "";
			Иначе
				ИмяПредопределенного = ?(ИдКонф = "ББУ", Справочники.ВидыКонтактнойИнформации.ФаксУчреждения, Справочники.ВидыКонтактнойИнформации.ФаксОрганизации);
				Данные = Новый Структура("Объект, Тип, Вид", Кэш.Организация.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, ИмяПредопределенного);
				Результат = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
				Если Результат <> Неопределено Тогда
					Значение = Результат.Представление;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргИндекс" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Поле1;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргСубъект" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Поле2;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргКодСубъект" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Формат(КодРегионаПоНазванию(Результат.Поле2), "ЧЦ=2; ЧВН=");//КодРегионаПоНазванию(Результат.Поле2);
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргРайон" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Поле3;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргГород" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Поле4;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргНПункт" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Поле5;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргУлица" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Поле6;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргДом" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Поле7;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргКорпус" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Поле8;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргКвартира" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Поле9;
			Иначе
				Значение = "";
			КонецЕсли;
			
		//*************************************************************для обособленного подразделения
		ИначеЕсли ИмяПоказателя = "НаимОППол" Тогда
		
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Значение = Организация.НаименованиеПолное;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КППОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Значение = Организация.КПП;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = ПустойАдрес;
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = АдресВФормате9Запятых(Результат);
				Иначе
					Значение = ПустойАдрес;
				КонецЕсли;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИндексОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле1;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СубъектОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле2;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодСубъектОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Формат(КодРегионаПоНазванию(Результат.Поле2), "ЧЦ=2; ЧВН=");//КодРегионаПоНазванию(Результат.Поле2);
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "РайонОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле3;
				Иначе
					Значение = "";
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ГородОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе

				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле4;
				Иначе
					Значение = "";
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НПунктОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле5;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "УлицаОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле6;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДомОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле7;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КорпусОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле8;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КвартираОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле9;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодТелАдрОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ТелефонОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле2;
				Иначе
					Значение = "";
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТелАдрОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ТелефонОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле3 + ?(ПустаяСтрока(Результат.Поле4), "", " (" + Результат.Поле4 + ")");
				Иначе
					Значение = "";
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ФаксАдрОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Данные = Новый Структура("Объект, Тип, Вид",Организация.Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.ВидыКонтактнойИнформации.ФаксОрганизации);

				Результат = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле3 + ?(ПустаяСтрока(Результат.Поле4), "", " (" + Результат.Поле4 + ")");
				Иначе
					Значение = "";
				КонецЕсли;
				
			КонецЕсли;
			
		//********************************************************сведения об иностранной организации
		ИначеЕсли ИмяПоказателя = "НаимОИОПол" Тогда
		
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе
				Значение = Организация.НаименованиеПолное;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИННИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе
				Значение = СокрЛП(Организация.ИНН);
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КППИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе
				Значение = Организация.КПП;				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрОтдИОРФ" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = ПустойАдрес;
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = АдресВФормате9Запятых(Результат);
				Иначе
					Значение = ПустойАдрес;
				КонецЕсли;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИндексОИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле1;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СубъектОИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле2;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодСубъектОИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Формат(КодРегионаПоНазванию(Результат.Поле2), "ЧЦ=2; ЧВН=");//КодРегионаПоНазванию(Результат.Поле2);
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "РайонОИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле3;
				Иначе
					Значение = "";
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ГородОИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе

				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле4;
				Иначе
					Значение = "";
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НПунктОИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле5;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "УлицаОИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле6;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДомОИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле7;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КорпусОИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле8;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КвартираОИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Поле9;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодИОСтрРег" Тогда
			
			Если ИДКонф <> "ББУ" И ИДКонф <> "ЗБУ" И Организация.ИностраннаяОрганизация Тогда
				Значение = Организация.КодВСтранеРегистрации;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НаимИОПол" Тогда
			
			Если ИДКонф <> "ББУ" И ИДКонф <> "ЗБУ" И Организация.ИностраннаяОрганизация Тогда
				Значение = Организация.НаименованиеИнострОрганизации;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СтрИО" Тогда
			
			Если ИДКонф <> "ББУ" И ИДКонф <> "ЗБУ" И Организация.ИностраннаяОрганизация Тогда
				Значение = Организация.СтранаРегистрации.НаименованиеПолное;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодСтрИО" Тогда
			
			Если ИДКонф <> "ББУ" И ИДКонф <> "ЗБУ" И Организация.ИностраннаяОрганизация Тогда
				Значение = Организация.СтранаРегистрации.КодАльфа2;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СтрПостИО" Тогда
			
			Если ИДКонф <> "ББУ" И ИДКонф <> "ЗБУ" И Организация.ИностраннаяОрганизация Тогда
				Значение = Организация.СтранаПостоянногоМестонахождения.НаименованиеПолное;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодСтрПостИО" Тогда
			
			Если ИДКонф <> "ББУ" И ИДКонф <> "ЗБУ" И Организация.ИностраннаяОрганизация Тогда
				Значение = Организация.СтранаПостоянногоМестонахождения.КодАльфа2;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрИО" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" ИЛИ НЕ Организация.ИностраннаяОрганизация Тогда
				Значение = ПустойАдрес;
			Иначе
				
				Данные = Новый Структура("Объект, Тип, Вид", Организация.Ссылка, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресИнострОрганизацииУчред);

				Результат = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);

				Если Результат <> Неопределено Тогда
					Значение = Результат.Представление;
				Иначе
					Значение = ПустойАдрес;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		//***************************************************сведения об индивидуальном предпринимателе			
		ИначеЕсли ИмяПоказателя = "ФИО" ИЛИ ИмяПоказателя = "ФИООтпрФЛ" Тогда
			
			Если ПБОЮЛ Тогда
				Если Метаданные.Справочники.Организации.Реквизиты.Найти("ИндивидуальныйПредприниматель") <> Неопределено Тогда
					ФЛ = Организация.ИндивидуальныйПредприниматель;
					Если ФЛ = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = Организация.НаименованиеПолное;
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ИДКонфигурации() = "УПП" Тогда
					Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");
					Если Результат <> Неопределено И Результат.Количество() > 0 И Результат[0].ФизическоеЛицо <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						ДанныеФЛ = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизЛицо", Результат[0].ФизическоеЛицо));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество));
						Иначе
							Значение = "";
						КонецЕсли;
					Иначе
						Значение = "";
					КонецЕсли;
				Иначе
					Значение = Организация.НаименованиеПолное; 
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИННФЛ" Тогда
			
			Если ПБОЮЛ Тогда
				Значение = СокрЛП(Организация.ИНН); 
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаРожд" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = ПустаяДата;
					Иначе
						Значение = Результат[0].ФизическоеЛицо.ДатаРождения;
					КонецЕсли;
				Иначе
					Значение = ПустаяДата;
				КонецЕсли;
				
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "МестоРожд" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						Значение = Результат[0].ФизическоеЛицо.МестоРождения;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "Пол" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = 0;
					Иначе
						Если Результат[0].ФизическоеЛицо.Пол = Перечисления.Пол.Женский Тогда
							Значение = 2;
						ИначеЕсли Результат[0].ФизическоеЛицо.Пол = Перечисления.Пол.Мужской Тогда
							Значение = 1;
						Иначе
							Значение = 0;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = 0;
				КонецЕсли;
				
			Иначе
				Значение = 0;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "Гражд" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеГражданство", Результат[0].ФизическоеЛицо);
						//Гражданство = ПолучитьГражданство(Результат[0].ФизическоеЛицо, ДатаЗначения);
						Если Гражданство = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = Гражданство.Код;
						КонецЕсли;

					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ГраждСтрана" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеГражданство", Результат[0].ФизическоеЛицо);
						//Гражданство = ПолучитьГражданство(Результат[0].ФизическоеЛицо, ДатаЗначения);
						Если Гражданство = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = ?(ПустаяСтрока(Гражданство.НаименованиеПолное), Гражданство.Наименование, Гражданство.НаименованиеПолное);
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = Неопределено;
						Иначе
							Если УдЛичн.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
								Значение = "";
							Иначе
								Значение = УдЛичн.ДокументВид.КодИМНС;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ВидУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Если УдЛичн.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
								Значение = "";
							Иначе
								Значение = УдЛичн.ДокументВид.Наименование;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОрганВыданУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументКемВыдан;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СерияУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументСерия;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НомерУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументНомер;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = ПустаяДата;
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = ПустаяДата;
						Иначе
							Значение = УдЛичн.ДокументДатаВыдачи;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = ПустаяДата;
				КонецЕсли;
				
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрПрописки" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = ПустойАдрес;
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдресПрописки", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							Значение = АдресВФормате9Запятых(Результат2);
						Иначе
							Значение = ПустойАдрес;
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = ПустойАдрес;
				КонецЕсли;
				
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = ПустойАдрес;
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							Значение = АдресВФормате9Запятых(Результат2);
						Иначе
							Значение = ПустойАдрес;
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = ПустойАдрес;
				КонецЕсли;
				
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИндексМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле1;
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СубъектМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле2;
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КодСубъектМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							Значение = Формат(КодРегионаПоНазванию(Результат2.Поле2), "ЧЦ=2; ЧВН=");//КодРегионаПоНазванию(Результат2.Поле2);
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "РайонМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле3;
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ГородМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле4;
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "НПунктМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле5;
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "УлицаМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле6;
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ДомМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле7;
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КорпусМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле8;
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КвартираМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле9;
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТелСлуж" Тогда
			
			Если ПБОЮЛ Тогда
			
				Результат = ПолучитьСУчетомКэша(Кэш, "ТелефонОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Представление;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТелДом" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						
						Значение = "";
						
					Иначе
						
						Данные = Новый Структура("Объект, Тип, Вид",Результат[0].ФизическоеЛицо, Перечисления.ТипыКонтактнойИнформации.Телефон, ДомашнийТелефонФизЛица);

						Результат2 = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);

						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Представление;
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					Значение = "";
					
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
			
		//******************************************************************сведения о руководителе организации
		ИначеЕсли ИмяПоказателя = "ФИОРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ФЛ = Результат[0][?(ИдКонф = "ББУ", "ОтветственноеЛицо", "ФизическоеЛицо")];
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					ИначеЕсли ИдКонф = "ББУ" Тогда
						Значение = СокрЛП(СокрЛП(ФЛ.Контрагент.Фамилия) + " " + СокрЛП(ФЛ.Контрагент.Имя) + " " + СокрЛП(ФЛ.Контрагент.Отчество));
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИННРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Значение = ФЛ.ИНН;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаРождРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = ПустаяДата;
					Иначе
						Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
						                      |	ХарактеристикиКонтрагентов.ЗначениеХарактеристики КАК ДатаРождения
						                      |ИЗ
						                      |	РегистрСведений.ХарактеристикиКонтрагентов КАК ХарактеристикиКонтрагентов
						                      |ГДЕ
						                      |	ХарактеристикиКонтрагентов.Контрагент = &Контрагент
						                      |	И ХарактеристикиКонтрагентов.ВидХарактеристики = &ВидХарактеристики");
						Запрос.УстановитьПараметр("Контрагент", ФЛ);
						Запрос.УстановитьПараметр("ВидХарактеристики", ПланыВидовХарактеристик.ВидыХарактеристикКонтрагентов.ДатаРождения);
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() И ТипЗнч(Выборка.ДатаРождения) = Тип("Дата") Тогда
							Значение = Выборка.ДатаРождения;
						Иначе
							Значение = ПустаяДата;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = ПустаяДата;
					Иначе
						Значение = ФЛ.ДатаРождения;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "МестоРождРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
						                      |	ХарактеристикиКонтрагентов.ЗначениеХарактеристики КАК МестоРождения
						                      |ИЗ
						                      |	РегистрСведений.ХарактеристикиКонтрагентов КАК ХарактеристикиКонтрагентов
						                      |ГДЕ
						                      |	ХарактеристикиКонтрагентов.Контрагент = &Контрагент
						                      |	И ХарактеристикиКонтрагентов.ВидХарактеристики = &ВидХарактеристики");
						Запрос.УстановитьПараметр("Контрагент", ФЛ);
						Запрос.УстановитьПараметр("ВидХарактеристики", ПланыВидовХарактеристик.ВидыХарактеристикКонтрагентов.МестоРождения);
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() И ТипЗнч(Выборка.ДатаРождения) = Тип("Строка") Тогда
							Значение = Выборка.МестоРождения;
						Иначе
							Значение = ПустаяДата;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Значение = ФЛ.МестоРождения;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ПолРук" Тогда
			
			Если ИДКонф = "ББУ" Тогда
				Значение = 0;
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = 0;
					Иначе
						Если Результат[0].ФизическоеЛицо.Пол = Перечисления.Пол.Женский Тогда
							Значение = 2;
						ИначеЕсли Результат[0].ФизическоеЛицо.Пол = Перечисления.Пол.Мужской Тогда
							Значение = 1;
						Иначе
							Значение = 0;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = 0;
				КонецЕсли;
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ГраждРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеГражданство", ФЛ);
						Если Гражданство = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = Гражданство.Код;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеГражданство", ФЛ);
						Если Гражданство = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = Гражданство.Код;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ГраждСтранаРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеГражданство", ФЛ);
						Если Гражданство = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = ?(ПустаяСтрока(Гражданство.НаименованиеПолное), Гражданство.Наименование, Гражданство.НаименованиеПолное);
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеГражданство", ФЛ);
						Если Гражданство = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = ?(ПустаяСтрока(Гражданство.НаименованиеПолное), Гражданство.Наименование, Гражданство.НаименованиеПолное);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТелРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Данные = Новый Структура("Объект, Тип, Вид", ФЛ, Перечисления.ТипыКонтактнойИнформации.Телефон, ДомашнийТелефонФизЛица);
						Результат2 = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Представление;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Данные = Новый Структура("Объект, Тип, Вид", ФЛ, Перечисления.ТипыКонтактнойИнформации.Телефон, ДомашнийТелефонФизЛица);
						Результат2 = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Представление;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", Результат[0].ОтветственноеЛицо.Контрагент);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Если УдЛичн.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
								Значение = "";
							Иначе
								Значение = УдЛичн.ДокументВид.Код;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Если УдЛичн.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
								Значение = "";
							Иначе
								Значение = УдЛичн.ДокументВид.КодИМНС;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ВидУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", Результат[0].ОтветственноеЛицо.Контрагент);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Если УдЛичн.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
								Значение = "";
							Иначе
								Значение = УдЛичн.ДокументВид.Наименование;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Если УдЛичн.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
								Значение = "";								
							Иначе
								Значение = УдЛичн.ДокументВид.Наименование;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОрганВыданУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументКемВыдан;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументКемВыдан;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СерияУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументСерия;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументСерия;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НомерУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументНомер;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументНомер;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументДатаВыдачи;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументДатаВыдачи;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрМЖРукРФ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = ПустойАдрес;
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = АдресВФормате9Запятых(Результат2);
						Иначе
							Значение = ПустойАдрес;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = ПустойАдрес;
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = АдресВФормате9Запятых(Результат2);
						Иначе
							Значение = ПустойАдрес;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИндексМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле1;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле1;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СубъектМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле2;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле2;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КодСубъектМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Формат(КодРегионаПоНазванию(Результат2.Поле2), "ЧЦ=2; ЧВН=");
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Формат(КодРегионаПоНазванию(Результат2.Поле2), "ЧЦ=2; ЧВН=");
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "РайонМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле3;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле3;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ГородМЖРук" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле4;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле4;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "НПунктМЖРук" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле5;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле5;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "УлицаМЖРук" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле6;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле6;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ДомМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле7;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле7;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КорпусМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле8;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле8;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КвартираМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле9;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле9;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
			
		//*******************************************************************Сведения о главном бухгалтере
		ИначеЕсли ИмяПоказателя = "ФИОБух" ИЛИ ИмяПоказателя = "ФИООтпр" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ФЛ = Результат[0][?(ИдКонф = "ББУ", "ОтветственноеЛицо", "ФизическоеЛицо")];
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					ИначеЕсли ИдКонф = "ББУ" Тогда
						Значение = СокрЛП(СокрЛП(ФЛ.Контрагент.Фамилия) + " " + СокрЛП(ФЛ.Контрагент.Имя) + " " + СокрЛП(ФЛ.Контрагент.Отчество));
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИННБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Значение = ФЛ.ИНН;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаРождБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = ПустаяДата;
					Иначе
						Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
						                      |	ХарактеристикиКонтрагентов.ЗначениеХарактеристики КАК ДатаРождения
						                      |ИЗ
						                      |	РегистрСведений.ХарактеристикиКонтрагентов КАК ХарактеристикиКонтрагентов
						                      |ГДЕ
						                      |	ХарактеристикиКонтрагентов.Контрагент = &Контрагент
						                      |	И ХарактеристикиКонтрагентов.ВидХарактеристики = &ВидХарактеристики");
						Запрос.УстановитьПараметр("Контрагент", ФЛ);
						Запрос.УстановитьПараметр("ВидХарактеристики", ПланыВидовХарактеристик.ВидыХарактеристикКонтрагентов.ДатаРождения);
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() И ТипЗнч(Выборка.ДатаРождения) = Тип("Дата") Тогда
							Значение = Выборка.ДатаРождения;
						Иначе
							Значение = ПустаяДата;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = ПустаяДата;
					Иначе
						Значение = ФЛ.ДатаРождения;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаРождУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = ПустаяДата;
				Иначе
					Значение = Результат[0].ФизическоеЛицо.ДатаРождения;
				КонецЕсли;
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "МестоРождБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
						                      |	ХарактеристикиКонтрагентов.ЗначениеХарактеристики КАК МестоРождения
						                      |ИЗ
						                      |	РегистрСведений.ХарактеристикиКонтрагентов КАК ХарактеристикиКонтрагентов
						                      |ГДЕ
						                      |	ХарактеристикиКонтрагентов.Контрагент = &Контрагент
						                      |	И ХарактеристикиКонтрагентов.ВидХарактеристики = &ВидХарактеристики");
						Запрос.УстановитьПараметр("Контрагент", ФЛ);
						Запрос.УстановитьПараметр("ВидХарактеристики", ПланыВидовХарактеристик.ВидыХарактеристикКонтрагентов.МестоРождения);
						Выборка = Запрос.Выполнить().Выбрать();
						Если Выборка.Следующий() И ТипЗнч(Выборка.ДатаРождения) = Тип("Строка") Тогда
							Значение = Выборка.МестоРождения;
						Иначе
							Значение = ПустаяДата;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Значение = ФЛ.МестоРождения;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "МестоРождУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					Значение = Результат[0].ФизическоеЛицо.МестоРождения;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "ПолБух" Тогда
			
			Если ИДКонф = "ББУ" Тогда
				Значение = 0;
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = 0;
					Иначе
						Если Результат[0].ФизическоеЛицо.Пол = Перечисления.Пол.Женский Тогда
							Значение = 2;
						ИначеЕсли Результат[0].ФизическоеЛицо.Пол = Перечисления.Пол.Мужской Тогда
							Значение = 1;
						Иначе
							Значение = 0;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = 0;
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "ПолУпПред" Тогда

			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = 0;
				Иначе
					Если Результат[0].ФизическоеЛицо.Пол = Перечисления.Пол.Женский Тогда
						Значение = 2;
					ИначеЕсли Результат[0].ФизическоеЛицо.Пол = Перечисления.Пол.Мужской Тогда
						Значение = 1;
					Иначе
						Значение = 0;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = 0;
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "ГраждБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереГражданство", ФЛ);
						Если Гражданство = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = Гражданство.Код;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереГражданство", ФЛ);
						Если Гражданство = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = Гражданство.Код;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ГраждСтранаБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереГражданство", ФЛ);
						Если Гражданство = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = ?(ПустаяСтрока(Гражданство.НаименованиеПолное), Гражданство.Наименование, Гражданство.НаименованиеПолное);
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереГражданство", ФЛ);
						Если Гражданство = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = ?(ПустаяСтрока(Гражданство.НаименованиеПолное), Гражданство.Наименование, Гражданство.НаименованиеПолное);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "ГраждУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеГражданство", Результат[0].ФизическоеЛицо);
					Если Гражданство = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = Гражданство.Код;
					КонецЕсли;

				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "ГраждСтранаУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеГражданство", Результат[0].ФизическоеЛицо);
					Если Гражданство = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = ?(ПустаяСтрока(Гражданство.НаименованиеПолное), Гражданство.Наименование, Гражданство.НаименованиеПолное);
					КонецЕсли;

				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "ТелБух" ИЛИ ИмяПоказателя = "ТелОтпр" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Данные = Новый Структура("Объект, Тип, Вид", ФЛ, Перечисления.ТипыКонтактнойИнформации.Телефон, ДомашнийТелефонФизЛица);
						Результат2 = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Представление;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						Данные = Новый Структура("Объект, Тип, Вид", ФЛ, Перечисления.ТипыКонтактнойИнформации.Телефон, ДомашнийТелефонФизЛица);
						Результат2 = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Представление;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КодУдЛичнБух" Тогда

			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", Результат[0].ОтветственноеЛицо.Контрагент);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Если УдЛичн.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
								Значение = "";
							Иначе
								Значение = УдЛичн.ДокументВид.Код;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Если УдЛичн.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
								Значение = "";
							Иначе
								Значение = УдЛичн.ДокументВид.КодИМНС;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ВидУдЛичнБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", Результат[0].ОтветственноеЛицо.Контрагент);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Если УдЛичн.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
								Значение = "";
							Иначе
								Значение = УдЛичн.ДокументВид.Наименование;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Если УдЛичн.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
								Значение = "";								
							Иначе
								Значение = УдЛичн.ДокументВид.Наименование;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОрганВыданУдЛичнБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументКемВыдан;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументКемВыдан;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СерияУдЛичнБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументСерия;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументСерия;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НомерУдЛичнБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументНомер;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументНомер;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаУдЛичнБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФЛ = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументДатаВыдачи;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ДокументДатаВыдачи;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрМЖБухРФ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = ПустойАдрес;
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = АдресВФормате9Запятых(Результат2);
						Иначе
							Значение = ПустойАдрес;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = ПустойАдрес;
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = АдресВФормате9Запятых(Результат2);
						Иначе
							Значение = ПустойАдрес;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИндексМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле1;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле1;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СубъектМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле2;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле2;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КодСубъектМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Формат(КодРегионаПоНазванию(Результат2.Поле2), "ЧЦ=2; ЧВН=");
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Формат(КодРегионаПоНазванию(Результат2.Поле2), "ЧЦ=2; ЧВН=");
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "РайонМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле3;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле3;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ГородМЖБух" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле4;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле4;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "НПунктМЖБух" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле5;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле5;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "УлицаМЖБух" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле6;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле6;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ДомМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле7;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле7;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КорпусМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле8;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле8;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КвартираМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					Если НЕ ЗначениеЗаполнено(Результат[0].ОтветственноеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ОтветственноеЛицо.Контрагент);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле9;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЗначениеЗаполнено(Результат[0].ФизическоеЛицо) Тогда
						Значение = "";
					Иначе
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ФизическоеЛицо);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Поле9;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
			
		//**********************************************Сведения об уполномоченном представителе
		ИначеЕсли ИмяПоказателя = "ФИОУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					//Значение = Результат[0].ФизическоеЛицо.Наименование;
					ФЛ = Результат[0].ФизическоеЛицо;
					Если ФЛ = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИННУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					Значение = Результат[0].ФизическоеЛицо.ИНН;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТелУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					
					Значение = "";
					
				Иначе
					
					Данные = Новый Структура("Объект, Тип, Вид",Результат[0].ФизическоеЛицо, Перечисления.ТипыКонтактнойИнформации.Телефон, ДомашнийТелефонФизЛица);

					Результат2 = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);

					Если Результат2 <> Неопределено Тогда
						Значение = Результат2.Представление;
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
				
		ИначеЕсли ИмяПоказателя = "КодУдЛичнУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Если УдЛичн.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
							Значение = "";								
						Иначе
							Значение = УдЛичн.ДокументВид.КодИМНС;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ВидУдЛичнУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Если УдЛичн.ДокументВид = Справочники.ДокументыУдостоверяющиеЛичность.ПустаяСсылка() Тогда
							Значение = "";								
						Иначе
							Значение = УдЛичн.ДокументВид.Наименование;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОрганВыданУдЛичнУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.ДокументКемВыдан;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СерияУдЛичнУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.ДокументСерия;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НомерУдЛичнУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.ДокументНомер;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаУдЛичнУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = ПустаяДата;
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
					Если УдЛичн = Неопределено Тогда
						Значение = ПустаяДата;
					Иначе
						Значение = УдЛичн.ДокументДатаВыдачи;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрМЖУпПредРФ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = ПустойАдрес;
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						Значение = АдресВФормате9Запятых(Результат2);
					Иначе
						Значение = ПустойАдрес;
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИндексМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						Значение = Результат2.Поле1;
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СубъектМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						Значение = Результат2.Поле2;
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КодСубъектМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						Значение = Формат(КодРегионаПоНазванию(Результат2.Поле2), "ЧЦ=2; ЧВН=");//КодРегионаПоНазванию(Результат2.Поле2);
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "РайонМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						Значение = Результат2.Поле3;
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ГородМЖУпПред" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						Значение = Результат2.Поле4;
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "НПунктМЖУпПред" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						Значение = Результат2.Поле5;
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "УлицаМЖУпПред" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						Значение = Результат2.Поле6;
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ДомМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						Значение = Результат2.Поле7;
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КорпусМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						Значение = Результат2.Поле8;
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КвартираМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						Значение = Результат2.Поле9;
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		//прочие сведения
		ИначеЕсли ИмяПоказателя = "ФаксИсп" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "ДолжнОтпр" Тогда
			
			Значение = "ГЛАВНЫЙ БУХГАЛТЕР"
			
		ИначеЕсли ИмяПоказателя = "СтавкаРефинансирования" Тогда
			
			Если ИДКонф = "ББУ" Тогда
				Значение = 0;
			Иначе
				Результат = РегистрыСведений.СтавкаРефинансированияЦБ.СрезПоследних(ДатаЗначения);
				Если Результат.Количество() > 0 Тогда
					Значение = Результат[0].Размер;
				Иначе
					Значение = 0;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаПереходаНаУСН" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" Тогда
				Значение = ПустаяДата;
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "УчетнаяПолитикаНалоговыйУчет");
				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Значение = ?(ТипЗнч(Результат) = Тип("Структура"), Результат.ДатаПереходаНаУСН, Результат[0].ДатаПереходаНаУСН);
				Иначе
					Значение = ПустаяДата;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОбъектНалогообложенияУСН" Тогда
			
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" Тогда
				Значение = 0;
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "УчетнаяПолитикаНалоговыйУчет");
				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					ПромежуточноеЗначение = ?(ТипЗнч(Результат) = Тип("Структура"), Результат.ОбъектНалогообложенияУСН, Результат[0].ОбъектНалогообложенияУСН);
					Если ПромежуточноеЗначение = Перечисления.ОбъектыНалогообложенияПоУСН.Доходы Тогда
						Значение = 1;
					ИначеЕсли ПромежуточноеЗначение = Перечисления.ОбъектыНалогообложенияПоУСН.ДоходыМинусРасходы Тогда
						Значение = 2;
					Иначе
						Значение = 0;
					КонецЕсли;
				Иначе
					Значение = 0;
				КонецЕсли;
			КонецЕсли;
			
		//сведения о банковском счете организации
		ИначеЕсли ИмяПоказателя = "БанкСчетНомер" Тогда
		
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" Тогда
				Значение = "";
			Иначе
				БанкСчет = Организация.ОсновнойБанковскийСчет;
				Если БанкСчет = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					Значение = БанкСчет.НомерСчета;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "БанкСчетНаимБанка" Тогда
		
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" Тогда
				Значение = "";
			Иначе
				БанкСчет = Организация.ОсновнойБанковскийСчет;
				Если БанкСчет = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					Банк = БанкСчет.Банк;
					Если Банк = Справочники.Банки.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						Значение = Банк.Наименование;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "БанкСчетКоррСчетБанка" Тогда
		
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" Тогда
				Значение = "";
			Иначе
				БанкСчет = Организация.ОсновнойБанковскийСчет;
				Если БанкСчет = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					Банк = БанкСчет.Банк;
					Если Банк = Справочники.Банки.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						Значение = Банк.КоррСчет;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "БанкСчетБИКБанка" Тогда
		
			Если ИДКонф = "ББУ" ИЛИ ИДКонф = "ЗБУ" Тогда
				Значение = "";
			Иначе
				БанкСчет = Организация.ОсновнойБанковскийСчет;
				Если БанкСчет = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					Банк = БанкСчет.Банк;
					Если Банк = Справочники.Банки.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						Значение = Банк.Код;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НаимГоловнОрг" Тогда

			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Значение = Организация.ГоловнаяОрганизация.НаименованиеПолное;
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "КППГоловнОрг" Тогда

			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Значение = Организация.ГоловнаяОрганизация.КПП;
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "ФИОИсп" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИсполнителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ФЛ = Результат[0][?(ИдКонф = "ББУ", "ОтветственноеЛицо", "ФизическоеЛицо")];
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					ФЛ = Результат[0][?(ИдКонф = "ББУ", "ОтветственноеЛицо", "ФизическоеЛицо")];
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					ИначеЕсли ИдКонф = "ББУ" Тогда
						ФЛКонтрагент = ФЛ.Контрагент;
						Значение = СокрЛП(СокрЛП(ФЛКонтрагент.Фамилия) + " " + СокрЛП(ФЛКонтрагент.Имя) + " " + СокрЛП(ФЛКонтрагент.Отчество));
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДолжнИсп" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИсполнителе");
			Если ИдКонф = "ББУ" Тогда
				Значение = "ГЛАВНЫЙ БУХГАЛТЕР";
			ИначеЕсли Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если НЕ ЗначениеЗаполнено(Результат[0].Должность) Тогда
					Значение = "";
				Иначе
					Значение = СокрЛП(Результат[0].Должность.Наименование);
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТелИсп" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИсполнителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если ИдКонф = "ББУ" Тогда
					ФизЛицо = Результат[0].ОтветственноеЛицо.Контрагент;
					Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
						Значение = "";
					Иначе
						Данные = Новый Структура("Объект, Тип, Вид", ФизЛицо, Перечисления.ТипыКонтактнойИнформации.Телефон, ДомашнийТелефонФизЛица);
						Результат2 = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Представление;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					ФизЛицо = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
						Значение = "";
					Иначе
						Данные = Новый Структура("Объект, Тип, Вид", ФизЛицо, Перечисления.ТипыКонтактнойИнформации.Телефон, ДомашнийТелефонФизЛица);
						Результат2 = РегистрыСведений.КонтактнаяИнформация.Получить(Данные);
						Если Результат2 <> Неопределено Тогда
							Значение = Результат2.Представление;
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		Иначе

			Значение = "";//если вернуть строку - больше шансов угадать, так как большинство сведений - строковые
			
		КонецЕсли;

		ОргСведения.Вставить(ИмяПоказателя, Значение);

	КонецЦикла;

	Возврат ОргСведения;

КонецФункции

Процедура ЗаписатьСегментДанныхРазделаДекларацииНДС(ДекларацияНДС, ИмяРаздела, НомерПервойСтроки, СегментДанных) Экспорт
	МодульРегламентированнаяОтчетность=ОбщегоНазначенияСервер.ОбщийМодуль("РегламентированнаяОтчетность");
	Если МодульРегламентированнаяОтчетность=Неопределено Тогда Возврат; КонецЕсли;

	ВидДополнительногоФайла = "Данные" + ИмяРаздела + "." + Формат(НомерПервойСтроки, "ЧН=; ЧГ=0");
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РегламентированныйОтчет", ДекларацияНДС);
	ПараметрыЗаписи.Вставить("ВидДополнительногоФайла", ВидДополнительногоФайла);
	
	ПараметрыЗаписи.Вставить("Данные", СегментДанных);
	
	МодульРегламентированнаяОтчетность.ЗаписатьДанныеВРегистрДополнительныхФайлов(ПараметрыЗаписи);
КонецПроцедуры

Процедура ЗаписатьСегментТабличногоДокументаРазделаДекларацииНДС(ДекларацияНДС, ИмяРаздела, НомерПервойСтроки, ПредставлениеСегмента) Экспорт
	МодульРегламентированнаяОтчетность=ОбщегоНазначенияСервер.ОбщийМодуль("РегламентированнаяОтчетность");
	Если МодульРегламентированнаяОтчетность=Неопределено Тогда Возврат; КонецЕсли;

	ВидДополнительногоФайла = "ТабличныйДокумент" + ИмяРаздела + "." + Формат(НомерПервойСтроки, "ЧН=; ЧГ=0");
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РегламентированныйОтчет", ДекларацияНДС);
	ПараметрыЗаписи.Вставить("ВидДополнительногоФайла", ВидДополнительногоФайла);	
	ПараметрыЗаписи.Вставить("Данные", ПредставлениеСегмента);
	
	МодульРегламентированнаяОтчетность.ЗаписатьДанныеВРегистрДополнительныхФайлов(ПараметрыЗаписи);
	
КонецПроцедуры

Функция КодРегионаПоНазванию(Название) Экспорт
	
	Если ПустаяСтрока(Название) Тогда
		Возврат "";
	КонецЕсли;
	
	Назв = СокрЛ(Название);
	ПервыЙПробел = Найти(Назв, " ");
	Если ПервыйПробел <> 0 Тогда
		Назв = Лев(Назв, ПервыйПробел - 1);
	КонецЕсли;

	// затем пробуем найти в таблице регионов
	МакетРегионы = Обработки.ОбщиеОбъектыРегламентированнойОтчетности.ПолучитьМакет("Регионы");
	нрегАдресРегион = нрег(Название);
	Для Инд = 1 По МакетРегионы.ВысотаТаблицы Цикл
		ТекРегион = СокрЛП(МакетРегионы.Область(Инд, 1, Инд, 1).Текст);
		Если Лев(нрегАдресРегион, СтрДлина(ТекРегион)) = нрег(ТекРегион) Тогда
			Возврат СокрЛП(МакетРегионы.Область(Инд, 2, Инд, 2).Текст);
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции	

Процедура ЗаписатьИтогиРазделаДекларацииНДС(ДекларацияНДС, ИмяРаздела, Итоги) Экспорт
	МодульРегламентированнаяОтчетность=ОбщегоНазначенияСервер.ОбщийМодуль("РегламентированнаяОтчетность");
	Если МодульРегламентированнаяОтчетность=Неопределено Тогда Возврат; КонецЕсли;
	
	ВидДополнительногоФайла = "Итоги" + ИмяРаздела;
	
	ПараметрыЗаписи=Новый Структура;
	ПараметрыЗаписи.Вставить("РегламентированныйОтчет", ДекларацияНДС);
	ПараметрыЗаписи.Вставить("ВидДополнительногоФайла", ВидДополнительногоФайла);
	ПараметрыЗаписи.Вставить("Данные", Итоги);
	
	МодульРегламентированнаяОтчетность.ЗаписатьДанныеВРегистрДополнительныхФайлов(ПараметрыЗаписи);	
КонецПроцедуры

Функция ПустоеЗначение(Реквизит) Экспорт

	Если Реквизит = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Если ТипЗнч(Реквизит) = Тип("Строка") Тогда
		Возврат ПустаяСтрока(Реквизит);
	ИначеЕсли ТипЗнч(Реквизит) = Тип("Число") Тогда
		Если Реквизит = 0 Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Реквизит) = Тип("Дата") Тогда
		Если Реквизит = Дата('00010101') Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

КонецФункции

// Функция возвращает пользовательское представление адреса в формате "9 запятых" по переданному в качестве
// параметра внутреннему представлению.
// Параметры:
//		АдресВФормате9Запятых - строка, внутренне представление адреса в формате "9 запятых".
// Возвращаемое значение:
//		Строка - пользовательское представление адреса в формате "9 запятых".
//		АнализироватьРегион - если Истина, то анализируется переданный регион, на предмет
//				             содержания цифр в коде региона, если цифры есть то вместо них
//				             подставляется текст региона, если не цифры, то остается как есть.
//				             если Ложь, то регион не анализируется.
//
Функция ПредставлениеАдресаВФормате9Запятых(Знач АдресВФормате9Запятых, АнализироватьРегион = Ложь) Экспорт
	
	Если СтрЧислоВхождений(АдресВФормате9Запятых, ",") <> 9 ИЛИ (Лев(АдресВФормате9Запятых, 3) <> "643" И Лев(АдресВФормате9Запятых, 3) <> "999") Тогда
		Возврат АдресВФормате9Запятых;
	КонецЕсли;
	
	КопияАдреса = АдресВФормате9Запятых;
	
	ПоследняяКоордината = 0;
	СоставляющиеАдреса = Новый Массив;
	КоординатыЗапятых = Новый Массив;
	Для Сч = 1 По 9 Цикл
		КоординатаЗапятой = Найти(КопияАдреса, ",");
		КоординатыЗапятых.Добавить(ПоследняяКоордината + КоординатаЗапятой);
		ПоследняяКоордината = ПоследняяКоордината + КоординатаЗапятой;
		КопияАдреса = Сред(КопияАдреса, КоординатаЗапятой + 1);
	КонецЦикла;
	
	СоставляющиеАдреса.Добавить(СокрЛП(Лев(АдресВФормате9Запятых, КоординатыЗапятых[0] - 1)));
	Для Сч = 0 По 7 Цикл
		СоставляющиеАдреса.Добавить(СокрЛП(Сред(АдресВФормате9Запятых, КоординатыЗапятых[Сч] + 1, КоординатыЗапятых[Сч + 1] - (КоординатыЗапятых[Сч] + 1))));
	КонецЦикла;
	СоставляющиеАдреса.Добавить(СокрЛП(Сред(АдресВФормате9Запятых, КоординатыЗапятых[8] + 1)));
	
	ТекПредставление = "";

	Если СокрЛП(СоставляющиеАдреса[1]) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + СокрЛП(СоставляющиеАдреса[1]);
	КонецЕсли;

	Если СокрЛП(СоставляющиеАдреса[2]) <> "" Тогда
		Регион = СокрЛП(СоставляющиеАдреса[2]);
		Если АнализироватьРегион Тогда
			Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Регион) Тогда
				Регион = ПолучитьНазваниеРегионаПоКоду(Регион);
			КонецЕсли;
		КонецЕсли;

		ТекПредставление = ТекПредставление + ", " + Регион;
	КонецЕсли;

	Если СокрЛП(СоставляющиеАдреса[3]) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + СокрЛП(СоставляющиеАдреса[3]);
	КонецЕсли;

	Если СокрЛП(СоставляющиеАдреса[4]) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + СокрЛП(СоставляющиеАдреса[4]);
	КонецЕсли;

	Если СокрЛП(СоставляющиеАдреса[5]) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + СокрЛП(СоставляющиеАдреса[5]);
	КонецЕсли;

	Если СокрЛП(СоставляющиеАдреса[6]) <> "" Тогда
		ТекПредставление = ТекПредставление + ", " + СокрЛП(СоставляющиеАдреса[6]);
	КонецЕсли;

	Если СокрЛП(СоставляющиеАдреса[7]) <> "" Тогда
		ТекПредставление = ТекПредставление + ", дом № " + СокрЛП(СоставляющиеАдреса[7]);
	КонецЕсли;

	Если СокрЛП(СоставляющиеАдреса[8]) <> "" Тогда
		ТекПредставление = ТекПредставление + ", корпус " + СокрЛП(СоставляющиеАдреса[8]);
	КонецЕсли;

	Если СокрЛП(СоставляющиеАдреса[9]) <> "" Тогда
		ТекПредставление = ТекПредставление + ", кв. " + СокрЛП(СоставляющиеАдреса[9]);
	КонецЕсли;

	Если СтрДлина(ТекПредставление) > 2 Тогда
		ТекПредставление = Сред(ТекПредставление, 3);
	КонецЕсли;
	
	Возврат ТекПредставление;
	
КонецФункции
		
// Функция возвращает значение адреса в формате "9 запятых" по переданной в качестве параметра записи
// регистра сведений КонтактнаяИнформация.
// Параметры:
//		Запись - ссылка на запись регистра сведений КонтактнаяИнформация.
// Возвращаемое значение:
//		Строка - адрес в формате "9 запятых"
Функция АдресВФормате9Запятых(Запись)
	
	АдресБезКодастраны = СокрЛП(Запись.Поле1) + "," + СокрЛП(Запись.Поле2) + "," + СокрЛП(Запись.Поле3) + "," + 
						СокрЛП(Запись.Поле4) + "," + СокрЛП(Запись.Поле5) + "," + СокрЛП(Запись.Поле6) + "," + 
						СокрЛП(Запись.Поле7) + "," + СокрЛП(Запись.Поле8) + "," + СокрЛП(Запись.Поле9);

	Если АдресБезКодаСтраны = ",,,,,,,," Тогда
		Возврат ",,,,,,,,,";
	Иначе
		Возврат "643," + АдресБезКодаСтраны;
	КонецЕсли;
	
КонецФункции

// Выполянет преобразование цифры в римскую нотацию 
//
// Параметры
//		Цифра - число, целое, от 0 до 9
//      РимскаяЕдиница,РимскаяПятерка,РимскаяДесятка - строки, соответствующие римские цифры
//
// Возвращаемое значение
//		строка
//
// Описание
//		записывает "обычную" цифру римскими цифрами,
//		например:
//				ПреобразоватьЦифруВРимскуюНотацию(7,"I","V","X") = "VII"
//
Функция ПреобразоватьЦифруВРимскуюНотацию(Цифра,РимскаяЕдиница,РимскаяПятерка,РимскаяДесятка)

	РимскаяЦифра="";
	Если Цифра = 1 Тогда
	   РимскаяЦифра = РимскаяЕдиница
	ИначеЕсли Цифра = 2 Тогда
	   РимскаяЦифра = РимскаяЕдиница + РимскаяЕдиница;
	ИначеЕсли Цифра = 3 Тогда
	   РимскаяЦифра = РимскаяЕдиница + РимскаяЕдиница + РимскаяЕдиница;
	ИначеЕсли Цифра = 4 Тогда
	   РимскаяЦифра = РимскаяЕдиница + РимскаяПятерка;
	ИначеЕсли Цифра = 5 Тогда
	   РимскаяЦифра = РимскаяПятерка;
	ИначеЕсли Цифра = 6 Тогда
	   РимскаяЦифра = РимскаяПятерка + РимскаяЕдиница;
	ИначеЕсли Цифра = 7 Тогда
	   РимскаяЦифра = РимскаяПятерка + РимскаяЕдиница + РимскаяЕдиница;
	ИначеЕсли Цифра = 8 Тогда
	   РимскаяЦифра = РимскаяПятерка + РимскаяЕдиница + РимскаяЕдиница + РимскаяЕдиница;
	ИначеЕсли Цифра = 9 Тогда
	   РимскаяЦифра = РимскаяЕдиница + РимскаяДесятка;
	КонецЕсли;
	Возврат РимскаяЦифра;

КонецФункции

// Дополняет строку указанным символом до указанной длины
//
// Параметры: 
//  Стр            - Дополняемая строка
//  Длина          - Требуемая длина результирующей строки
//  Чем            - Символ, которым дополняется строка
//
// Возвращаемое значение:
//  Строка дополненная указанным символом до указанной длины
//
Функция ДополнитьСтроку1(Знач Стр, Длина, Чем=" ", Режим = 0) Экспорт
	
	СимволовДополнить = Длина -  СтрДлина(Стр);
	Добавок = "";
	Для Н=1 по СимволовДополнить Цикл
		Добавок =	Добавок + Чем;
	КонецЦикла;
	Возврат ?(Режим=0, Добавок + Стр, Стр + Добавок);
	
КонецФункции 


// Выполянет преобразование арабского числа в римское 
//
// Параметры
//		АрабскоеЧисло - число, целое, от 0 до 999
//
// Возвращаемое значение
//		строка
//
// Описание
//		записывает "обычное" число римскими цифрами,
//		например:
//				ПреобразоватьЧислоВРимскуюНотацию(17) = "ХVII"
//
Функция ПреобразоватьЧислоВРимскуюНотацию(АрабскоеЧисло, ИспЛатинскиеБуквы = Ложь) Экспорт
	
	РимскоеЧисло="";
	cRab = ДополнитьСтроку1(АрабскоеЧисло,3);

	Если ИспЛатинскиеБуквы Тогда
		c1 = "I";c5 = "V";c10 = "X";c50 = "L";c100 ="C";c500 = "M";c1000 = "D";
		
	Иначе
		c1 = "1";c5 = "У";c10 = "Х";c50 = "Л";c100 ="С";c500 = "М";c1000 = "Д";
	КонецЕсли;

	nEd = Число(Сред(cRab,3,1));
	nDs = Число(Сред(cRab,2,1));
	nSt = Число(Сред(cRab,1,1));

	РимскоеЧисло = РимскоеЧисло + ПреобразоватьЦифруВРимскуюНотацию(nSt,c100,c500,c1000);
	РимскоеЧисло = РимскоеЧисло + ПреобразоватьЦифруВРимскуюНотацию(nDs,c10,c50,c100);
	РимскоеЧисло = РимскоеЧисло + ПреобразоватьЦифруВРимскуюНотацию(nEd,c1,c5,c10);

	Возврат РимскоеЧисло;
	
КонецФункции //ПреобразоватьЧислоВРимскуюНотацию
