Процедура ДвиженияПоРегистрам(РежимПроведения, Отказ)
	Если Отказ Тогда Возврат; КонецЕсли; 

	Для Каждого СтрокаТабличнойЧасти Из Проводки Цикл
		//Бухгалтерский учет
		НоваяСтрока=Движения.Хозрасчетный.Добавить();
		НоваяСтрока.Активность=Истина;
		НоваяСтрока.Период=Дата;
		НоваяСтрока.Регистратор=Ссылка;
		НоваяСтрока.Организация=Организация;
		//НоваяСтрока.Валюта=ДополнительныеСвойства.ВалютаБухУчета;
		
		НоваяСтрока.СчетДт=СтрокаТабличнойЧасти.Счет;
		НоваяСтрока.СчетКт=СчетТЗР;
		БухгалтерскийУчет.УстановитьСубконтоПоСчету(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, 1, СтрокаТабличнойЧасти.Субконто1);
		БухгалтерскийУчет.УстановитьСубконтоПоСчету(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, 2, СтрокаТабличнойЧасти.Субконто2);
		БухгалтерскийУчет.УстановитьСубконтоПоСчету(НоваяСтрока.СчетДт, НоваяСтрока.СубконтоДт, 3, СтрокаТабличнойЧасти.Субконто3);
		БухгалтерскийУчет.УстановитьСубконтоПоСчету(НоваяСтрока.СчетКт, НоваяСтрока.СубконтоКт, 1, СтрокаТабличнойЧасти.Номенклатура);
		Если НоваяСтрока.СчетДт.УчетПоПодразделениям Тогда
			НоваяСтрока.ПодразделениеДт=СтрокаТабличнойЧасти.Подразделение;
		КонецЕсли;
		НоваяСтрока.Сумма=СтрокаТабличнойЧасти.Сумма;
		НоваяСтрока.СуммаНУДт=СтрокаТабличнойЧасти.СуммаНУ;
		НоваяСтрока.СуммаНУКт=СтрокаТабличнойЧасти.Сумма;		
	КонецЦикла;

КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий модуля

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УправлениеДокументамиСервер.ПередПроведением(Отказ, РежимПроведения, ЭтотОбъект);
	Если Отказ Тогда Возврат; КонецЕсли;
	
	ДвиженияПоРегистрам(РежимПроведения, Отказ);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Операторы основной программы

УправлениеДокументамиСервер.ИнициализацияМодуля(ДополнительныеСвойства);
