
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ГруппыТоваров.ПолучитьЭлементы().Количество()=0.00 Тогда
		КлассификаторЕТСНГ=Обработки.ПечатьТТН.ПолучитьМакет("ЕТСНГ");
		СтрокаГруппы=Неопределено;
		Для итератор=1 По КлассификаторЕТСНГ.ВысотаТаблицы Цикл
			Если Булево(КлассификаторЕТСНГ.ПолучитьОбласть(итератор, 3, итератор, 3).ТекущаяОбласть.Текст) = Истина Тогда
				СтрокаГруппы=ГруппыТоваров.ПолучитьЭлементы().Добавить();
				СтрокаГруппы.Группа=КлассификаторЕТСНГ.ПолучитьОбласть(итератор, 5, итератор, 5).ТекущаяОбласть.Текст;
			Иначе
				Если СтрокаГруппы=Неопределено Тогда
					продолжить;
				КонецЕсли;
				ДетальнаяСтрока=ГруппыТоваров.ПолучитьЭлементы().Добавить();
				ДетальнаяСтрока.Группа=КлассификаторЕТСНГ.ПолучитьОбласть(итератор, 2, итератор, 2).ТекущаяОбласть.Текст + " " +
										КлассификаторЕТСНГ.ПолучитьОбласть(итератор, 1, итератор, 1).ТекущаяОбласть.Текст;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если Не Элементы.ГруппыТоваров.ТекущиеДанные=Неопределено И Не Элементы.ГруппыТоваров.Родитель=Неопределено Тогда
		ОповеститьОВыборе(Элементы.ГруппыТоваров.ТекущиеДанные.Группа);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппыТоваровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОповеститьОВыборе(Элементы.ГруппыТоваров.ТекущиеДанные.Группа);
КонецПроцедуры

