Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;

	Для Каждого СтрокаТарифа Из ТарифыЗаРасчетноеОбслуживание Цикл
		Если НЕ СтрокаТарифа.ВидОплаты.ТипОплаты=Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта Тогда
			СтрокаНачалаСообщенияОбОшибке="В строке номер """+СокрЛП(СтрокаТарифа.НомерСтроки)+""" табличной части """"Тарифы за расчетное обслуживание"""": ";
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке+"Выбран вид оплаты неверного типа!", Отказ, "Справочник ""Договоры эквайринга"": ");
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры