Перем мВестиУчетНДС Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ АВТОЗАПОЛНЕНИЯ СТРОК ДОКУМЕНТА

// Процедура вызывается при нажатии на кнопку "Запонить" в диалоге документа
// Реализует алгоритм автоматического заполнения табличной части.
//
Процедура ЗаполнитьДокумент(ОшибкаЗаполнения = Ложь, Сообщать = Истина, СтрокаСообщения = "", ОтменитьПроведение = Ложь) Экспорт
	Если Проведен Тогда
		ОшибкаЗаполнения = Истина;
		СтрокаСообщения = " перед заполнением требуется отменить проведение документа";
		Если Сообщать Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Документ не заполнен:" + СтрокаСообщения, , Строка(Ссылка));
		КонецЕсли; 
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСтроки_ВычетПоПриобретеннымЦенностям(, Ложь,СтрокаСообщения,ОшибкаЗаполнения);
	
	ЗаполнитьСтроки_НДСсАвансов();
	
	ЗаполнитьСтроки_НДСсАвансовВыданных();
	
	ЗаполнитьСтроки_НДСВключенныйВСтоимость();
	
	Если Не (ВычетПоПриобретеннымЦенностям.Количество() > 0 или НДСсАвансов.Количество() >0) Тогда
		ОшибкаЗаполнения = Истина;
		СтрокаСообщения = СтрокаСообщения+Символы.ПС+" - не обнаружены записи к отражению в книге покупок"
	КонецЕсли;	

   Если ОшибкаЗаполнения Тогда
		Если Сообщать Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Документ не заполнен:"+СтрокаСообщения,,Строка(Ссылка));
		КонецЕсли; 
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Заполнение табличной части "Вычет НДС по приобретенным ценностям"

// Процедура выполняет автоматическое заполнение табличной части документа
// Вызывается из процедуры КоманднаяПанельВычетПоПриобретеннымЦенностямЗаполнить
//
Процедура ЗаполнитьСтроки_ВычетПоПриобретеннымЦенностям(ОтменитьПроведение = Ложь,Сообщать = Истина, СтрокаСообщения = "", ОшибкаЗаполнения = Ложь) Экспорт
	
	//Если Проведен Тогда
	//	Если Не ОтменитьПроведение Тогда Возврат; КонецЕсли;
	//	Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//КонецЕсли;

	УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, ОшибкаЗаполнения, Организация);
	
	Если ОшибкаЗаполнения Тогда
		СтрокаСообщения = "Не указаны параметры учетной политики ("+СокрЛП(Организация)+") на " + Формат(Дата, "ДЛФ=DD") + Символы.ПС 
						+ "Табличное поле «Вычет НДС по приобретенным ценностям» не может быть заполнено автоматически.";
		Если Сообщать Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Документ не заполнен:"+СтрокаСообщения,,Строка(Ссылка));
		КонецЕсли; 
		Возврат;
	КонецЕсли;

	ТаблицаРезультатов = ВычетПоПриобретеннымЦенностям.ВыгрузитьКолонки();
	
	КонтролироватьОплатуДляСФсДатойМенее01012006 = Истина;
	ПоложенияПереходногоПериода2006_ОткорректироватьСуммуДоступнуюКВычету = ложь;

	ОшибкаПолученияУчетнойПолитики2005 = Ложь;
	
	Если Дата>= '20080101' тогда
		КонтролироватьОплатуДляСФсДатойМенее01012006 = Ложь;
	ИначеЕсли Дата>= '20060101' Тогда
		УчетнаяПолитикаНУ_31122005 = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики('20051231', ОшибкаПолученияУчетнойПолитики2005, Организация,,Ложь);
		Если не ОшибкаПолученияУчетнойПолитики2005 и УчетнаяПолитикаНУ_31122005.МоментОпределенияНалоговойБазыНДС = Перечисления.МоментыОпределенияНалоговойБазыНДС.ПоОплате тогда
			// Учетная политика велась по оплате. Обработка положений переходного периода не требуется.
		ИначеЕсли не ОшибкаПолученияУчетнойПолитики2005 тогда
			// Учетная политика на 31.12.2005 велась по отгрузке, требуется отработка положений переходного периода по НДС.
			КонтролироватьОплатуДляСФсДатойМенее01012006 = Ложь;
		Иначе
			КонтролироватьОплатуДляСФсДатойМенее01012006 = Ложь;
			ПоложенияПереходногоПериода2006_ОткорректироватьСуммуДоступнуюКВычету = Ложь;
		КонецЕсли; 
		// Отработка положений переходного периода по НДС
	КонецЕсли; 
	
	//Если ПредъявленНДСКВычету0 Тогда
	//	Дерево_НДСкВычету = ЗаполнитьНДСКВычетуПоДаннымРегистраНДСПредъявленныйРеализация0(КонтролироватьОплатуДляСФсДатойМенее01012006);
	//	Если Дерево_НДСкВычету.Количество()=0 Тогда
	//		// Дальнейшая обработка не требуется, не обнаружен НДС, который может быть принят к вычету.
	//		ВычетПоПриобретеннымЦенностям.Очистить(); Возврат;
	//	КонецЕсли;		
	//Иначе	
	//	Дерево_НДСкВычету = ЗаполнитьНДСКВычетуПоДаннымРегистраНДСПредъявленный(КонтролироватьОплатуДляСФсДатойМенее01012006);
	//	Если Дерево_НДСкВычету.Количество()=0 Тогда
	//		// Дальнейшая обработка не требуется, не обнаружен НДС, который может быть принят к вычету.
	//		ВычетПоПриобретеннымЦенностям.Очистить(); Возврат;
	//	КонецЕсли;				
	//КонецЕсли;
	
	
	Если ПредъявленНДСКВычету0 Тогда
		Дерево_НДСкВычету = ЗаполнитьНДСКВычетуПоДаннымРегистраНДСПредъявленныйРеализация0(КонтролироватьОплатуДляСФсДатойМенее01012006);
	Иначе	
		Дерево_НДСкВычету = ЗаполнитьНДСКВычетуПоДаннымРегистраНДСПредъявленный(КонтролироватьОплатуДляСФсДатойМенее01012006);
	КонецЕсли;
	
	Если Дерево_НДСкВычету.Количество()=0 Тогда
		// Дальнейшая обработка не требуется, не обнаружен НДС, который может быть принят к вычету.
		ВычетПоПриобретеннымЦенностям.Очистить(); Возврат;
	КонецЕсли;

	// Определение суммы, которую можно принять к вычету на основании
	// п. 10. статьи 2 ФЗ №119-ФЗ - 1/6 в течении первого полугодия 2006 года
	Дерево_НДСкВычету.Колонки.Добавить("ОпределенаДоля_119ФЗ_2_10", Новый описаниеТипов("Булево"));
	Дерево_НДСкВычету.Колонки.Добавить("КВычету_СНДС_Часть", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	Дерево_НДСкВычету.Колонки.Добавить("КВычету_НДС_Часть", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	Если ПоложенияПереходногоПериода2006_ОткорректироватьСуммуДоступнуюКВычету Тогда
		ОтработкаПоложенииПереходногоПериода2006_ОткорректироватьСуммуДоступнуюКВычету(Дерево_НДСкВычету);
	КонецЕсли; 
	
////	СписокСчетовФактур = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(Дерево_НДСкВычету.Строки.ВыгрузитьКолонку("СчетФактура"),Истина);
	СписокСчетовФактур = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(Дерево_НДСкВычету.ВыгрузитьКолонку("СчетФактура"),Истина);
	// Ограничиваем получаемые распределенные оплаты только отфактурованными поступлениями.
	// Отсутствие СФ допускается только для НДС, уплаченного на таможне, а оплаты по нему тоже не регистрируются.
	ТаблицаСФ = УчетНДС.ОпределитьНаличиеСчетовФактурПолученных(,КонецДня(Дата),Организация, СписокСчетовФактур,Ложь, Истина, Истина, КонецДня(Дата));
	ОтфактурованныеПоступления = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(ТаблицаСФ.ВыгрузитьКолонку("Документ"),Истина);

	Дерево_НДСкВычету.Колонки.КВычету_БезНДС.Имя="СуммаБезНДС";
	Дерево_НДСкВычету.Колонки.КВычету_НДС.Имя="НДС";
	Дерево_НДСкВычету.Колонки.КВычету_СНДС.Имя="СуммаСНДС";
	Дерево_НДСкВычету.Колонки.Добавить("ДокументОплаты");
	Дерево_НДСкВычету.Колонки.Добавить("ДатаОплаты",ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	Дерево_НДСкВычету.Колонки.Добавить("КорректируемыйПериод");
	Дерево_НДСкВычету.Колонки.Добавить("ЗаписьДополнительногоЛиста");
	Дерево_НДСкВычету.Колонки.Добавить("КодВидаОперации");
	ТаблицаРезультатов=Дерево_НДСкВычету.СкопироватьКолонки(); 
	 Для каждого СтрокаКоллекции Из Дерево_НДСкВычету Цикл
		 докСсылка=СтрокаКоллекции.СчетФактура;
		Если Не ЗначениеЗаполнено(докСсылка) Тогда
			Сообщить("Пустой документ <Счет-фактура>, проверьте регистр <НДС предъявленый поставщиком!> ");
			Прервать;
		КонецЕсли;
		 
		 ///*****
		Если ОтфактурованныеПоступления.Найти(докСсылка)=Неопределено Тогда Продолжить; КонецЕсли; 
		Если СтрокаКоллекции.ПорядокОплаты=1 Тогда
			Запрос=Новый Запрос;
			Запрос.Текст= "ВЫБРАТЬ
			              |	ИсточникДанных.ДокументОплаты КАК ДокументОплаты,
			              |	ИсточникДанных.Сумма КАК СуммаОплаты
			              |ИЗ
			              |	Документ.РегистрацияОплатыНДСВБюджет.ОплатаПоДоговорамНалоговогоАгента КАК ИсточникДанных
			              |ГДЕ
			              |	ИсточникДанных.СчетФактура = &СчетФактура
			              |	И ИсточникДанных.Поставщик = &Поставщик
			              |	И ИсточникДанных.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
						  |	
						  |	ОБЪЕДИНИТЬ ВСЕ
						  |ВЫБРАТЬ
			              |	ИсточникДанных1.ДокументОплаты КАК ДокументОплаты,
			              |	ИсточникДанных1.Сумма КАК СуммаОплаты
			              |ИЗ
			              |	Документ.РегистрацияОплатыНДСВБюджет.ОплатаДляСобственногоПотребления КАК ИсточникДанных1
			              |ГДЕ
			              |	ИсточникДанных1.СчетФактура = &СчетФактура
			              |	И ИсточникДанных1.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
						  |";
			Запрос.УстановитьПараметр("СчетФактура",докСсылка);
			Запрос.УстановитьПараметр("Поставщик",СтрокаКоллекции.Поставщик);
			Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Дата));
			Запрос.УстановитьПараметр("ДатаКонца",КонецМесяца(Дата));
			тзОплат=Запрос.Выполнить().Выгрузить();
			Если тзОплат.Количество()=0 Тогда Продолжить; КонецЕсли;
			Для Каждого СтрокаТз ИЗ тзОплат Цикл
				НоваяСтрока=ТаблицаРезультатов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции);
				СчетФактураДокумент=УчетНДС.НайтиПодчиненныйСчетФактуру(НоваяСтрока.СчетФактура,"СчетФактураПолученный");
				Если НЕ СчетФактураДокумент=Неопределено Тогда 
					НоваяСтрока.КодВидаОперации=СчетФактураДокумент.КодВидаОперации;
				Иначе
					Если ЗначениеЗаполнено(НоваяСтрока.СчетФактура) Тогда
						Если УправлениеМетаданными.ЕстьРеквизит("КодВидаОперации", НоваяСтрока.СчетФактура.Метаданные()) Тогда
							НоваяСтрока.КодВидаОперации=НоваяСтрока.СчетФактура.КодВидаОперации;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				//Доля=СтрокаТз.СуммаОплаты/НоваяСтрока.СуммаСНДС; Была по сумме но в документе сумма НДС
				Доля=СтрокаТз.СуммаОплаты/НоваяСтрока.НДС;
				НоваяСтрока.НДС=НоваяСтрока.НДС*Доля;
				НоваяСтрока.СуммаБезНДС=НоваяСтрока.СуммаБезНДС*Доля;
				Если ЗначениеЗаполнено(СтрокаТз.ДокументОплаты) Тогда
					НоваяСтрока.ДатаОплаты=СтрокаТз.ДокументОплаты.Дата;
					НоваяСтрока.ДокументОплаты=СтрокаТз.ДокументОплаты;
				КонецЕсли;
			КонецЦикла;
		Иначе	
			НоваяСтрока=ТаблицаРезультатов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаКоллекции);
			СчетФактураДокумент=УчетНДС.НайтиПодчиненныйСчетФактуру(НоваяСтрока.СчетФактура,"СчетФактураПолученный");
			Если НЕ СчетФактураДокумент=Неопределено Тогда 
				НоваяСтрока.КодВидаОперации=СчетФактураДокумент.КодВидаОперации;
			Иначе
				Если УправлениеМетаданными.ЕстьРеквизит("КодВидаОперации", НоваяСтрока.СчетФактура.Метаданные()) Тогда
					НоваяСтрока.КодВидаОперации=НоваяСтрока.СчетФактура.КодВидаОперации;
				КонецЕсли;	
			КонецЕсли;
			Если (ПредъявленНДСКВычету0 И НоваяСтрока.Состояние = Перечисления.НДССостоянияРеализация0.НеПодтвержденаРеализация0) 
				Или НоваяСтрока.СуммаБезНДС < 0 Или НоваяСтрока.НДС < 0 Тогда
				НДСНалоговыйПериод = Перечисления.Периодичность.Квартал;
				НоваяСтрока.ЗаписьДополнительногоЛиста = Истина;
				Если ПредъявленНДСКВычету0 Тогда
					НоваяСтрока.КорректируемыйПериод = Макс(НоваяСтрока.ДатаОплаты, НоваяСтрока.ДокументОтгрузки.Дата);
				Иначе 
					НоваяСтрока.КорректируемыйПериод = НоваяСтрока.СчетФактураДата;
				КонецЕсли;
				Если ?(НДСНалоговыйПериод = Перечисления.Периодичность.Месяц, 
					КонецМесяца(НоваяСтрока.КорректируемыйПериод) = КонецМесяца(Дата),
					КонецКвартала(НоваяСтрока.КорректируемыйПериод) = КонецКвартала(Дата)) Тогда
					НоваяСтрока.ЗаписьДополнительногоЛиста = Ложь;
					НоваяСтрока.КорректируемыйПериод = '00010101';
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
		Если УправлениеМетаданными.ЕстьРеквизит("КорректируемыйПериод", докСсылка.Метаданные())  Тогда
			Если Не ЗначениеЗаполнено(докСсылка.КорректируемыйПериод) Тогда Продолжить; КонецЕсли;
			СтрокаКоллекции.ЗаписьДополнительногоЛиста=Истина;
			СтрокаКоллекции.КорректируемыйПериод=докСсылка.КорректируемыйПериод;
		КонецЕсли;
		Если ТипЗнч(докСсылка)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			Если докСсылка.ВидОперации=Перечисления.ВидыОперацийПоступленияТоваров.ПокупкаВЛизинг Тогда
				
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла; //03.03.10

	ВычетПоПриобретеннымЦенностям.Загрузить(ТаблицаРезультатов);

КонецПроцедуры

// Вызывается из процедуры ЗаполнитьСтроки_ВычетПоПриобретеннымЦенностям.
// Заполняет ТЧ ВычетПоПриобретеннымЦенностям по данным регистра НДСПредъявленный
Функция ЗаполнитьНДСКВычетуПоДаннымРегистраНДСПредъявленный(КонтролироватьОплатуДляСФсДатойМенее01012006 = истина)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("ДатаГраница", новый Граница(КонецДня(Дата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Начало2006Года", '20060101');
	Запрос.УстановитьПараметр("КонтролироватьОплатуДляСФсДатойМенее01012006", КонтролироватьОплатуДляСФсДатойМенее01012006);	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	НДСПредъявленныйОстатки.Организация,
	|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
	|	НДСПредъявленныйОстатки.ВидЦенности,
	|	НДСПредъявленныйОстатки.СтавкаНДС,
	|	НДСПредъявленныйОстатки.СчетУчетаНДС,
	|	НДСПредъявленныйОстатки.Поставщик,
	|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0)) КАК КВычету_БезНДС,
	|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0)) КАК КВычету_НДС,
	|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0)) КАК КВычету_СНДС,
	|	ЕСТЬNULL(НДСПредъявленныйОстатки.СчетФактура.Дата, &Дата) КАК СчетФактураДата,
	|	ВЫБОР
	|		КОГДА НДСПредъявленныйОстатки.ВидЦенности В (&ВидыЦенностей_ОплатаПоНДС)
	|			ТОГДА 1
	|		КОГДА НДСПредъявленныйОстатки.ВидЦенности В (&ВидыЦенностей_БезОплаты)
	|			ТОГДА 2
	|		КОГДА НДСПредъявленныйОстатки.ВидЦенности В (&ВидыЦенностей_Возврат)
	|			ТОГДА 4
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СчетФактура.Дата, &Дата) >= &Начало2006Года
	|					ТОГДА 3
	|				КОГДА (НЕ &КонтролироватьОплатуДляСФсДатойМенее01012006)
	|					ТОГДА 3
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ПорядокОплаты
	|ИЗ
	|	РегистрНакопления.НДСПредъявленный.Остатки(&ДатаГраница,
	|			Организация = &Организация
	|		    И (НЕ ВидЦенности В (&ИсключаемыеВидыЦенностей))) КАК НДСПредъявленныйОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(&ДатаГраница,
	|			Организация = &Организация
	|		    И (НЕ ВидЦенности В (&ИсключаемыеВидыЦенностей))) КАК НДСПредъявленныйРеализация0Остатки
	|		ПО НДСПредъявленныйОстатки.СчетФактура = НДСПредъявленныйРеализация0Остатки.СчетФактура
	|			И НДСПредъявленныйОстатки.ВидЦенности = НДСПредъявленныйРеализация0Остатки.ВидЦенности
	|			И НДСПредъявленныйОстатки.СтавкаНДС = НДСПредъявленныйРеализация0Остатки.СтавкаНДС
	|			И НДСПредъявленныйОстатки.СчетУчетаНДС = НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС
	|			И НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток + НДСПредъявленныйРеализация0Остатки.НДСОстаток >0
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСПредъявленныйОстатки.Организация,
	|	НДСПредъявленныйОстатки.СчетФактура,
	|	НДСПредъявленныйОстатки.ВидЦенности,
	|	НДСПредъявленныйОстатки.СтавкаНДС,
	|	НДСПредъявленныйОстатки.СчетУчетаНДС,
	|	НДСПредъявленныйОстатки.Поставщик,
	|	ЕСТЬNULL(НДСПредъявленныйОстатки.СчетФактура.Дата, &Дата),
	|	ВЫБОР
	|		КОГДА НДСПредъявленныйОстатки.ВидЦенности В (&ВидыЦенностей_ОплатаПоНДС)
	|			ТОГДА 1
	|		КОГДА НДСПредъявленныйОстатки.ВидЦенности В (&ВидыЦенностей_БезОплаты)
	|			ТОГДА 2
	|		КОГДА НДСПредъявленныйОстатки.ВидЦенности В (&ВидыЦенностей_Возврат)
	|			ТОГДА 4
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СчетФактура.Дата, &Дата) >= &Начало2006Года
	|					ТОГДА 3
	|				КОГДА (НЕ &КонтролироватьОплатуДляСФсДатойМенее01012006)
	|					ТОГДА 3
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0)) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетФактураДата
	|";

	// Исключаемые из анализа виды ценностей
	ИсключаемыеВидыЦенностей = Новый СписокЗначений;
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыВыданные);

	// Виды ценностей с особым порядком распределения оплат - по НДС выплаченному в бюджет
	ВидыЦенностей_ОплатаПоНДС = Новый СписокЗначений;
	ВидыЦенностей_ОплатаПоНДС.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентАренда);
	ВидыЦенностей_ОплатаПоНДС.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы);
	ВидыЦенностей_ОплатаПоНДС.Добавить(Перечисления.ВидыЦенностей.ВнутреннееПотребление);
	ВидыЦенностей_ОплатаПоНДС.Добавить(Перечисления.ВидыЦенностей.СМРСобственнымиСилами);
	
	// Виды ценностей с особым порядком распределения оплат - оплата не определяется
	ВидыЦенностей_БезОплаты = Новый СписокЗначений;
	ВидыЦенностей_БезОплаты.Добавить(Перечисления.ВидыЦенностей.ТаможенныеПлатежи);
	ВидыЦенностей_БезОплаты.Добавить(Перечисления.ВидыЦенностей.ТаможенныеПлатежиОС);
	ВидыЦенностей_Возврат = Новый СписокЗначений;
	ВидыЦенностей_Возврат.Добавить(Перечисления.ВидыЦенностей.Возврат);
	
	Запрос.УстановитьПараметр("ИсключаемыеВидыЦенностей", ИсключаемыеВидыЦенностей);
	Запрос.УстановитьПараметр("ВидыЦенностей_ОплатаПоНДС", ВидыЦенностей_ОплатаПоНДС);
	Запрос.УстановитьПараметр("ВидыЦенностей_БезОплаты", ВидыЦенностей_БезОплаты);
	Запрос.УстановитьПараметр("ВидыЦенностей_Возврат", ВидыЦенностей_Возврат);

	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции


//// Вызывается из процедуры ЗаполнитьСтроки_ВычетПоПриобретеннымЦенностям.
//// Заполняет ТЧ ВычетПоПриобретеннымЦенностям по данным регистра НДСПредъявленныйРеализация0
//Функция ЗаполнитьНДСКВычетуПоДаннымРегистраНДСПредъявленныйРеализация0(КонтролироватьОплатуДляСФсДатойМенее01012006 = истина)

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	НДСПредъявленныйРеализация0Остатки.Организация,
//		|	НДСПредъявленныйРеализация0Остатки.СчетФактура КАК СчетФактура,
//		|	НДСПредъявленныйРеализация0Остатки.ВидЦенности,
//		|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
//		|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС,
//		|	ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) КАК КВычету_БезНДС,
//		|	ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) КАК КВычету_НДС,
//		|	ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) КАК КВычету_СНДС,
//		|	ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СчетФактура.Дата, &Дата) КАК СчетФактураДата,
//		|	ВЫБОР
//		|		КОГДА НДСПредъявленныйРеализация0Остатки.ВидЦенности В (&ВидыЦенностей_ОплатаПоНДС)
//		|			ТОГДА 1
//		|		КОГДА НДСПредъявленныйРеализация0Остатки.ВидЦенности В (&ВидыЦенностей_БезОплаты)
//		|			ТОГДА 2
//		|		КОГДА НДСПредъявленныйРеализация0Остатки.ВидЦенности В (&ВидыЦенностей_Возврат)
//		|			ТОГДА 4
//		|		ИНАЧЕ ВЫБОР
//		|				КОГДА ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СчетФактура.Дата, &Дата) >= &Начало2006Года
//		|					ТОГДА 3
//		|				КОГДА (НЕ &КонтролироватьОплатуДляСФсДатойМенее01012006)
//		|					ТОГДА 3
//		|				ИНАЧЕ 0
//		|			КОНЕЦ
//		|	КОНЕЦ КАК ПорядокОплаты,
//		|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки,
//		|	НДСПредъявленныйОстатки.Поставщик,
//		|	НДСПредъявленныйРеализация0Остатки.Состояние
//		|ИЗ
//		|	РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
//		|		&ДатаГраница,
//		|		Организация = &Организация
//		|		    И (НЕ ВидЦенности В (&ИсключаемыеВидыЦенностей))
//		|		    И Состояние В (&ОтрабатываемыеСостояния)) КАК НДСПредъявленныйРеализация0Остатки
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСПредъявленный.Остатки(
//		|		&ДатаГраница,
//		|		Организация = &Организация
//		|		    И (НЕ ВидЦенности В (&ИсключаемыеВидыЦенностей))) КАК НДСПредъявленныйОстатки
//		|		ПО НДСПредъявленныйРеализация0Остатки.СчетФактура = НДСПредъявленныйОстатки.СчетФактура
//		|			И НДСПредъявленныйРеализация0Остатки.ВидЦенности = НДСПредъявленныйОстатки.ВидЦенности
//		|			И НДСПредъявленныйРеализация0Остатки.СтавкаНДС = НДСПредъявленныйОстатки.СтавкаНДС
//		|			И НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС = НДСПредъявленныйОстатки.СчетУчетаНДС
//		|			И (НДСПредъявленныйОстатки.СуммаБезНДСОстаток + НДСПредъявленныйОстатки.НДСОстаток > 0)
//		|ГДЕ
//		|	(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток > 0
//		|			ИЛИ НДСПредъявленныйРеализация0Остатки.НДСОстаток > 0)
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	СчетФактураДата
//		|ИТОГИ
//		|	СУММА(КВычету_БезНДС),
//		|	СУММА(КВычету_НДС),
//		|	СУММА(КВычету_СНДС)
//		|ПО
//		|	СчетФактура,
//		|	ПорядокОплаты";

//	Запрос.УстановитьПараметр("Организация",  Организация);
//	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
//	Запрос.УстановитьПараметр("ДатаГраница", новый Граница(КонецДня(Дата),ВидГраницы.Включая));
//	Запрос.УстановитьПараметр("Начало2006Года", '20060101');
//	Запрос.УстановитьПараметр("КонтролироватьОплатуДляСФсДатойМенее01012006", КонтролироватьОплатуДляСФсДатойМенее01012006);

//	// Исключаемые из анализа виды ценностей
//	ИсключаемыеВидыЦенностей = Новый СписокЗначений;
//	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
//	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);

//	// Виды ценностей с особым порядком распределения оплат - по НДС выплаченному в бюджет
//	ВидыЦенностей_ОплатаПоНДС = Новый СписокЗначений;
//	ВидыЦенностей_ОплатаПоНДС.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентАренда);
//	ВидыЦенностей_ОплатаПоНДС.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы);
//	ВидыЦенностей_ОплатаПоНДС.Добавить(Перечисления.ВидыЦенностей.ВнутреннееПотребление);
//	ВидыЦенностей_ОплатаПоНДС.Добавить(Перечисления.ВидыЦенностей.СМРСобственнымиСилами);
//	
//	// Виды ценностей с особым порядком распределения оплат - оплата не определяется
//	ВидыЦенностей_БезОплаты = Новый СписокЗначений;
//	ВидыЦенностей_БезОплаты.Добавить(Перечисления.ВидыЦенностей.ТаможенныеПлатежи);
//	ВидыЦенностей_БезОплаты.Добавить(Перечисления.ВидыЦенностей.ТаможенныеПлатежиОС);
//	ВидыЦенностей_Возврат = Новый СписокЗначений;
//	ВидыЦенностей_Возврат.Добавить(Перечисления.ВидыЦенностей.Возврат);
//	
//	Запрос.УстановитьПараметр("ИсключаемыеВидыЦенностей", ИсключаемыеВидыЦенностей);
//	Запрос.УстановитьПараметр("ВидыЦенностей_ОплатаПоНДС", ВидыЦенностей_ОплатаПоНДС);
//	Запрос.УстановитьПараметр("ВидыЦенностей_БезОплаты", ВидыЦенностей_БезОплаты);
//	Запрос.УстановитьПараметр("ВидыЦенностей_Возврат", ВидыЦенностей_Возврат);
//	
//	ОтрабатываемыеСостояния = Новый СписокЗначений;
//	ОтрабатываемыеСостояния.Добавить(Перечисления.НДССостоянияРеализация0.ПодтвержденаРеализация0);
//	ОтрабатываемыеСостояния.Добавить(Перечисления.НДССостоянияРеализация0.НеПодтвержденаРеализация0);
//	
//	Запрос.УстановитьПараметр("ОтрабатываемыеСостояния",ОтрабатываемыеСостояния);
//	
//	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	// Проверяем возможность предъявления к вычету по остаткам регистра "НДС предъявленный)
//	// (вычет не может превышать текущий остаток)
//	Запрос.УстановитьПараметр("СписокСчетовФактур", РезультатЗапроса.Строки.ВыгрузитьКолонку("СчетФактура"));
//	Запрос.Текст="
//	|ВЫБРАТЬ
//	|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
//	|	НДСПредъявленныйОстатки.ВидЦенности,
//	|	НДСПредъявленныйОстатки.СтавкаНДС,
//	|	НДСПредъявленныйОстатки.СчетУчетаНДС,
//	|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток + НДСПредъявленныйОстатки.НДСОстаток КАК СуммаСНДС
//	|ИЗ
//	|	РегистрНакопления.НДСПредъявленный.Остатки(&ДатаГраница,
//	|			Организация = &Организация
//	|			И (НЕ ВидЦенности В (&ИсключаемыеВидыЦенностей))
//	|			И СчетФактура В (&СписокСчетовФактур)) КАК НДСПредъявленныйОстатки
//	|ГДЕ
//	|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток + НДСПредъявленныйОстатки.НДСОстаток > 0
//	|ИТОГИ
//	|	СУММА(СуммаСНДС)
//	|ПО
//	|	СчетФактура
//	|";    
//	ДоступныйКВычетуНДС = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);

//	СтрокиСФкУдалению = новый массив();
//	СтруктураОтбора = НОвый структура("ВидЦенности, СтавкаНДС, СчетУчетаНДС");
//	Для каждого СтрокаСФ Из РезультатЗапроса.Строки Цикл
//		СтрокаСФ_НДСПРедъявленный = ДоступныйКВычетуНДС.строки.Найти(СтрокаСФ.СчетФактура,"СчетФактура");
//		Если СтрокаСФ_НДСПРедъявленный = Неопределено Тогда
//			// Не найдены положитьельные остатки по СФ
//			// НДС по СФ не может быть принят к вычету
//			СтрокиСФкУдалению.Добавить(СтрокаСФ);
//			Продолжить;
//		ИначеЕсли СтрокаСФ_НДСПРедъявленный.СуммаСНДС >= СтрокаСФ.КВычету_СНДС тогда
//			// Сумма НДС доступного к вычету по СФ не менее, чем сумма списываемая документом.
//			// Корректировка не требуется
//			Продолжить;
//		КонецЕсли;

//		Для каждого СтрокаПорядкаОплат Из СтрокаСФ.Строки Цикл		
//			СтрокиКУдалению = Новый Массив();
//			Для каждого СтрокаРасшифровки Из СтрокаПорядкаОплат.Строки Цикл
//				ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаРасшифровки);
//				СтрокиПоОтбору = СтрокаСФ_НДСПРедъявленный.строки.НайтиСтроки(СтруктураОтбора);
//				Если СтрокиПоОтбору.Количество() = 0 Тогда
//					СтрокиКУдалению.Добавить(СтрокаРасшифровки);
//					Продолжить;
//				КонецЕсли;
//				//может быть выбрана только одна строка
//				СтрокаПоОтбору = СтрокиПоОтбору[0];
//				Если СтрокаПоОтбору.СуммаСНДС = 0 тогда 
//					СтрокиКУдалению.Добавить(СтрокаРасшифровки);
//					Продолжить;
//				КонецЕсли;
//				
//				Если СтрокаПоОтбору.СуммаСНДС >= СтрокаРасшифровки.КВычету_СНДС тогда
//					СтрокаПоОтбору.СуммаСНДС = СтрокаПоОтбору.СуммаСНДС - СтрокаРасшифровки.КВычету_СНДС;
//				Иначе
//					СтрокаРасшифровки.КВычету_НДС = (СтрокаРасшифровки.КВычету_НДС*СтрокаПоОтбору.СуммаСНДС/СтрокаРасшифровки.КВычету_СНДС);
//					СтрокаРасшифровки.КВычету_СНДС = СтрокаПоОтбору.СуммаСНДС;
//					СтрокаРасшифровки.КВычету_БезНДС = СтрокаРасшифровки.КВычету_СНДС - СтрокаРасшифровки.КВычету_НДС;
//					СтрокаПоОтбору.СуммаСНДС = 0;
//				КонецЕсли;
//			КонецЦикла; 
//			Для каждого СтрокаКУдалению	из СтрокиКУдалению Цикл
//				СтрокаПорядкаОплат.Строки.Удалить(СтрокаКУдалению);
//			КонецЦикла; 
//			
//			СтрокаПорядкаОплат.КВычету_НДС = СтрокаПорядкаОплат.Строки.Итог("КВычету_НДС");
//			СтрокаПорядкаОплат.КВычету_СНДС = СтрокаПорядкаОплат.Строки.Итог("КВычету_СНДС");
//			СтрокаПорядкаОплат.КВычету_БезНДС = СтрокаПорядкаОплат.Строки.Итог("КВычету_БезНДС");
//		
//		КонецЦикла; 
//		СтрокаСФ.КВычету_НДС = СтрокаСФ.Строки.Итог("КВычету_НДС");
//		СтрокаСФ.КВычету_СНДС = СтрокаСФ.Строки.Итог("КВычету_СНДС");
//		СтрокаСФ.КВычету_БезНДС = СтрокаСФ.Строки.Итог("КВычету_БезНДС");
//		
//		Если СтрокаСФ.КВычету_СНДС = 0 Тогда
//			СтрокиСФкУдалению.Добавить(СтрокаСФ);
//		КонецЕсли;
//	КонецЦикла; 
//	
//	Для каждого СтрокаКУдалению	из СтрокиСФкУдалению Цикл
//		РезультатЗапроса.Строки.Удалить(СтрокаКУдалению);
//	КонецЦикла; 
//	
//	Возврат РезультатЗапроса;
//КонецФункции

Функция ЗаполнитьНДСКВычетуПоДаннымРегистраНДСПредъявленныйРеализация0(КонтролироватьОплатуДляСФсДатойМенее01012006 = истина)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСПредъявленныйРеализация0Остатки.Организация,
		|	НДСПредъявленныйРеализация0Остатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйРеализация0Остатки.ВидЦенности,
		|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
		|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС,
		|	ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) КАК КВычету_БезНДС,
		|	ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) КАК КВычету_НДС,
		|	ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) КАК КВычету_СНДС,
		|	ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СчетФактура.Дата, &Дата) КАК СчетФактураДата,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйРеализация0Остатки.ВидЦенности В (&ВидыЦенностей_ОплатаПоНДС)
		|			ТОГДА 1
		|		КОГДА НДСПредъявленныйРеализация0Остатки.ВидЦенности В (&ВидыЦенностей_БезОплаты)
		|			ТОГДА 2
		|		КОГДА НДСПредъявленныйРеализация0Остатки.ВидЦенности В (&ВидыЦенностей_Возврат)
		|			ТОГДА 4
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СчетФактура.Дата, &Дата) >= &Начало2006Года
		|					ТОГДА 3
		|				КОГДА (НЕ &КонтролироватьОплатуДляСФсДатойМенее01012006)
		|					ТОГДА 3
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК ПорядокОплаты,
		|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки,
		|	НДСПредъявленныйОстатки.Поставщик,
		|	НДСПредъявленныйРеализация0Остатки.Состояние
		|ИЗ
		|	РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
		|		&ДатаГраница,
		|		Организация = &Организация
		|		    И (НЕ ВидЦенности В (&ИсключаемыеВидыЦенностей))
		|		    И Состояние В (&ОтрабатываемыеСостояния)) КАК НДСПредъявленныйРеализация0Остатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДСПредъявленный.Остатки(
		|		&ДатаГраница,
		|		Организация = &Организация
		|		    И (НЕ ВидЦенности В (&ИсключаемыеВидыЦенностей))) КАК НДСПредъявленныйОстатки
		|		ПО НДСПредъявленныйРеализация0Остатки.СчетФактура = НДСПредъявленныйОстатки.СчетФактура
		|			И НДСПредъявленныйРеализация0Остатки.ВидЦенности = НДСПредъявленныйОстатки.ВидЦенности
		|			И НДСПредъявленныйРеализация0Остатки.СтавкаНДС = НДСПредъявленныйОстатки.СтавкаНДС
		|			И НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС = НДСПредъявленныйОстатки.СчетУчетаНДС
		|			И (НДСПредъявленныйОстатки.СуммаБезНДСОстаток + НДСПредъявленныйОстатки.НДСОстаток > 0)
		|ГДЕ
		|	(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток > 0
		|			ИЛИ НДСПредъявленныйРеализация0Остатки.НДСОстаток > 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетФактураДата
		|ИТОГИ
		|	СУММА(КВычету_БезНДС),
		|	СУММА(КВычету_НДС),
		|	СУММА(КВычету_СНДС)
		|ПО
		|	СчетФактура,
		|	ПорядокОплаты";

	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("ДатаГраница", новый Граница(КонецДня(Дата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Начало2006Года", '20060101');
	Запрос.УстановитьПараметр("КонтролироватьОплатуДляСФсДатойМенее01012006", КонтролироватьОплатуДляСФсДатойМенее01012006);

	// Исключаемые из анализа виды ценностей
	ИсключаемыеВидыЦенностей = Новый СписокЗначений;
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);

	// Виды ценностей с особым порядком распределения оплат - по НДС выплаченному в бюджет
	ВидыЦенностей_ОплатаПоНДС = Новый СписокЗначений;
	ВидыЦенностей_ОплатаПоНДС.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентАренда);
	ВидыЦенностей_ОплатаПоНДС.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы);
	ВидыЦенностей_ОплатаПоНДС.Добавить(Перечисления.ВидыЦенностей.ВнутреннееПотребление);
	ВидыЦенностей_ОплатаПоНДС.Добавить(Перечисления.ВидыЦенностей.СМРСобственнымиСилами);
	
	// Виды ценностей с особым порядком распределения оплат - оплата не определяется
	ВидыЦенностей_БезОплаты = Новый СписокЗначений;
	ВидыЦенностей_БезОплаты.Добавить(Перечисления.ВидыЦенностей.ТаможенныеПлатежи);
	ВидыЦенностей_БезОплаты.Добавить(Перечисления.ВидыЦенностей.ТаможенныеПлатежиОС);
	ВидыЦенностей_Возврат = Новый СписокЗначений;
	ВидыЦенностей_Возврат.Добавить(Перечисления.ВидыЦенностей.Возврат);
	
	Запрос.УстановитьПараметр("ИсключаемыеВидыЦенностей", ИсключаемыеВидыЦенностей);
	Запрос.УстановитьПараметр("ВидыЦенностей_ОплатаПоНДС", ВидыЦенностей_ОплатаПоНДС);
	Запрос.УстановитьПараметр("ВидыЦенностей_БезОплаты", ВидыЦенностей_БезОплаты);
	Запрос.УстановитьПараметр("ВидыЦенностей_Возврат", ВидыЦенностей_Возврат);
	
	ОтрабатываемыеСостояния = Новый СписокЗначений;
	ОтрабатываемыеСостояния.Добавить(Перечисления.НДССостоянияРеализация0.ПодтвержденаРеализация0);
	ОтрабатываемыеСостояния.Добавить(Перечисления.НДССостоянияРеализация0.НеПодтвержденаРеализация0);
	
	Запрос.УстановитьПараметр("ОтрабатываемыеСостояния",ОтрабатываемыеСостояния);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Проверяем возможность предъявления к вычету по остаткам регистра "НДС предъявленный)
	// (вычет не может превышать текущий остаток)
	Запрос.УстановитьПараметр("СписокСчетовФактур", РезультатЗапроса.Строки.ВыгрузитьКолонку("СчетФактура"));
	Запрос.Текст="
	|ВЫБРАТЬ
	|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
	|	НДСПредъявленныйОстатки.ВидЦенности,
	|	НДСПредъявленныйОстатки.СтавкаНДС,
	|	НДСПредъявленныйОстатки.СчетУчетаНДС,
	|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток + НДСПредъявленныйОстатки.НДСОстаток КАК СуммаСНДС
	|ИЗ
	|	РегистрНакопления.НДСПредъявленный.Остатки(&ДатаГраница,
	|			Организация = &Организация
	|			И (НЕ ВидЦенности В (&ИсключаемыеВидыЦенностей))
	|			И СчетФактура В (&СписокСчетовФактур)) КАК НДСПредъявленныйОстатки
	|ГДЕ
	|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток + НДСПредъявленныйОстатки.НДСОстаток > 0
	|ИТОГИ
	|	СУММА(СуммаСНДС)
	|ПО
	|	СчетФактура
	|";    
	ДоступныйКВычетуНДС = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);

	СтрокиСФкУдалению = новый массив();
	СтруктураОтбора = НОвый структура("ВидЦенности, СтавкаНДС, СчетУчетаНДС");
	Для каждого СтрокаСФ Из РезультатЗапроса.Строки Цикл
		СтрокаСФ_НДСПРедъявленный = ДоступныйКВычетуНДС.строки.Найти(СтрокаСФ.СчетФактура,"СчетФактура");
		Если СтрокаСФ_НДСПРедъявленный = Неопределено Тогда
			// Не найдены положитьельные остатки по СФ
			// НДС по СФ не может быть принят к вычету
			СтрокиСФкУдалению.Добавить(СтрокаСФ);
			Продолжить;
		ИначеЕсли СтрокаСФ_НДСПРедъявленный.СуммаСНДС >= СтрокаСФ.КВычету_СНДС тогда
			// Сумма НДС доступного к вычету по СФ не менее, чем сумма списываемая документом.
			// Корректировка не требуется
			Продолжить;
		КонецЕсли;

		Для каждого СтрокаПорядкаОплат Из СтрокаСФ.Строки Цикл		
			СтрокиКУдалению = Новый Массив();
			Для каждого СтрокаРасшифровки Из СтрокаПорядкаОплат.Строки Цикл
				ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаРасшифровки);
				СтрокиПоОтбору = СтрокаСФ_НДСПРедъявленный.строки.НайтиСтроки(СтруктураОтбора);
				Если СтрокиПоОтбору.Количество() = 0 Тогда
					СтрокиКУдалению.Добавить(СтрокаРасшифровки);
					Продолжить;
				КонецЕсли;
				//может быть выбрана только одна строка
				СтрокаПоОтбору = СтрокиПоОтбору[0];
				Если СтрокаПоОтбору.СуммаСНДС = 0 тогда 
					СтрокиКУдалению.Добавить(СтрокаРасшифровки);
					Продолжить;
				КонецЕсли;
				
				Если СтрокаПоОтбору.СуммаСНДС >= СтрокаРасшифровки.КВычету_СНДС тогда
					СтрокаПоОтбору.СуммаСНДС = СтрокаПоОтбору.СуммаСНДС - СтрокаРасшифровки.КВычету_СНДС;
				Иначе
					СтрокаРасшифровки.КВычету_НДС = (СтрокаРасшифровки.КВычету_НДС*СтрокаПоОтбору.СуммаСНДС/СтрокаРасшифровки.КВычету_СНДС);
					СтрокаРасшифровки.КВычету_СНДС = СтрокаПоОтбору.СуммаСНДС;
					СтрокаРасшифровки.КВычету_БезНДС = СтрокаРасшифровки.КВычету_СНДС - СтрокаРасшифровки.КВычету_НДС;
					СтрокаПоОтбору.СуммаСНДС = 0;
				КонецЕсли;
			КонецЦикла; 
			Для каждого СтрокаКУдалению	из СтрокиКУдалению Цикл
				СтрокаПорядкаОплат.Строки.Удалить(СтрокаКУдалению);
			КонецЦикла; 
			
			СтрокаПорядкаОплат.КВычету_НДС = СтрокаПорядкаОплат.Строки.Итог("КВычету_НДС");
			СтрокаПорядкаОплат.КВычету_СНДС = СтрокаПорядкаОплат.Строки.Итог("КВычету_СНДС");
			СтрокаПорядкаОплат.КВычету_БезНДС = СтрокаПорядкаОплат.Строки.Итог("КВычету_БезНДС");
		
		КонецЦикла; 
		СтрокаСФ.КВычету_НДС = СтрокаСФ.Строки.Итог("КВычету_НДС");
		СтрокаСФ.КВычету_СНДС = СтрокаСФ.Строки.Итог("КВычету_СНДС");
		СтрокаСФ.КВычету_БезНДС = СтрокаСФ.Строки.Итог("КВычету_БезНДС");
		
		Если СтрокаСФ.КВычету_СНДС = 0 Тогда
			СтрокиСФкУдалению.Добавить(СтрокаСФ);
		КонецЕсли;
	КонецЦикла; 
	
	Для каждого СтрокаКУдалению	из СтрокиСФкУдалению Цикл
		РезультатЗапроса.Строки.Удалить(СтрокаКУдалению);
	КонецЦикла; 
	
	ТаблицаРезультат=Новый ТаблицаЗначений;
	Для Каждого СтрокаКоллекции ИЗ РезультатЗапроса.Колонки Цикл
		ТаблицаРезультат.Колонки.Добавить(СтрокаКоллекции.Имя,СтрокаКоллекции.ТипЗначения);
	КонецЦикла;	
	ОбработатьДерево(РезультатЗапроса,ТаблицаРезультат);
	
	Возврат ТаблицаРезультат;
КонецФункции

Процедура ОбработатьДерево(СтрокаДерева,ТаблицаРезультат)
	Если СтрокаДерева.Строки.Количество()=0 Тогда 
		ЗаполнитьЗначенияСвойств(ТаблицаРезультат.Добавить(),СтрокаДерева);
	КонецЕсли;	
	Для Каждого СтрокаКоллекции ИЗ СтрокаДерева.Строки Цикл
		ОбработатьДерево(СтрокаКоллекции,ТаблицаРезультат);
	КонецЦикла;	
КонецПроцедуры

// Процедура из процедуры ЗаполнитьСтроки_ВычетПоПриобретеннымЦенностям.
// Корректирует сумму, доступную к вычету исходя из положений преходного периода,
// установленных в п.10 статьи 2 федерального закона №119-ФЗ
Процедура ОтработкаПоложенииПереходногоПериода2006_ОткорректироватьСуммуДоступнуюКВычету(Дерево_НДСкВычету)
	Если Месяц(дата) > 6 Тогда Возврат;	КонецЕсли;
	
	// Определение списка СФ (с аналитикой) с датой ранее 2006 года, по которым НДС был предъявлен к вычету в текущем месяце
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца",  КонецМесяца(Дата));
	Запрос.УстановитьПараметр("НачалоГода2006", '20060101');
	Запрос.УстановитьПараметр("ОтбираемоеСобытие", Перечисления.СобытияПоНДСПокупки[?(ПредъявленНДСКВычету0,"ПредъявленНДСКВычету0","ПредъявленНДСКВычету")]);	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ОстаткиНаНачалоГода.СчетФактура КАК СчетФактура,
	|	ОстаткиНаНачалоГода.ВидЦенности,
	|	ОстаткиНаНачалоГода.СтавкаНДС,
	|	ОстаткиНаНачалоГода.СчетУчетаНДС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот, 0) > 0
	|			ТОГДА НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаБезНДС_ПринятоКВычетуВТекущемМесяце,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.НДСОборот, 0) > 0
	|			ТОГДА НДСЗаписиКнигиПокупокОбороты.НДСОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДС_ПринятоКВычетуВТекущемМесяце,
	|	ВЫБОР
	|		КОГДА ОстаткиНаНачалоГода.СуммаБезНДСНаНачалоГода_ЕжемесячнаяДоля > 0
	|			ТОГДА ОстаткиНаНачалоГода.СуммаБезНДСНаНачалоГода_ЕжемесячнаяДоля
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаБезНДСНаНачалоГода_ЕжемесячнаяДоля,
	|	ВЫБОР
	|		КОГДА ОстаткиНаНачалоГода.НДСНаНачалоГода_ЕжемесячнаяДоля > 0
	|			ТОГДА ОстаткиНаНачалоГода.НДСНаНачалоГода_ЕжемесячнаяДоля
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НДСНаНачалоГода_ЕжемесячнаяДоля
	|ИЗ
	|	(ВЫБРАТЬ
	|		НДСПредъявленныйОстатки.Организация КАК Организация,
	|		НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
	|		НДСПредъявленныйОстатки.ВидЦенности КАК ВидЦенности,
	|		НДСПредъявленныйОстатки.СтавкаНДС КАК СтавкаНДС,
	|		НДСПредъявленныйОстатки.СчетУчетаНДС КАК СчетУчетаНДС,
	|		НДСПредъявленныйОстатки.Поставщик КАК Поставщик,
	|		НДСПредъявленныйОстатки.СуммаБезНДСОстаток / 6 КАК СуммаБезНДСНаНачалоГода_ЕжемесячнаяДоля,
	|		НДСПредъявленныйОстатки.НДСОстаток / 6 КАК НДСНаНачалоГода_ЕжемесячнаяДоля
	|	ИЗ
	|		РегистрНакопления.НДСПредъявленный.Остатки(
	|			&НачалоГода2006,
	|			Организация = &Организация
	|			    И СчетФактура.Дата < &НачалоГода2006
	|			    И (НЕ ВидЦенности В (&ИсключаемыеВидыЦенностей))) КАК НДСПредъявленныйОстатки) КАК ОстаткиНаНачалоГода
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
	|		&НачалоМесяца,
	|		&КонецМесяца,
	|		Период,
	|		Организация = &Организация
	|		    И СчетФактура.Дата < &НачалоГода2006
	|		    И (НЕ ВидЦенности В (&ИсключаемыеВидыЦенностей))
	|		    И Событие = &ОтбираемоеСобытие) КАК НДСЗаписиКнигиПокупокОбороты
	|		ПО НДСЗаписиКнигиПокупокОбороты.Организация = ОстаткиНаНачалоГода.Организация
	|			И НДСЗаписиКнигиПокупокОбороты.Поставщик = ОстаткиНаНачалоГода.Поставщик
	|			И НДСЗаписиКнигиПокупокОбороты.СчетФактура = ОстаткиНаНачалоГода.СчетФактура
	|			И НДСЗаписиКнигиПокупокОбороты.ВидЦенности = ОстаткиНаНачалоГода.ВидЦенности
	|			И НДСЗаписиКнигиПокупокОбороты.СтавкаНДС = ОстаткиНаНачалоГода.СтавкаНДС
	|			И НДСЗаписиКнигиПокупокОбороты.СчетУчетаНДС = ОстаткиНаНачалоГода.СчетУчетаНДС
	|ГДЕ
	|	(ОстаткиНаНачалоГода.СуммаБезНДСНаНачалоГода_ЕжемесячнаяДоля > 0
	|			ИЛИ ОстаткиНаНачалоГода.НДСНаНачалоГода_ЕжемесячнаяДоля > 0)
	|ИТОГИ
	|	СУММА(СуммаБезНДС_ПринятоКВычетуВТекущемМесяце),
	|	СУММА(НДС_ПринятоКВычетуВТекущемМесяце),
	|	СУММА(СуммаБезНДСНаНачалоГода_ЕжемесячнаяДоля),
	|	СУММА(НДСНаНачалоГода_ЕжемесячнаяДоля)
	|ПО
	|	СчетФактура
	|";
		
	// Исключаемые из анализа виды ценностей
	ИсключаемыеВидыЦенностей = Новый СписокЗначений;
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентАренда);
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы);
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ВнутреннееПотребление);
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.СМРСобственнымиСилами);
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.СМРПодрядные);
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ТаможенныеПлатежи);
	ИсключаемыеВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ТаможенныеПлатежиОС);
	
	Запрос.УстановитьПараметр("ИсключаемыеВидыЦенностей", ИсключаемыеВидыЦенностей);
	
	НаличиеОстатковНаНачалоГода = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для каждого СтрокаСФ Из Дерево_НДСкВычету.Строки Цикл
		Если СтрокаСФ.СчетФактураДата<'20060101' тогда
			СтрокаОстатковНаНачалоГода_СчетФактура = НаличиеОстатковНаНачалоГода.Строки.НайтиСтроки(Новый Структура("СчетФактура",СтрокаСФ.СчетФактура));
			Если СтрокаОстатковНаНачалоГода_СчетФактура.Количество() = 0 Тогда
				// Остатки по указанному счету-фактуре на начло года не обнаружены.
				// Расчет доли к вычету (ограничение) не производится.
				Продолжить;
			КонецЕсли; 
			СтрокаОстатковНаНачалоГода_СчетФактура = СтрокаОстатковНаНачалоГода_СчетФактура[0];
			
			
			КВычетуПоСФ_СНДС = Макс(0,СтрокаОстатковНаНачалоГода_СчетФактура.СуммаБезНДСНаНачалоГода_ЕжемесячнаяДоля + СтрокаОстатковНаНачалоГода_СчетФактура.НДСНаНачалоГода_ЕжемесячнаяДоля);
			Если (СтрокаОстатковНаНачалоГода_СчетФактура.СуммаБезНДС_ПринятоКВычетуВТекущемМесяце+ СтрокаОстатковНаНачалоГода_СчетФактура.НДС_ПринятоКВычетуВТекущемМесяце) > 0 Тогда
				КВычетуПоСФ_СНДС = макс(0,КВычетуПоСФ_СНДС - (СтрокаОстатковНаНачалоГода_СчетФактура.СуммаБезНДС_ПринятоКВычетуВТекущемМесяце+ СтрокаОстатковНаНачалоГода_СчетФактура.НДС_ПринятоКВычетуВТекущемМесяце));
			КонецЕсли; 
			
			Если КВычетуПоСФ_СНДС = 0 Тогда
				// Доля определялась, но вся сумма, доступная к вычету в текущем месяце, уже принята.
				Продолжить;
			КонецЕсли; 
			
			Для каждого СтрокаПорядокОплаты  Из СтрокаСФ.Строки Цикл
				Если СтрокаПорядокОплаты.ПорядокОплаты = 3 Тогда
					СтрокаПорядокОплаты.ОпределенаДоля_119ФЗ_2_10 = истина;
					Для каждого СтрокаТаблицы из СтрокаПорядокОплаты.Строки Цикл
						СтрокаОстатковНаНачалоГода_Расшифровка = СтрокаОстатковНаНачалоГода_СчетФактура.Строки.НайтиСтроки(Новый структура("ВидЦенности, СтавкаНДС, СчетУчетаНДС",СтрокаТаблицы.ВидЦенности,СтрокаТаблицы.СтавкаНДС,СтрокаТаблицы.СчетУчетаНДС));
						
						Если СтрокаОстатковНаНачалоГода_Расшифровка.Количество() =0 Тогда
							// Остатки в указанном разрезе аналитики не обнаружены.
							// Расчет доли к вычету (ограничение) не производится.
							СтрокаТаблицы.КВычету_СНДС_Часть = СтрокаТаблицы.КВычету_СНДС;
							СтрокаТаблицы.КВычету_НДС_Часть = СтрокаТаблицы.КВычету_НДС;
							Продолжить;
						Иначе
							СтрокаОстатковНаНачалоГода_Расшифровка = СтрокаОстатковНаНачалоГода_Расшифровка[0];
						КонецЕсли;
						
						СтрокаТаблицы.ОпределенаДоля_119ФЗ_2_10 = истина;
						
						КВычету_СНДС = Макс(0,СтрокаОстатковНаНачалоГода_Расшифровка.СуммаБезНДСНаНачалоГода_ЕжемесячнаяДоля + СтрокаОстатковНаНачалоГода_Расшифровка.НДСНаНачалоГода_ЕжемесячнаяДоля);
						Если (СтрокаОстатковНаНачалоГода_Расшифровка.СуммаБезНДС_ПринятоКВычетуВТекущемМесяце+ СтрокаОстатковНаНачалоГода_Расшифровка.НДС_ПринятоКВычетуВТекущемМесяце) > 0 Тогда
							КВычету_СНДС = макс(0,КВычету_СНДС - (СтрокаОстатковНаНачалоГода_Расшифровка.СуммаБезНДС_ПринятоКВычетуВТекущемМесяце+ СтрокаОстатковНаНачалоГода_Расшифровка.НДС_ПринятоКВычетуВТекущемМесяце));
						КонецЕсли; 
						
						Если КВычету_СНДС = 0 Тогда
							// Доля определялась, но вся сумма, доступная к вычету в текущем месяце, уже принята.
							Продолжить;
						КонецЕсли; 
						
						КВычету_НДС = СтрокаОстатковНаНачалоГода_Расшифровка.НДСНаНачалоГода_ЕжемесячнаяДоля;
						Если (СтрокаОстатковНаНачалоГода_Расшифровка.НДС_ПринятоКВычетуВТекущемМесяце) > 0 Тогда
							КВычету_НДС = макс(0,КВычету_НДС - (СтрокаОстатковНаНачалоГода_Расшифровка.НДС_ПринятоКВычетуВТекущемМесяце));
						КонецЕсли; 
						
						//Расчет суммы без НДС
						Если СтрокаТаблицы.ВидЦенности = Перечисления.ВидыЦенностей.СМРПодрядные Тогда
							// СМР подрядные отрабатываются в соответствии со ст.3 п.2 №119-ФЗ, а не с положениями ст.2 п.10 №119-ФЗ.
							// Суммы к вычету разблокируется поэтапно (1/12) с использование специального документа.
							// Пересчет сумм при формировании записей книги покупок не требуется.
							СтрокаТаблицы.КВычету_СНДС_Часть = СтрокаТаблицы.КВычету_СНДС;
							СтрокаТаблицы.КВычету_НДС_Часть = СтрокаТаблицы.КВычету_НДС;
							
						Иначе
							СтрокаТаблицы.КВычету_СНДС_Часть = Макс(Мин(КВычету_СНДС,СтрокаТаблицы.КВычету_СНДС),0);
							СтрокаТаблицы.КВычету_НДС_Часть = Макс(Мин(КВычету_НДС,СтрокаТаблицы.КВычету_НДС),0);
						КонецЕсли; 
						
					КонецЦикла;
					
					СтрокаПорядокОплаты.КВычету_НДС_Часть		= СтрокаПорядокОплаты.Строки.Итог("КВычету_НДС_Часть");
					СтрокаПорядокОплаты.КВычету_СНДС_Часть		= СтрокаПорядокОплаты.Строки.Итог("КВычету_СНДС_Часть");
					
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// Заполнение таблиячной части "Вычет НДС с аванса выданных"
Процедура ЗаполнитьСтроки_НДСсАвансовВыданных(ОтменитьПроведение = Ложь) Экспорт
	
	//Если Проведен Тогда
	//	Если ОтменитьПроведение Тогда
	//		Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//	Иначе
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	ОшибкаПолученияУчетнойПолитики = Ложь;
	УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, ОшибкаПолученияУчетнойполитики, Организация);
	Если ОшибкаПолученияУчетнойПолитики Тогда Возврат; КонецЕсли;

	ТаблицаРезультатов = НДСсАвансовВыданных.ВыгрузитьКолонки();
	
	ЗаполнитьНДССАвансовВыданныхПоДаннымРегистраНДСПредъявленный(ТаблицаРезультатов);
	
	НДСсАвансовВыданных.Загрузить(ТаблицаРезультатов);
	Для Каждого СтрокаКоллекции ИЗ НДСсАвансовВыданных Цикл
		СчетФактураДокумент=УчетНДС.НайтиПодчиненныйСчетФактуру(СтрокаКоллекции.СчетФактура,"СчетФактураПолученный");
		Если НЕ СчетФактураДокумент=Неопределено Тогда 
			СтрокаКоллекции.КодВидаОперации=СчетФактураДокумент.КодВидаОперации;
		Иначе
			Если ЗначениеЗаполнено(СтрокаКоллекции.СчетФактура) Тогда
				Если УправлениеМетаданными.ЕстьРеквизит("КодВидаОперации", СтрокаКоллекции.СчетФактура.Метаданные()) Тогда
					СтрокаКоллекции.КодВидаОперации=СтрокаКоллекции.СчетФактура.КодВидаОперации;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	НДСсАвансовВыданных.Сортировать("СчетФактура, Поставщик, ДоговорКонтрагента, СтавкаНДС");
КонецПроцедуры

Процедура ЗаполнитьНДССАвансовВыданныхПоДаннымРегистраНДСПредъявленный(ТаблицаРезультатов)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаГраница", новый Граница(КонецДня(Дата),ВидГраницы.Включая));
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ИсточникДанных.СчетФактура,
	|	ИсточникДанных.СтавкаНДС,
	|	ИсточникДанных.Поставщик,
	|	ИсточникДанных.ДоговорКонтрагента,
	|	ИсточникДанных.СуммаБезНДСОстаток КАК СуммаБезНДС,
	|	ИсточникДанных.НДСОстаток КАК НДС
	|ИЗ
	|	РегистрНакопления.НДСПредъявленный.Остатки(&ДатаГраница, Организация = &Организация И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК ИсточникДанных
	|";
	Результат=Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Результат.Выгрузить(), ТаблицаРезультатов);
	КонецЕсли;	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Заполнение таблиячной части "Вычет НДС с аванса"

// Процедура выполняет автоматическое заполнение табличной части документа
// Вызывается из процедуры КоманднаяПанельНДСсАвансовЗаполнить
//
Процедура ЗаполнитьСтроки_НДСсАвансов(ОтменитьПроведение = Ложь) Экспорт
	
	//Если Проведен Тогда
	//	Если ОтменитьПроведение Тогда
	//		Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//	Иначе
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	ОшибкаПолученияУчетнойПолитики = Ложь;
	
	УчетнаяПолитикаНУ = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, ОшибкаПолученияУчетнойполитики, Организация);
	
	Если ОшибкаПолученияУчетнойПолитики Тогда
		Возврат;
	КонецЕсли;

	ТаблицаРезультатов = НДСсАвансов.ВыгрузитьКолонки();
	
	Если ПредъявленНДСКВычету0 Тогда
		ЗаполнитьНДСсАвансовПоДаннымРегистраНДСсАвансовИНДСПредъявленныйРеализация0(ТаблицаРезультатов);

	Иначе	
		Дерево_НДСсАвансов = ЗаполнитьНДСсАвансовПоДаннымРегистраНДСсАвансов();
		Если Дерево_НДСсАвансов.Строки.Количество()=0 Тогда
			// Дальнейшая обработка не требуется, не обнаружен НДС, который может быть принят к вычету.
			НДСсАвансов.Очистить(); Возврат;
		КонецЕсли;
		
		СписокСчетовФактур = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(Дерево_НДСсАвансов.Строки.ВыгрузитьКолонку("СчетФактура"),Истина);
		
		ТаблицаЗачетовАвансов = ПолучитьДанныеОЗачтенныхАвансахПоСпискуСФ(СписокСчетовФактур);
		
		РаспределитьЗачетыАвансаПоСФ(Дерево_НДСсАвансов, ТаблицаРезультатов,СписокСчетовФактур,ТаблицаЗачетовАвансов);
	КонецЕсли; 
	
	СтрокиКУдалению = ТаблицаРезультатов.НайтиСтроки(Новый Структура("СуммаБезНДС,НДС,ВалютнаяСумма", 0, 0, 0));
	
	Для каждого СтрокаКУадлению Из СтрокиКУдалению Цикл
		ТаблицаРезультатов.Удалить(СтрокаКУадлению);
	КонецЦикла;
	НДСсАвансов.Загрузить(ТаблицаРезультатов);
	
	Для Каждого СтрокаДок ИЗ НДСсАвансов Цикл
		СчетФактураДокумент=УчетНДС.НайтиПодчиненныйСчетФактуру(СтрокаДок.СчетФактура,"СчетФактураВыданный");
		Если СчетФактураДокумент=Неопределено Тогда
			СчетФактураДокумент=УчетНДС.НайтиПодчиненныйСчетФактуру(СтрокаДок.СчетФактура,"СчетФактураПолученный");
		КонецЕсли;
		Если НЕ СчетФактураДокумент=Неопределено Тогда 
			СтрокаДок.КодВидаОперации=СчетФактураДокумент.КодВидаОперации;
		Иначе
			Если ЗначениеЗаполнено(СтрокаДок.СчетФактура) Тогда
				Если УправлениеМетаданными.ЕстьРеквизит("КодВидаОперации", СтрокаДок.СчетФактура.Метаданные()) Тогда
					СтрокаДок.КодВидаОперации=СтрокаДок.СчетФактура.КодВидаОперации;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если СтрокаДок.ДоговорКонтрагента.ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда Продолжить; КонецЕсли;
		Док=СтрокаДок.СчетФактура;
		мдДокумент=Док.Метаданные();
		Для Каждого мдТабличнаяЧасть Из мдДокумент.ТабличныеЧасти Цикл
			Если мдТабличнаяЧасть.Реквизиты.Найти("ТОП")=Неопределено Тогда Продолжить; КонецЕсли;
			тзДанные=Док[мдТабличнаяЧасть.Имя].Выгрузить();
			Для Каждого СтрокаКоллекции Из тзДанные Цикл
				Для каждого СтрокаПроводки Из СтрокаКоллекции.ТОП.ПроводкиБУ Цикл
					Если СтрокаПроводки.СчетКредит.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками) Тогда
						СчетУчета=СтрокаПроводки.СчетКредит; Прервать;
					КонецЕсли;
					Если СтрокаПроводки.СчетДебет.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками) Тогда
						СчетУчета=СтрокаПроводки.СчетДебет; Прервать;
					КонецЕсли;			
				КонецЦикла;		
			КонецЦикла;
		КонецЦикла;	
		Если СчетУчета=Неопределено Тогда Сообщить("Не заполен счет покупателя в строке номер - "+СтрокаДок.НомерСтроки); Продолжить; КонецЕсли; 
		СтрокаДок.СчетПокупателя=СчетУчета;	
	КонецЦикла;	
КонецПроцедуры

// Вызывается из процедуры ЗаполнитьСтроки_НДСсАвансов.
// Заполняет ТЧ ВычетПоПриобретеннымЦенностям по данным регистра НДСПредъявленный
Функция ЗаполнитьНДСсАвансовПоДаннымРегистраНДСсАвансов()
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("ДатаГраница", новый Граница(КонецДня(Дата),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	Запрос.Текст="
	|ВЫБРАТЬ
	|	НДСсАвансовОстатки.СчетФактура КАК СчетФактура,
	|	НДСсАвансовОстатки.СтавкаНДС,
	|	НДСсАвансовОстатки.СчетФактура.Дата КАК СчетФактураДата,
	|	НДСсАвансовОстатки.Покупатель,
	|	НДСсАвансовОстатки.ДоговорКонтрагента,
	|	НДСсАвансовОстатки.ВалютаАванса,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(НДСсАвансовПоРеализации0.СуммаБезНДСОстаток, 0) > НДСсАвансовОстатки.СуммаБезНДСОстаток
	|				ТОГДА 0
	|			ИНАЧЕ НДСсАвансовОстатки.СуммаБезНДСОстаток - ЕСТЬNULL(НДСсАвансовПоРеализации0.СуммаБезНДСОстаток, 0)
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(НДСсАвансовПоРеализации0.НДСОстаток, 0) > НДСсАвансовОстатки.НДСОстаток
	|				ТОГДА 0
	|			ИНАЧЕ НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСсАвансовПоРеализации0.НДСОстаток, 0)
	|		КОНЕЦ) КАК НДС,
	|	СУММА(ВЫРАЗИТЬ((ВЫБОР
	|				КОГДА ЕСТЬNULL(НДСсАвансовПоРеализации0.СуммаБезНДСОстаток, 0) > НДСсАвансовОстатки.СуммаБезНДСОстаток
	|					ТОГДА 0
	|				ИНАЧЕ НДСсАвансовОстатки.СуммаБезНДСОстаток - ЕСТЬNULL(НДСсАвансовПоРеализации0.СуммаБезНДСОстаток, 0)
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(НДСсАвансовПоРеализации0.НДСОстаток, 0) > НДСсАвансовОстатки.НДСОстаток
	|					ТОГДА 0
	|				ИНАЧЕ НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСсАвансовПоРеализации0.НДСОстаток, 0)
	|			КОНЕЦ) * НДСсАвансовОстатки.ВалютнаяСуммаСНДСОстаток / ВЫБОР
	|				КОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток + НДСсАвансовОстатки.НДСОстаток > 0
	|					ТОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток + НДСсАвансовОстатки.НДСОстаток
	|				ИНАЧЕ 1
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК ВалютнаяСуммаСНДС
	|ИЗ
	|	РегистрНакопления.НДСсАвансов.Остатки(&ДатаГраница, Организация = &Организация) КАК НДСсАвансовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			НДСПредъявленныйРеализация0Остатки.СчетФактура КАК СчетФактура,
	|			НДСПредъявленныйРеализация0Остатки.СтавкаНДС КАК СтавкаНДС,
	|			НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
	|			НДСПредъявленныйРеализация0Остатки.НДСОстаток КАК НДСОстаток,
	|			НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки.Контрагент КАК Покупатель,
	|			НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки.ДоговорКонтрагента КАК ДоговорКонтрагента
	|		ИЗ
	|			РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
	|				&ДатаГраница,
	|				Организация = &Организация
	|				    И ВидЦенности В (&ВидыЦенностейАванс)) КАК НДСПредъявленныйРеализация0Остатки) КАК НДСсАвансовПоРеализации0
	|		ПО НДСсАвансовОстатки.СчетФактура = НДСсАвансовПоРеализации0.СчетФактура
	|			И НДСсАвансовОстатки.СтавкаНДС = НДСсАвансовПоРеализации0.СтавкаНДС
	|			И НДСсАвансовОстатки.Покупатель = НДСсАвансовПоРеализации0.Покупатель
	|			И НДСсАвансовОстатки.ДоговорКонтрагента = НДСсАвансовПоРеализации0.ДоговорКонтрагента
	|ГДЕ
	|	(НДСсАвансовОстатки.СуммаБезНДСОстаток > 0
	|			ИЛИ НДСсАвансовОстатки.НДСОстаток > 0) И НДСсАвансовОстатки.ДоговорКонтрагента.ВидДоговора<>&ВидДоговора
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСсАвансовОстатки.СчетФактура,
	|	НДСсАвансовОстатки.СтавкаНДС,
	|	НДСсАвансовОстатки.СчетФактура.Дата,
	|	НДСсАвансовОстатки.ВалютаАванса,
	|	НДСсАвансовОстатки.ДоговорКонтрагента,
	|	НДСсАвансовОстатки.Покупатель,
	|	НДСсАвансовПоРеализации0.СуммаБезНДСОстаток,
	|	НДСсАвансовПоРеализации0.НДСОстаток
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетФактураДата
	|ИТОГИ ПО
	|	СчетФактура
	|";	
	// Анализируемые виды ценностей
	ВидыЦенностейАванс = Новый СписокЗначений;
	ВидыЦенностейАванс.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ВидыЦенностейАванс.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);
	
	Запрос.УстановитьПараметр("ВидыЦенностейАванс", ВидыЦенностейАванс);

	Дерево_НДСсАвансов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Дерево_НДСсАвансов.Строки.Количество() = 0 тогда 
		Возврат Дерево_НДСсАвансов;
	КонецЕсли;
	
	СписокСчетовФактур = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(Дерево_НДСсАвансов.Строки.ВыгрузитьКолонку("СчетФактура"),Истина);

	// Получим остатки по авансам для определения суммы незачтенного аванса.
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 				КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("СписокСчетовФактур", СписокСчетовФактур);
	Запрос.УстановитьПараметр("ДатаГраница", новый Граница(КонецДня(Дата),ВидГраницы.Включая));
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ИсточникДанных.Документ КАК ДокументОплаты,
	|	СУММА(-1 * ИсточникДанных.СуммаОстаток) КАК Сумма,
	|	СУММА(-1 * ИсточникДанных.СуммаОстаток) КАК ВалютнаяСумма,
	|	ИсточникДанных.Покупатель,
	|	ИсточникДанных.ДоговорКонтрагента,
	|	ИсточникДанных.ТипДоговораКонтрагента
	|ИЗ
	|	РегистрНакопления.НДСРасчетыСПокупателями.Остатки(&ДатаГраница, Организация = &Организация И Документ В (&СписокСчетовФактур)) КАК ИсточникДанных
	|ГДЕ
	|   -1 * ИсточникДанных.СуммаОстаток  > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.Документ,
	|	ИсточникДанных.Покупатель,
	|	ИсточникДанных.ДоговорКонтрагента,
	|	ИсточникДанных.ТипДоговораКонтрагента
	|ИТОГИ ПО
	|	ДокументОплаты
	|";
	НепогашенныеАвансы = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВалютаАванса = ДополнительныеСвойства.ВалютаБухУчета;
	
	Для каждого НепогашенныйАвансПоСФ Из НепогашенныеАвансы.Строки Цикл
		ЗафиксированныйАвансПоСФ = Дерево_НДСсАвансов.Строки.Найти(НепогашенныйАвансПоСФ.ДокументОплаты,"СчетФактура");
		Если ЗафиксированныйАвансПоСФ = Неопределено Тогда Продолжить; КонецЕсли; 

		Для каждого СтрокаЗафиксированногоАванса Из НепогашенныйАвансПоСФ.Строки Цикл			
			
			Отбор = Новый Структура("Покупатель,ДоговорКонтрагента, ВалютаАванса",СтрокаЗафиксированногоАванса.Покупатель, СтрокаЗафиксированногоАванса.ДоговорКонтрагента, ВалютаАванса);

			СтрокиАвансаПоОтбору = ЗафиксированныйАвансПоСФ.Строки.НайтиСтроки(Отбор);
			Если СтрокиАвансаПоОтбору.Количество() = 0 Тогда Продолжить; КонецЕсли; 
			
			МассивСуммаБезНДС = новый Массив();
			МассивСуммаНДС = новый Массив();
			МассивВалютнаяСуммаСНДС = новый Массив();
			
			СуммаБезНДС = 0;
			СуммаНДС = 0;
			ВалютнаяСуммаСНДС = 0;
			Для каждого СтрокаАвансаПоОтбору Из СтрокиАвансаПоОтбору Цикл
				МассивСуммаБезНДС.Добавить(СтрокаАвансаПоОтбору.СуммаБезНДС);
				МассивСуммаНДС.Добавить(СтрокаАвансаПоОтбору.НДС);
				МассивВалютнаяСуммаСНДС.Добавить(СтрокаАвансаПоОтбору.ВалютнаяСуммаСНДС);
				
				СуммаБезНДС = СуммаБезНДС + СтрокаАвансаПоОтбору.СуммаБезНДС;
				СуммаНДС = СуммаНДС + СтрокаАвансаПоОтбору.НДС;
				ВалютнаяСуммаСНДС = ВалютнаяСуммаСНДС + СтрокаАвансаПоОтбору.ВалютнаяСуммаСНДС
			КонецЦикла; 
			
			Если ВалютнаяСуммаСНДС = 0 Тогда Продолжить; КонецЕсли; 
			
			ВалютнаяСуммаСНДС = Окр(ВалютнаяСуммаСНДС*Мин(СтрокаЗафиксированногоАванса.Сумма, (СуммаБезНДС+СуммаНДС))/(СуммаБезНДС+СуммаНДС), 2);
			СуммаСНДС = Мин(СтрокаЗафиксированногоАванса.Сумма, (СуммаБезНДС+СуммаНДС));
			Если СуммаСНДС = 0 Тогда Продолжить; КонецЕсли;

			СуммаБезНДС = Окр(СуммаБезНДС * СуммаСНДС/(СуммаБезНДС+СуммаНДС),2);
			СуммаНДС = СуммаСНДС - СуммаБезНДС;
			
			Если СуммаБезНДС>0 Тогда
				МассивСуммаБезНДС = ОбщегоНазначения.РаспределитьПропорционально_2(СуммаБезНДС,МассивСуммаБезНДС);
			КонецЕсли;
			
			Если СуммаНДС>0 Тогда
				МассивСуммаНДС = ОбщегоНазначения.РаспределитьПропорционально_2(СуммаНДС,МассивСуммаНДС);
			КонецЕсли; 
			
			Если ВалютнаяСуммаСНДС >0 Тогда
				МассивВалютнаяСуммаСНДС = ОбщегоНазначения.РаспределитьПропорционально_2(ВалютнаяСуммаСНДС,МассивВалютнаяСуммаСНДС);
			КонецЕсли; 
			
			Счетчик =0;
			Для каждого СтрокаАвансаПоОтбору Из СтрокиАвансаПоОтбору Цикл
				СтрокаАвансаПоОтбору.СуммаБезНДС = СтрокаАвансаПоОтбору.СуммаБезНДС - ?(СуммаБезНДС>0,МассивСуммаБезНДС[Счетчик],0);
				СтрокаАвансаПоОтбору.НДС = СтрокаАвансаПоОтбору.НДС - ?(СуммаНДС>0,МассивСуммаНДС[Счетчик],0);
				СтрокаАвансаПоОтбору.ВалютнаяСуммаСНДС = СтрокаАвансаПоОтбору.ВалютнаяСуммаСНДС - ?(ВалютнаяСуммаСНДС>0,МассивВалютнаяСуммаСНДС[Счетчик],0);
				Счетчик = Счетчик +1;
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла;
	
 	КУдалениюСФ = новый массив();
	Для каждого СтрокаПоСФ Из Дерево_НДСсАвансов.Строки Цикл
		СтрокиКУдалению = Новый Массив();
		Для каждого СтрокаАванса Из СтрокаПоСФ.Строки Цикл
			Если СтрокаАванса.СуммаБезНДС = 0 и СтрокаАванса.НДС = 0  и СтрокаАванса.ВалютнаяСуммаСНДС = 0 Тогда
				СтрокиКУдалению.Добавить(СтрокаАванса);
			КонецЕсли; 
		КонецЦикла; 
		
		Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			СтрокаПоСФ.Строки.Удалить(СтрокаКУдалению);
		КонецЦикла; 
		Если СтрокаПоСФ.Строки.Количество() = 0 тогда
			КУдалениюСФ.Добавить(СтрокаПоСФ);
		Иначе
			СтрокаПоСФ.СуммаБезНДС = СтрокаПоСФ.Строки.Итог("СуммаБезНДС");
			СтрокаПоСФ.НДС = СтрокаПоСФ.Строки.Итог("НДС");
			СтрокаПоСФ.ВалютнаяСуммаСНДС = СтрокаПоСФ.Строки.Итог("ВалютнаяСуммаСНДС");
		КонецЕсли;
	КонецЦикла; 
	
	Для каждого СтрокаКУдалению Из КУдалениюСФ Цикл
		Дерево_НДСсАвансов.Строки.Удалить(СтрокаКУдалению);
	КонецЦикла; 
	
	Возврат Дерево_НДСсАвансов;
КонецФункции

// Вызывается из процедуры ЗаполнитьСтроки_НДСсАвансов.
// Заполняет ТЧ ВычетПоПриобретеннымЦенностям по данным регистра НДСПредъявленный
Функция  ЗаполнитьНДСсАвансовПоДаннымРегистраНДСсАвансовИНДСПредъявленныйРеализация0(ТаблицаРезультатов)
	// Анализируемые виды ценностей
	ВидыЦенностейАванс = Новый СписокЗначений;
	ВидыЦенностейАванс.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ВидыЦенностейАванс.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);

	// Отрабатываемые состояния (ожидание 0% не отрабатываем)
	ОтрабатываемыеСостояния = Новый СписокЗначений;
	ОтрабатываемыеСостояния.Добавить(Перечисления.НДССостоянияРеализация0.ПодтвержденаРеализация0);
	ОтрабатываемыеСостояния.Добавить(Перечисления.НДССостоянияРеализация0.НеПодтвержденаРеализация0);
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("ДатаГраница", новый Граница(КонецДня(Дата),ВидГраницы.Включая));	
	Запрос.УстановитьПараметр("ВидыЦенностейАванс", ВидыЦенностейАванс);
	Запрос.УстановитьПараметр("ОтрабатываемыеСостояния", ОтрабатываемыеСостояния);
	Запрос.Текст="
	|ВЫБРАТЬ
	|	НДСПредъявленныйРеализация0Остатки.СчетФактура КАК СчетФактура,
	|	НДСПредъявленныйРеализация0Остатки.Состояние,
	|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки,
	|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
	|	СУММА(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток) КАК СуммаБезНДС,
	|	СУММА(НДСПредъявленныйРеализация0Остатки.НДСОстаток) КАК НДС,
	|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки.Контрагент КАК Покупатель,
	|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки.Дата
	|ИЗ
	|	РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
	|		&ДатаГраница,
	|		Организация = &Организация
	|		    И ВидЦенности В (&ВидыЦенностейАванс)
	|		    И состояние В (&ОтрабатываемыеСостояния)) КАК НДСПредъявленныйРеализация0Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСПредъявленныйРеализация0Остатки.Состояние,
	|	НДСПредъявленныйРеализация0Остатки.СчетФактура,
	|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
	|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки,
	|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки.Контрагент,
	|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки.ДоговорКонтрагента,
	|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	НДСПредъявленныйРеализация0Остатки.СчетФактура.Дата
	|ИТОГИ ПО
	|	СчетФактура
	|";
	АвансыНДСПредъявленныйРеализация0=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Если АвансыНДСПредъявленныйРеализация0.Строки.Количество()=0 Тогда Возврат ТаблицаРезультатов; КонецЕсли; 

	СписокСчетовФактур = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива( АвансыНДСПредъявленныйРеализация0.Строки.ВыгрузитьКолонку("СчетФактура"),Истина);
	
	Запрос.УстановитьПараметр("СписокСчетовФактур", СписокСчетовФактур);
	Запрос.Текст="
	|ВЫБРАТЬ
	|	НДСсАвансовОстатки.СчетФактура КАК СчетФактура,
	|	НДСсАвансовОстатки.Покупатель,
	|	НДСсАвансовОстатки.ДоговорКонтрагента,
	|	НДСсАвансовОстатки.СтавкаНДС,
	|	НДСсАвансовОстатки.ВалютаАванса,
	|	СУММА(НДСсАвансовОстатки.СуммаБезНДСОстаток) КАК СуммаБезНДС,
	|	СУММА(НДСсАвансовОстатки.НДСОстаток) КАК НДС,
	|	СУММА(НДСсАвансовОстатки.ВалютнаяСуммаСНДСОстаток) КАК ВалютнаяСуммаСНДС
	|ИЗ
	|	РегистрНакопления.НДСсАвансов.Остатки(&ДатаГраница, Организация = &Организация И СчетФактура В (&СписокСчетовФактур)) КАК НДСсАвансовОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСсАвансовОстатки.СчетФактура,
	|	НДСсАвансовОстатки.СтавкаНДС,
	|	НДСсАвансовОстатки.Покупатель,
	|	НДСсАвансовОстатки.ДоговорКонтрагента,
	|	НДСсАвансовОстатки.ВалютаАванса
	|
	|УПОРЯДОЧИТЬ ПО
	|	НДСсАвансовОстатки.СчетФактура.Дата
	|ИТОГИ ПО
	|	СчетФактура
	|";
	ЗафиксированныеАвансы=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ЗафиксированныеАвансы.Строки.Количество()=0 тогда Возврат ТаблицаРезультатов; КонецЕсли;
	
	Для каждого СтрокаСФ Из АвансыНДСПредъявленныйРеализация0.Строки Цикл
		ЗафиксированныйАвансПоСФ=ЗафиксированныеАвансы.Строки.Найти(СтрокаСФ.СчетФактура,"СчетФактура");
		Если ЗафиксированныйАвансПоСФ=Неопределено Тогда Продолжить; КонецЕсли; 
		
		Для каждого СтрокаЗафиксированногоАванса Из ЗафиксированныйАвансПоСФ.Строки Цикл
			Отбор = Новый Структура("Покупатель,ДоговорКонтрагента,СтавкаНДС",СтрокаЗафиксированногоАванса.Покупатель, СтрокаЗафиксированногоАванса.ДоговорКонтрагента, СтрокаЗафиксированногоАванса.СтавкаНДС);
			
			СтрокиАванса0=СтрокаСФ.Строки.НайтиСтроки(Отбор);
			Если СтрокиАванса0.Количество()=0 Тогда Продолжить;	КонецЕсли; 

			МассивСуммаБезНДС = новый Массив();
			МассивСуммаНДС = новый Массив();
			МассивСуммаСНДС = новый Массив();
			СуммаБезНДС = 0;
			СуммаНДС = 0;
			Для каждого СтрокаАванса0 Из СтрокиАванса0 Цикл
				МассивСуммаБезНДС.Добавить(СтрокаАванса0.СуммаБезНДС);
				МассивСуммаНДС.Добавить(СтрокаАванса0.НДС);
				МассивСуммаСНДС.Добавить(СтрокаАванса0.СуммаБезНДС+СтрокаАванса0.НДС);
				
				СуммаБезНДС = СуммаБезНДС + СтрокаАванса0.СуммаБезНДС;
				СуммаНДС = СуммаНДС + СтрокаАванса0.НДС;
			КонецЦикла; 
			
			СуммаБезНДС = Мин(СтрокаЗафиксированногоАванса.СуммаБезНДС, СуммаБезНДС);
			СуммаНДС = Мин(СтрокаЗафиксированногоАванса.НДС, СуммаНДС);
			
			Если СуммаБезНДС>0 Тогда
				МассивСуммаБезНДС = ОбщегоНазначения.РаспределитьПропорционально_2(СуммаБезНДС,МассивСуммаБезНДС);
			КонецЕсли; 
			Если СуммаНДС>0 Тогда
				МассивСуммаНДС = ОбщегоНазначения.РаспределитьПропорционально_2(СуммаНДС,МассивСуммаНДС);
			КонецЕсли; 
			
			Если СуммаБезНДС + СуммаНДС >0 Тогда
				ВалютнаяСуммаСНДС = Окр(СтрокаЗафиксированногоАванса.ВалютнаяСуммаСНДС * (СуммаБезНДС+СуммаНДС)/(СтрокаЗафиксированногоАванса.СуммаБезНДС+СтрокаЗафиксированногоАванса.НДС),2);
			Иначе 
				ВалютнаяСуммаСНДС = 0;
			КонецЕсли; 

			Если ВалютнаяСуммаСНДС>0 Тогда
				МассивСуммаСНДС = ОбщегоНазначения.РаспределитьПропорционально_2(ВалютнаяСуммаСНДС,МассивСуммаСНДС);
			КонецЕсли;
			
			Счетчик =0;
			Для каждого СтрокаАванса0 Из СтрокиАванса0 Цикл
			    СтрокаРезультата = ТаблицаРезультатов.Добавить();
				СтрокаРезультата.СчетФактура		= СтрокаАванса0.СчетФактура;
				СтрокаРезультата.Покупатель			= СтрокаАванса0.Покупатель;
				СтрокаРезультата.ДоговорКонтрагента	= СтрокаАванса0.ДоговорКонтрагента;
				СтрокаРезультата.СтавкаНДС			= СтрокаАванса0.СтавкаНДС;
				СтрокаРезультата.ДокументОтгрузки	= СтрокаАванса0.ДокументОтгрузки;
				СтрокаРезультата.Состояние			= СтрокаАванса0.Состояние;
				СтрокаРезультата.ВалютаДокумента	= СтрокаЗафиксированногоАванса.ВалютаАванса;
				СтрокаРезультата.ДатаСобытия		= СтрокаАванса0.ДокументОтгрузкиДата;
				СтрокаРезультата.СуммаБезНДС		= ?(СуммаБезНДС>0,МассивСуммаБезНДС[Счетчик],0);
				СтрокаРезультата.НДС				= ?(СуммаНДС>0,МассивСуммаНДС[Счетчик],0);
				СтрокаРезультата.ВалютнаяСумма		= ?(ВалютнаяСуммаСНДС>0,МассивСуммаСНДС[Счетчик],0);
				
				СтрокаАванса0.СуммаБезНДС = СтрокаАванса0.СуммаБезНДС - СтрокаРезультата.СуммаБезНДС;
				СтрокаАванса0.НДС = СтрокаАванса0.НДС - СтрокаРезультата.НДС;
				
			    Счетчик = Счетчик +1;
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла; 
	
	Возврат ТаблицаРезультатов;
	
КонецФункции

// Процедура вызывается из ЗаполнитьСтроки_НДСсАвансов.
// По списку счетов-фактур определяет суммы не использованных ранее распределенных оплат.
Функция ПолучитьДанныеОЗачтенныхАвансахПоСпискуСФ(СписокСчетовФактур)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокСчетовФактур", СписокСчетовФактур);
	Запрос.УстановитьПараметр("ДатаГраница", новый Граница(КонецДня(Дата),ВидГраницы.Включая));
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ИсточникДанных.Документ КАК ДокументОплаты,
	|	ИсточникДанных.Покупатель,
	|	ИсточникДанных.ДоговорКонтрагента,
	|	ИсточникДанных.ТипДоговораКонтрагента,
	|	СУММА(ИсточникДанных.СуммаПриход) КАК Сумма,
	|	СУММА(ИсточникДанных.СуммаПриход) КАК ВалютнаяСумма,
	|	ИсточникДанных.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.НДСРасчетыСПокупателями.Обороты(,	&ДатаГраница, День, Организация = &Организация И Документ В (&СписокСчетовФактур)) КАК ИсточникДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.ТипДоговораКонтрагента,
	|	ИсточникДанных.ДоговорКонтрагента,
	|	ИсточникДанных.Покупатель,
	|	ИсточникДанных.Документ,
	|	ИсточникДанных.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ ПО
	|	ДокументОплаты
	|";
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);	
КонецФункции

// Процедура осуществляет автоматическое распределение фактов зачета авансов
// на документы отгрузки, оформленные в рамках соответствующего договора
//
Процедура РаспределитьЗачетыАвансаПоСФ(Дерево_НДСсАвансов, ТаблицаРезультатов,СписокСчетовФактур,ТаблицаЗачетовАвансов)
	
	ВалютаАванса = ДополнительныеСвойства.ВалютаБухУчета;
	Для каждого СтрокаТипДоговораКонтрагента Из ТаблицаЗачетовАвансов.Строки Цикл //16.06.2011
		Для каждого СтрокаПогашенияАванса Из СтрокаТипДоговораКонтрагента.Строки Цикл
			ЗафиксированныйАвансПоСФ = Дерево_НДСсАвансов.Строки.Найти(СтрокаПогашенияАванса.ДокументОплаты,"СчетФактура");
			Если ЗафиксированныйАвансПоСФ = Неопределено Тогда Продолжить; КонецЕсли; 
			
		//	Для каждого СтрокаПогашенияАванса Из ПогашенныйАвансПоСФ.Строки Цикл				
				
				Отбор=Новый Структура("Покупатель,ДоговорКонтрагента, ВалютаАванса",СтрокаПогашенияАванса.Покупатель, СтрокаПогашенияАванса.ДоговорКонтрагента, ВалютаАванса);
			///	Отбор=Новый Структура("ТипДоговораКонтрагента,Покупатель,ДоговорКонтрагента, ВалютаАванса", СтрокаПогашенияАванса.ТипДоговораКонтрагента, СтрокаПогашенияАванса.Покупатель, СтрокаПогашенияАванса.ДоговорКонтрагента, ВалютаАванса);
				СтрокиАвансаПоОтбору=ЗафиксированныйАвансПоСФ.Строки.НайтиСтроки(Отбор);
				Если СтрокиАвансаПоОтбору.Количество()=0 Тогда Продолжить; КонецЕсли; 
				
				МассивСуммаБезНДС = новый Массив();
				МассивСуммаНДС = новый Массив();
				МассивВалютнаяСуммаСНДС = новый Массив();
				
				СуммаБезНДС = 0;
				СуммаНДС = 0;
				ВалютнаяСуммаСНДС = 0;
				Для каждого СтрокаАвансаПоОтбору Из СтрокиАвансаПоОтбору Цикл
					МассивСуммаБезНДС.Добавить(СтрокаАвансаПоОтбору.СуммаБезНДС);
					МассивСуммаНДС.Добавить(СтрокаАвансаПоОтбору.НДС);
					МассивВалютнаяСуммаСНДС.Добавить(СтрокаАвансаПоОтбору.ВалютнаяСуммаСНДС);
					
					СуммаБезНДС = СуммаБезНДС + СтрокаАвансаПоОтбору.СуммаБезНДС;
					СуммаНДС = СуммаНДС + СтрокаАвансаПоОтбору.НДС;
					ВалютнаяСуммаСНДС = ВалютнаяСуммаСНДС + СтрокаАвансаПоОтбору.ВалютнаяСуммаСНДС
				КонецЦикла; 
				
				Если ВалютаАванса = ДополнительныеСвойства.ВалютаБухУчета Тогда
					Если СуммаБезНДС+СуммаНДС = 0 тогда Продолжить; КонецЕсли; 
					// Сопоставление по рублевой сумме
					ВалютнаяСуммаСНДС = Окр(ВалютнаяСуммаСНДС*Мин(СтрокаПогашенияАванса.Сумма, (СуммаБезНДС+СуммаНДС))/(СуммаБезНДС+СуммаНДС), 2);
					СуммаСНДС = Мин(СтрокаПогашенияАванса.Сумма, (СуммаБезНДС+СуммаНДС));
					Если СуммаСНДС = 0 Тогда Продолжить; КонецЕсли;
				Иначе
					Если ВалютнаяСуммаСНДС = 0 Тогда Продолжить; КонецЕсли; 
					// Сопоставление по валютной сумме
					СуммаСНДС = Окр((СуммаБезНДС+СуммаНДС)*Мин(СтрокаПогашенияАванса.ВалютнаяСумма, ВалютнаяСуммаСНДС)/ВалютнаяСуммаСНДС,2);
					ВалютнаяСуммаСНДС = Мин(СтрокаПогашенияАванса.ВалютнаяСумма, ВалютнаяСуммаСНДС);
					Если ВалютнаяСуммаСНДС = 0 Тогда Продолжить; КонецЕсли; 
				КонецЕсли; 
				
				СуммаБезНДС = Окр(СуммаБезНДС * СуммаСНДС/(СуммаБезНДС+СуммаНДС),2);
				СуммаНДС = СуммаСНДС - СуммаБезНДС;
				
				Если СуммаБезНДС>0 Тогда
					МассивСуммаБезНДС = ОбщегоНазначения.РаспределитьПропорционально_2(СуммаБезНДС,МассивСуммаБезНДС);
				КонецЕсли;
				
				Если СуммаНДС>0 Тогда
					МассивСуммаНДС = ОбщегоНазначения.РаспределитьПропорционально_2(СуммаНДС,МассивСуммаНДС);
				КонецЕсли; 
				
				Если ВалютнаяСуммаСНДС >0 Тогда
					МассивВалютнаяСуммаСНДС = ОбщегоНазначения.РаспределитьПропорционально_2(ВалютнаяСуммаСНДС,МассивВалютнаяСуммаСНДС);
				КонецЕсли; 
				
				Счетчик =0;
				Для каждого СтрокаАвансаПоОтбору Из СтрокиАвансаПоОтбору Цикл
					Если ?(СуммаБезНДС>0,МассивСуммаБезНДС[Счетчик],0) = 0 и ?(СуммаНДС>0,МассивСуммаНДС[Счетчик],0) = 0 и ?(ВалютнаяСуммаСНДС>0,МассивВалютнаяСуммаСНДС[Счетчик],0)= 0  Тогда
						Продолжить;
					КонецЕсли; 
					
					СтрокаРезультата = ТаблицаРезультатов.Добавить();
					СтрокаРезультата.СчетФактура	= СтрокаАвансаПоОтбору.СчетФактура;
					СтрокаРезультата.Покупатель		= СтрокаАвансаПоОтбору.Покупатель;
					СтрокаРезультата.ДоговорКонтрагента	= СтрокаАвансаПоОтбору.ДоговорКонтрагента;
				//	СтрокаРезультата.ТипДоговораКонтрагента	= СтрокаАвансаПоОтбору.ТипДоговораКонтрагента;
					СтрокаРезультата.ВалютаДокумента= СтрокаАвансаПоОтбору.ВалютаАванса;
					СтрокаРезультата.СтавкаНДС		= СтрокаАвансаПоОтбору.СтавкаНДС;
					СтрокаРезультата.ДатаСобытия	= СтрокаПогашенияАванса.Дата;
					СтрокаРезультата.СуммаБезНДС	= ?(СуммаБезНДС>0,МассивСуммаБезНДС[Счетчик],0);
					СтрокаРезультата.НДС			=  ?(СуммаНДС>0,МассивСуммаНДС[Счетчик],0);
					СтрокаРезультата.ВалютнаяСумма	=  ?(ВалютнаяСуммаСНДС>0,МассивВалютнаяСуммаСНДС[Счетчик],0);
					
					СтрокаАвансаПоОтбору.СуммаБезНДС = СтрокаАвансаПоОтбору.СуммаБезНДС - ?(СуммаБезНДС>0,МассивСуммаБезНДС[Счетчик],0);
					СтрокаАвансаПоОтбору.НДС = СтрокаАвансаПоОтбору.НДС - ?(СуммаНДС>0,МассивСуммаНДС[Счетчик],0);
					СтрокаАвансаПоОтбору.ВалютнаяСуммаСНДС = СтрокаАвансаПоОтбору.ВалютнаяСуммаСНДС - ?(ВалютнаяСуммаСНДС>0,МассивВалютнаяСуммаСНДС[Счетчик],0);

					Счетчик = Счетчик +1;
				КонецЦикла; 
			//КонецЦикла; 
		КонецЦикла;
	КонецЦикла;
	
 	КУдалениюСФ = новый массив();
	Для каждого СтрокаПоСФ Из Дерево_НДСсАвансов.Строки Цикл
		СтрокиКУдалению = Новый Массив();
		Для каждого СтрокаАванса Из СтрокаПоСФ.Строки Цикл
			Если СтрокаАванса.СуммаБезНДС = 0 и СтрокаАванса.НДС = 0  и СтрокаАванса.ВалютнаяСуммаСНДС = 0 Тогда
				продолжить;;
			КонецЕсли; 
			СтрокаРезультата=ТаблицаРезультатов.Добавить();
			СтрокаРезультата.СчетФактура	= СтрокаАванса.СчетФактура;
			СтрокаРезультата.Покупатель		= СтрокаАванса.Покупатель;
			СтрокаРезультата.ДоговорКонтрагента	= СтрокаАванса.ДоговорКонтрагента;
			СтрокаРезультата.ВалютаДокумента= СтрокаАванса.ВалютаАванса;
			СтрокаРезультата.СтавкаНДС		= СтрокаАванса.СтавкаНДС;
			СтрокаРезультата.СуммаБезНДС	= СтрокаАванса.СуммаБезНДС;
			СтрокаРезультата.НДС			= СтрокаАванса.НДС;
			СтрокаРезультата.ВалютнаяСумма	= СтрокаАванса.ВалютнаяСуммаСНДС;
		КонецЦикла; 
		
		Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			СтрокаПоСФ.Строки.Удалить(СтрокаКУдалению);
		КонецЦикла; 
		Если СтрокаПоСФ.Строки.Количество() = 0 тогда
			КУдалениюСФ.Добавить(СтрокаПоСФ);
		Иначе
			СтрокаПоСФ.СуммаБезНДС = СтрокаПоСФ.Строки.Итог("СуммаБезНДС");
			СтрокаПоСФ.НДС = СтрокаПоСФ.Строки.Итог("НДС");
			СтрокаПоСФ.ВалютнаяСуммаСНДС = СтрокаПоСФ.Строки.Итог("ВалютнаяСуммаСНДС");
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Заполнение таблиячной части "НДС включенный в стоимость"

Процедура ЗаполнитьСтроки_НДСВключенныйВСтоимость(ОтменитьПроведение = Ложь) Экспорт
	
	//Если Проведен Тогда
	//	Если ОтменитьПроведение Тогда
	//		Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//	Иначе
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	НДСВключенныйВСтоимость.Очистить();
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("СтавкаНДС", 	 Перечисления.СтавкиНДС.БезНДС);
	Запрос.УстановитьПараметр("ВидНачисления", 	Перечисления.НДСВидНачисления.РеализацияЕНВД);	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	НДСНачисленныйОстатки.Организация,
	|	НДСНачисленныйОстатки.СчетФактура,
	|	НДСНачисленныйОстатки.ВидЦенности,
	|	НДСНачисленныйОстатки.СтавкаНДС,
	|	НДСНачисленныйОстатки.Покупатель КАК Поставщик,
	|	НДСНачисленныйОстатки.ВидНачисления,
	|	НДСНачисленныйОстатки.ДоговорКонтрагента
	|ИЗ
	|	РегистрНакопления.НДСНачисленный.Остатки(&КонецПериода,	СтавкаНДС = &СтавкаНДС И Организация = &Организация И ВидНачисления=&ВидНачисления) КАК НДСНачисленныйОстатки
	|";		
	тзДанные=Запрос.Выполнить().Выгрузить();
	тзИсходные=НДСВключенныйВСтоимость.Выгрузить().СкопироватьКолонки();
	
	Для Каждого СтрокаТз ИЗ тзДанные Цикл
		Объект=СтрокаТз.СчетФактура.ПолучитьОбъект();
		НаборЗаписей=РегистрыНакопления.ПартииТоваровНаСкладах.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение=СтрокаТз.СчетФактура.Ссылка;
		НаборЗаписей.Отбор.Регистратор.Использование=Истина;
		НаборЗаписей.Прочитать();
		Для Каждого СтрокаДок ИЗ НаборЗаписей Цикл
			Если (СтрокаДок.Номенклатура.СтавкаНДС<>Перечисления.СтавкиНДС.НДС10) И (СтрокаДок.Номенклатура.СтавкаНДС<>Перечисления.СтавкиНДС.НДС18) Тогда Продолжить; КонецЕсли;
			НоваяСтрока=тзИсходные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТз);
			НоваяСтрока.СчетУчетаНДС=ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымМПЗ;
			НоваяСтрока.СтавкаНДС=СтрокаДок.Номенклатура.СтавкаНДС;
			НоваяСтрока.СуммаБезНДС=СтрокаДок.Стоимость;
			НоваяСтрока.НДС=(НоваяСтрока.СуммаБезНДС*?(СтрокаДок.Номенклатура.СтавкаНДС=Перечисления.СтавкиНДС.НДС10,10,18))/100;
		КонецЦикла;
	КонецЦикла;
	тзИсходные.Свернуть("СчетФактура,СчетУчетаНДС,ВидЦенности,СтавкаНДС,Поставщик","СуммаБезНДС,НДС");
	
	Для Каждого СтрокаТз ИЗ тзИсходные Цикл
		НоваяСтрока=НДСВключенныйВСтоимость.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТз);
		СчетФактураДокумент=УчетНДС.НайтиПодчиненныйСчетФактуру(НоваяСтрока.СчетФактура,"СчетФактураВыданный");
		Если НЕ СчетФактураДокумент=Неопределено Тогда 
			НоваяСтрока.КодВидаОперации=СчетФактураДокумент.КодВидаОперации;
		Иначе
			Если ЗначениеЗаполнено(НоваяСтрока.СчетФактура) Тогда
				Если УправлениеМетаданными.ЕстьРеквизит("КодВидаОперации", НоваяСтрока.СчетФактура.Метаданные()) Тогда
					НоваяСтрока.КодВидаОперации=НоваяСтрока.СчетФактура.КодВидаОперации;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры	

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
//
Функция ПодготовитьТаблицуПоВычетам(РезультатЗапросаПоВычетам, СтруктураШД, Отказ, Заголовок)

	ТаблицаВычетов = РезультатЗапросаПоВычетам.Выгрузить();
	
	МоментОпределенияНалоговойБазыНДСОплата = Неопределено;
	НачалоНалоговогоПериода = ?(СтруктураШД.НДСНалоговыйПериод = Перечисления.Периодичность.Месяц, НачалоМесяца(СтруктураШД.Дата), НачалоКвартала(СтруктураШД.Дата));
	КонецНалоговогоПериода = ?(СтруктураШД.НДСНалоговыйПериод = Перечисления.Периодичность.Месяц, КонецМесяца(СтруктураШД.Дата), КонецКвартала(СтруктураШД.Дата));
	Для каждого СтрокаТаблицы из ТаблицаВычетов Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаСчетаФактуры) Тогда
			СтрокаТаблицы.ДатаСчетаФактуры = СтруктураШД.Дата;
		КонецЕсли;
							
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОплаты) Тогда
			Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаДокументаОплаты) Тогда
				СтрокаТаблицы.ДатаОплаты = СтрокаТаблицы.ДатаДокументаОплаты;
			КонецЕсли;
		КонецЕсли; 
		
		Если СтруктураШД.ПредъявленНДСКВычету0 Тогда
			СтрокаТаблицы.ДатаСобытия = ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументОтгрузкиДата), СтруктураШД.Дата, СтрокаТаблицы.ДокументОтгрузкиДата);
			Если Не (СтрокаТаблицы.ДатаСобытия >= НачалоНалоговогоПериода И СтрокаТаблицы.ДатаСобытия <= КонецНалоговогоПериода) Тогда
				СтрокаТаблицы.ДатаСобытия = СтруктураШД.Дата;
			КонецЕсли;
		Иначе
			Если СтрокаТаблицы.ДатаСчетаФактуры >= НачалоНалоговогоПериода И СтрокаТаблицы.ДатаСчетаФактуры <= КонецНалоговогоПериода Тогда
				СтрокаТаблицы.ДатаСобытия = СтрокаТаблицы.ДатаСчетаФактуры;
			Иначе
				СтрокаТаблицы.ДатаСобытия = СтруктураШД.Дата;
			КонецЕсли;
		КонецЕсли; 
		
		Если СтрокаТаблицы.ВидЦенности = Перечисления.ВидыЦенностей.СМРСобственнымиСилами Тогда
			// Контрагент по данным виждам ценностей не указывается
			СтрокаТаблицы.Поставщик = Неопределено;
		КонецЕсли; 
		
		Если Не СтрокаТаблицы.ЗаписьДополнительногоЛиста Тогда
			СтрокаТаблицы.КорректируемыйПериод = '00010101000000';
		КонецЕсли;
		
	КонецЦикла; 
	
	ТаблицаВычетов.Колонки.Добавить("Событие");
	ТаблицаВычетов.ЗаполнитьЗначения( ?(СтруктураШД.ПредъявленНДСКВычету0, Перечисления.СобытияПоНДСПокупки.ПредъявленНДСКВычету0, Перечисления.СобытияПоНДСПокупки.ПредъявленНДСКВычету),"Событие");
	
	Возврат ТаблицаВычетов;

КонецФункции

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
//
Функция ПодготовитьТаблицуПоАвансам(РезультатЗапросаПоАвансам, СтруктураШД)
	
	ТаблицаПоАвансам=РезультатЗапросаПоАвансам.Выгрузить();	
	ТаблицаПоАвансам.Колонки.Добавить("Событие");
	ТаблицаПоАвансам.ЗаполнитьЗначения( ?(СтруктураШД.ПредъявленНДСКВычету0, Перечисления.СобытияПоНДСПокупки.ПредъявленНДСКВычету0, Перечисления.СобытияПоНДСПокупки.ПредъявленНДСКВычету),"Событие");

	ТаблицаПоАвансам.Колонки.Добавить("ВидЦенности", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЦенностей"));
	ТаблицаПоАвансам.ЗаполнитьЗначения(Перечисления.ВидыЦенностей.АвансыПолученные,"ВидЦенности");
	
	Для каждого СтрокаТаблицы из ТаблицаПоАвансам Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОплаты) Тогда
			СтрокаТаблицы.ДатаОплаты = СтруктураШД.Дата;
		КонецЕсли; 
		Если Не СтрокаТаблицы.ЗаписьДополнительногоЛиста Тогда
			СтрокаТаблицы.КорректируемыйПериод = '00010101000000';
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ТаблицаПоАвансам;
	
КонецФункции

Функция ПодготовитьТаблицуПоАвансамВыданным(РезультатЗапросаПоАвансамВыданным, СтруктураШД)
	
	ТаблицаПоАвансам=РезультатЗапросаПоАвансамВыданным.Выгрузить();
	
	ТаблицаПоАвансам.Колонки.Добавить("ВидЦенности", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЦенностей"));
	ТаблицаПоАвансам.ЗаполнитьЗначения(Перечисления.ВидыЦенностей.АвансыВыданные,"ВидЦенности");
	
	ТаблицаПоАвансам.Колонки.Добавить("Событие");
	ТаблицаПоАвансам.ЗаполнитьЗначения(Перечисления.СобытияПоНДСПокупки.ПредъявленНДСКВычету,"Событие");

	Возврат ТаблицаПоАвансам;
	
КонецФункции

// Проверяет правильность заполнения строк табличной части.
//
//
Процедура ПроверитьЗаполнениеТабличнойЧастиПоВычетам(СтруктураШД,ТаблицаПоВычетам, Отказ, Заголовок)

	//Проверка полей без прекращения проведения
	СтрокаСообщения = "Не заполнены документ оплаты и дата оплаты. В книге покупок по данной записи в качестве даты оплаты будет установлена дата текущего документа!";
	СтрокаСообщенияДокОтгрузки = "Не заполнен документ отгрузки при реализации товара по ставке НДС 0%!";
	СтрокаСообщенияПоставщик = "Не заполнено значение реквизита ""Поставщик""!";
	СтрокаСообщенияКорПериод = "Не заполнено значение реквизита ""Корректируемый период""!";
	
	Для каждого СтрокаТаблицы из ТаблицаПоВычетам Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументОплаты) и НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаСобытия) Тогда
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) + """ табличной части ""Вычет по приобретенным ценностям"" : ";
			Сообщить(СтрокаНачалаСообщенияОбОшибке+СтрокаСообщения);
		КонецЕсли;
		Если СтруктураШД.ПредъявленНДСКВычету0 и НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументОтгрузки) Тогда
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) + """ табличной части ""Вычет по приобретенным ценностям"" : ";
			Сообщить(СтрокаНачалаСообщенияОбОшибке+СтрокаСообщенияДокОтгрузки);
		КонецЕсли;
		// Проверка на заполнение контрагента
		Если не СтрокаТаблицы.ВидЦенности = Перечисления.ВидыЦенностей.СМРСобственнымиСилами и НЕ ЗначениеЗаполнено(СтрокаТаблицы.Поставщик) Тогда
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) + """ табличной части ""Вычет по приобретенным ценностям"" : ";
			Сообщить(СтрокаНачалаСообщенияОбОшибке+СтрокаСообщенияПоставщик);
		КонецЕсли; 
		Если СтрокаТаблицы.ЗаписьДополнительногоЛиста и НЕ ЗначениеЗаполнено(СтрокаТаблицы.КорректируемыйПериод) Тогда
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) + """ табличной части ""Вычет по приобретенным ценностям"" : ";
			Сообщить(СтрокаНачалаСообщенияОбОшибке+СтрокаСообщенияКорПериод);
		КонецЕсли;
		
		Если СтрокаТаблицы.НДС<>0 И НЕ ЗначениеЗаполнено(СтрокаТаблицы.СчетУчетаНДС) Тогда
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) + """ табличной части ""Не заполнен счет учета НДС"" : ";
			Сообщить(СтрокаНачалаСообщенияОбОшибке+СтрокаСообщенияКорПериод);
		КонецЕсли;
		
	КонецЦикла; 

КонецПроцедуры

// Проверяет правильность заполнения строк табличной части.
//
//
Процедура ПроверитьЗаполнениеТабличнойЧастиПоАвансам(СтруктураШД, ТаблицаПоАвансам, Отказ, Заголовок)
	//Проверка полей без прекращения проведения
	СтрокаСообщенияДокОтгрузки = "Не заполнен документ отгрузки при реализации товара по ставке НДС 0%!";
 	СтрокаСообщения = "Не заполнена дата зачета аванса. В качестве даты зачета аванса будет использоваться дата текущего документа!";
	СтрокаСообщенияКорПериод = "Не заполнено значение реквизита ""Корректируемый период""!";

	Для каждого СтрокаТаблицы из ТаблицаПоАвансам Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаСобытия) Тогда
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) + """ табличной части ""Вычет НДС с авансов"": ";
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке+СтрокаСообщения,,Заголовок,СтатусСообщения.Внимание);
		КонецЕсли;
		Если СтруктураШД.ПредъявленНДСКВычету0 и НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументОтгрузки) Тогда
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) + """ табличной части ""Вычет НДС с авансов"": ";
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке+СтрокаСообщенияДокОтгрузки,,Заголовок,СтатусСообщения.Внимание);
		КонецЕсли;
		Если СтрокаТаблицы.ЗаписьДополнительногоЛиста и НЕ ЗначениеЗаполнено(СтрокаТаблицы.КорректируемыйПериод) Тогда
			СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) + """ табличной части ""Вычет НДС с авансов"": ";
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке+СтрокаСообщенияКорПериод,,Заголовок,СтатусСообщения.Внимание);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(СтруктураШД, ТаблицаПоВычетам, ТаблицапоАвансам,ТаблицаПоНДСВключенныйВСтоимость,ТаблицаПоАвансамВыданным, Отказ, Заголовок)
	Если Отказ Тогда Возврат; КонецЕсли;

	ДвиженияПоВычетамНДСпоПриобретеннымЦенностям(СтруктураШД, ТаблицаПоВычетам, Отказ, Заголовок);
	ДвиженияПоВычетамНДСсАвансов(СтруктураШД, ТаблицаПоАвансам, Отказ, Заголовок);
	ДвиженияПоВычетамНДСсАвансовВыданных(СтруктураШД, ТаблицаПоАвансамВыданным, Отказ, Заголовок);
	ДвиженияПоНДСВключенныйВСтоимость(СтруктураШД, ТаблицаПоНДСВключенныйВСтоимость, Отказ, Заголовок);
КонецПроцедуры

// По результату запроса по шапке документа формируем движения по регистрам.
// Отрабатывает по табличной части "Вычет НДС по приобретенным ценностям"
//
Процедура ДвиженияПоВычетамНДСпоПриобретеннымЦенностям(СтруктураШД, ТаблицаПоВычетам, Отказ, Заголовок)
	Если ТаблицаПоВычетам.КОличество()=0 Тогда Возврат; КонецЕсли; 
	
	Если мВестиУчетНДС Тогда
	// Отражение по регистру "НДС предъявленный"
		ТаблицаДвижений_НДСПредъявленный = Движения.НДСПредъявленный.ВыгрузитьКолонки();
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоВычетам,ТаблицаДвижений_НДСПредъявленный);
		ТаблицаДвижений_НДСПредъявленный.Свернуть("Период,Активность,Организация,СчетФактура,ВидЦенности,СтавкаНДС,СчетУчетаНДС,Поставщик,ДатаСобытия,Событие","СуммаБезНДС,НДС");
		
		Движения.НДСПредъявленный.мПериод = СтруктураШД.Дата;
		Движения.НДСПредъявленный.мТаблицаДвижений = ТаблицаДвижений_НДСПредъявленный;
		Движения.НДСПредъявленный.ВыполнитьРасход();
	КонецЕсли;
	
	// Отражение по регистру НДСЗаписиКнигиПокупок
	ТаблицаДвижений_НДСЗаписиКнигиПокупок = Движения.НДСЗаписиКнигиПокупок.ВыгрузитьКолонки();
	
	Если СтруктураШД.ПредъявленНДСКВычету0 Тогда
		ТаблицаДвижений_НДСЗаписиКнигиПокупок.Колонки.Добавить("ДокументОтгрузкиДата",ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
		ТаблицаДвижений_НДСЗаписиКнигиПокупок.Колонки.Добавить("Состояние",Новый ОписаниеТипов("ПеречислениеСсылка.НДССостоянияРеализация0"));
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоВычетам,ТаблицаДвижений_НДСЗаписиКнигиПокупок);
		
		
		Для каждого СтрокаЗаписи Из ТаблицаДвижений_НДСЗаписиКнигиПокупок Цикл
			Если СтрокаЗаписи.Состояние = Перечисления.НДССостоянияРеализация0.НеПодтвержденаРеализация0 тогда
				Если СтрокаЗаписи.ЗаписьДополнительногоЛиста = Ложь Тогда
					СтрокаЗаписи.Период = Макс(СтрокаЗаписи.ДатаОплаты, СтрокаЗаписи.ДокументОтгрузкиДата);
				Иначе
					СтрокаЗаписи.Период = СтруктураШД.Дата;
				КонецЕсли; 
				СтрокаЗаписи.Событие = Перечисления.СобытияПоНДСПокупки.НеПодтвержденаСтавка0;
				
			КонецЕсли;
		КонецЦикла; 
		ТаблицаДвижений_НДСЗаписиКнигиПокупок.Колонки.Удалить(ТаблицаДвижений_НДСЗаписиКнигиПокупок.Колонки.ДокументОтгрузкиДата);
		ТаблицаДвижений_НДСЗаписиКнигиПокупок.Колонки.Удалить(ТаблицаДвижений_НДСЗаписиКнигиПокупок.Колонки.Состояние);
		
		Если мВестиУчетНДС Тогда
			// Отражение по регистру НДСПредъявленныйРеализация0
			ТаблицаДвижений_НДСПредъявленныйРеализация0 = Движения.НДСПредъявленныйРеализация0.ВыгрузитьКолонки();
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоВычетам,ТаблицаДвижений_НДСПредъявленныйРеализация0);
			
			Движения.НДСПредъявленныйРеализация0.мПериод 		 = СтруктураШД.Дата;
			Движения.НДСПредъявленныйРеализация0.мТаблицаДвижений = ТаблицаДвижений_НДСПредъявленныйРеализация0;
			Движения.НДСПредъявленныйРеализация0.ВыполнитьРасход(Ложь);
		КонецЕсли;
		
	Иначе
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоВычетам,ТаблицаДвижений_НДСЗаписиКнигиПокупок);
	КонецЕсли; 
	
	ТаблицаДвижений_НДСЗаписиКнигиПокупок.Свернуть("Период,Активность,Организация,СчетФактура,ДокументОплаты, ДатаОплаты,СтавкаНДС,СчетУчетаНДС,Поставщик,ЗаписьДополнительногоЛиста,КорректируемыйПериод,ДатаСобытия,Событие,ВидЦенности,КодВидаОперации","СуммаБезНДС,НДС");
		
	Движения.НДСЗаписиКнигиПокупок.мПериод 			= СтруктураШД.Дата;
	Движения.НДСЗаписиКнигиПокупок.мТаблицаДвижений = ТаблицаДвижений_НДСЗаписиКнигиПокупок;
	Движения.НДСЗаписиКнигиПокупок.ДобавитьДвижение(Ложь);
	                                                                                                                                                                                        
	// Сформировать проводи по записям книги покупок
	Для каждого ТекСтрокаВычета Из ТаблицаПоВычетам Цикл
		Если ТекСтрокаВычета.НДС = 0 Тогда ПродолжитЬ; КонецЕсли; 
		                                                                                                                                                                                               
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.Период = СтруктураШД.Дата;
		Движение.Организация =  СтруктураШД.Организация;
		Движение.Сумма = ТекСтрокаВычета.НДС;
		Движение.Содержание = "НДС";
		
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.НДС; //68.02
		БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, "ВидыПлатежейВГосБюджет", Перечисления.ВидыПлатежейВГосБюджет.Налог);
		
		//Если ПредъявленНДСКВычету0 Тогда // подстраховка для ручного ввода
		//	Движение.СчетКт = ПланыСчетов.Хозрасчетный.НДСПоТоварамРеализованнымПоСтавке0; //19.07
		//Иначе
			Движение.СчетКт = ТекСтрокаВычета.СчетУчетаНДС; //19.чч
		//КонецЕсли;
		
		Если Движение.СчетДт.НалоговыйУчет Тогда
			Движение.СуммаНУДт=Движение.Сумма;
		КонецЕсли;
		Если Движение.СчетКт.НалоговыйУчет Тогда
			Движение.СуммаНУКт=Движение.Сумма;
		КонецЕсли;

		БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "Контрагенты", ТекСтрокаВычета.Поставщик);
		БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "СФПолученные", ТекСтрокаВычета.СчетФактура);

		Если ТипЗнч(ТекСтрокаВычета.СчетФактура)=Тип("ДокументСсылка.СчетФактураПолученный") Тогда
			Если ТекСтрокаВычета.СчетФактура.ВидСчетаФактуры=Перечисления.НДСВидСчетаФактуры.Лизинг Тогда
				БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "СФПолученные", ТекСтрокаВычета.СчетФактура.ДокументыОснования[0].ДокументОснование);
			КонецЕсли;	
		КонецЕсли;	
		
		Если ПредъявленНДСКВычету0 Тогда // Дополнительное субконто по 19.07
			БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "ДокументыРеализации", ТекСтрокаВычета.ДокументОтгрузки);
		КонецЕсли;

	КонецЦикла; 

КонецПроцедуры
 
// По результату запроса по шапке документа формируем движения по регистрам.
// Отрабатывает по табличной части "Вычет НДС по приобретенным ценностям"
//
Процедура ДвиженияПоВычетамНДСсАвансов(СтруктураШД, ТаблицаПоАвансам, Отказ, Заголовок)
	Если ТаблицаПоАвансам.КОличество()=0 Тогда Возврат; КонецЕсли; 
	
	Если мВестиУчетНДС Тогда
		// Отражение по регистру "НДС предъявленный"
		ТаблицаДвижений_НДСсАвансов = Движения.НДСсАвансов.ВыгрузитьКолонки();
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоАвансам,ТаблицаДвижений_НДСсАвансов);
		ТаблицаДвижений_НДСсАвансов.Свернуть("Период,Активность,Организация,СчетФактура,Покупатель, ДоговорКонтрагента,СтавкаНДС,ВалютаАванса,ДатаСобытия","СуммаБезНДС,НДС,ВалютнаяСуммаСНДС");
		
		Движения.НДСсАвансов.мПериод = 			СтруктураШД.Дата;
		Движения.НДСсАвансов.мТаблицаДвижений = ТаблицаДвижений_НДСсАвансов;
		Движения.НДСсАвансов.ВыполнитьРасход();
	КонецЕсли;
		
	// Отражение по регистру НДСЗаписиКнигиПокупок
	ТаблицаДвижений_НДСЗаписиКнигиПокупок = Движения.НДСЗаписиКнигиПокупок.ВыгрузитьКолонки();
	
	Если СтруктураШД.ПредъявленНДСКВычету0 Тогда
		ТаблицаДвижений_НДСЗаписиКнигиПокупок.Колонки.Добавить("ДокументОтгрузкиДата",ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
		ТаблицаДвижений_НДСЗаписиКнигиПокупок.Колонки.Добавить("Состояние",Новый ОписаниеТипов("ПеречислениеСсылка.НДССостоянияРеализация0"));
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоАвансам,ТаблицаДвижений_НДСЗаписиКнигиПокупок);
		
		
		Для каждого СтрокаЗаписи Из ТаблицаДвижений_НДСЗаписиКнигиПокупок Цикл
			Если СтрокаЗаписи.Состояние = Перечисления.НДССостоянияРеализация0.НеПодтвержденаРеализация0 тогда
				Если Не СтрокаЗаписи.ЗаписьДополнительногоЛиста Тогда
					СтрокаЗаписи.Период = Макс(СтрокаЗаписи.ДатаОплаты, СтрокаЗаписи.ДокументОтгрузкиДата);
				Иначе
					СтрокаЗаписи.Период = СтруктураШД.Дата;
				КонецЕсли;
				СтрокаЗаписи.Событие = Перечисления.СобытияПоНДСПокупки.НеПодтвержденаСтавка0;
			КонецЕсли;
		КонецЦикла; 
		ТаблицаДвижений_НДСЗаписиКнигиПокупок.Колонки.Удалить(ТаблицаДвижений_НДСЗаписиКнигиПокупок.Колонки.ДокументОтгрузкиДата);
		ТаблицаДвижений_НДСЗаписиКнигиПокупок.Колонки.Удалить(ТаблицаДвижений_НДСЗаписиКнигиПокупок.Колонки.Состояние);
		
		Если мВестиУчетНДС Тогда
			// Отражение по регистру НДСсАвансовРеализация0
			ТаблицаДвижений_НДСПредъявленныйРеализация0 = Движения.НДСПредъявленныйРеализация0.ВыгрузитьКолонки();
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоАвансам,ТаблицаДвижений_НДСПредъявленныйРеализация0);
			
			Движения.НДСПредъявленныйРеализация0.мПериод 		 = СтруктураШД.Дата;
			Движения.НДСПредъявленныйРеализация0.мТаблицаДвижений = ТаблицаДвижений_НДСПредъявленныйРеализация0;
			Движения.НДСПредъявленныйРеализация0.ВыполнитьРасход(Ложь);
		КонецЕсли;
		
	Иначе
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоАвансам,ТаблицаДвижений_НДСЗаписиКнигиПокупок);
	КонецЕсли; 
	
	ТаблицаДвижений_НДСЗаписиКнигиПокупок.Свернуть("Период,Активность,Организация,СчетФактура,ДокументОплаты, ДатаОплаты,СтавкаНДС,СчетУчетаНДС,Поставщик,ДатаСобытия,Событие,ВидЦенности,ЗаписьДополнительногоЛиста,КорректируемыйПериод,ДоговорКонтрагента,КодВидаОперации","СуммаБезНДС,НДС");
	Для Каждого СтрокаТз ИЗ ТаблицаДвижений_НДСЗаписиКнигиПокупок Цикл
		СтрокаТз.ДокументОплаты=СтрокаТз.СчетФактура;
	КонецЦикла;	
	Движения.НДСЗаписиКнигиПокупок.мПериод 			= СтруктураШД.Дата;
	Движения.НДСЗаписиКнигиПокупок.мТаблицаДвижений = ТаблицаДвижений_НДСЗаписиКнигиПокупок;
	Движения.НДСЗаписиКнигиПокупок.ДобавитьДвижение(Ложь);
	
	// Сформировать проводки по записям книги покупок
	Для каждого ТекСтрокаВычета Из ТаблицаПоАвансам Цикл
		Если ТекСтрокаВычета.НДС = 0 Тогда 	ПродолжитЬ; КонецЕсли; 
		
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.Период = СтруктураШД.Дата;
		Движение.Организация =  СтруктураШД.Организация;
		Движение.Сумма = ТекСтрокаВычета.НДС;
		Движение.Содержание="Вычет НДС по предоплате";
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.НДС; //68.02
		БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, "ВидыПлатежейВГосБюджет", Перечисления.ВидыПлатежейВГосБюджет.Налог);
		ВидДоговора = ТекСтрокаВычета.ДоговорКонтрагента.ВидДоговора;
		Если ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным; //76.АВ
			БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "Контрагенты", ТекСтрокаВычета.Покупатель);
			БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "СФПолученные", ТекСтрокаВычета.СчетФактура);
		Иначе
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.НДСпоАвансамИПредоплатам; //76.АВ
			БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "Контрагенты", ТекСтрокаВычета.Покупатель);
			БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "СФВыданные", ТекСтрокаВычета.СчетФактура);
		КонецЕсли;
		
		Если Движение.СчетДт.НалоговыйУчет Тогда
			Движение.СуммаНУДт=Движение.Сумма;
		КонецЕсли;
		Если Движение.СчетКт.НалоговыйУчет Тогда
			Движение.СуммаНУКт=Движение.Сумма;
		КонецЕсли;

		Если НачалоДня(Дата)>Дата("20100701") Тогда
			// Сумма зачета
			Если ВидДоговора=Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда Продолжить; КонецЕсли;
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.Период = СтруктураШД.Дата;
			Движение.Организация =  СтруктураШД.Организация;
			Движение.Сумма=ТекСтрокаВычета.СуммаБезНДС+ТекСтрокаВычета.НДС;
			Движение.Содержание = "Зачет сумм по предоплате";
			Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным; //62.02
			БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, "Контрагенты", ТекСтрокаВычета.Покупатель);
			БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, "Договоры", ТекСтрокаВычета.ДоговорКонтрагента);
			ВидДоговора = ТекСтрокаВычета.ДоговорКонтрагента.ВидДоговора;
			Движение.СчетКт = ТекСтрокаВычета.СчетПокупателя; //62.01
			
			Если Движение.СчетДт.НалоговыйУчет Тогда
				Движение.СуммаНУДт=Движение.Сумма;
			КонецЕсли;
			Если Движение.СчетКт.НалоговыйУчет Тогда
				Движение.СуммаНУКт=Движение.Сумма;
			КонецЕсли;

			БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "Контрагенты", ТекСтрокаВычета.Покупатель);
			БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "Договоры", ТекСтрокаВычета.ДоговорКонтрагента);
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры

Процедура ДвиженияПоВычетамНДСсАвансовВыданных(СтруктураШД, ТаблицаПоАвансам, Отказ, Заголовок)
	Если ТаблицаПоАвансам.КОличество()=0 Тогда Возврат; КонецЕсли; 
	
	// Отражение по регистру НДСПредъявленный
	ТаблицаДвижений_НДСПредъявленный = Движения.НДСПредъявленный.ВыгрузитьКолонки();
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоАвансам, ТаблицаДвижений_НДСПредъявленный);
	ТаблицаДвижений_НДСПредъявленный.Свернуть("Период, Активность, Организация, СчетФактура, ВидЦенности, СтавкаНДС, Поставщик, ДоговорКонтрагента, ДатаСобытия, Событие", "СуммаБезНДС, НДС");
		
	Движения.НДСПредъявленный.мПериод = СтруктураШД.Дата;
	Движения.НДСПредъявленный.мТаблицаДвижений = ТаблицаДвижений_НДСПредъявленный;
	Движения.НДСПредъявленный.ВыполнитьРасход();
	
	// Отражение по регистру НДСЗаписиКнигиПокупок
	ТаблицаДвижений_НДСЗаписиКнигиПокупок = Движения.НДСЗаписиКнигиПокупок.ВыгрузитьКолонки();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоАвансам,ТаблицаДвижений_НДСЗаписиКнигиПокупок);
	ТаблицаДвижений_НДСЗаписиКнигиПокупок.Свернуть("Период,Активность,Организация,СчетФактура,СтавкаНДС,Поставщик,Событие,ВидЦенности,ЗаписьДополнительногоЛиста,КорректируемыйПериод,ДоговорКонтрагента, ДатаОплаты, ДокументОплаты,КодВидаОперации","СуммаБезНДС,НДС");
		
	Движения.НДСЗаписиКнигиПокупок.мПериод 			= СтруктураШД.Дата;
	Движения.НДСЗаписиКнигиПокупок.мТаблицаДвижений = ТаблицаДвижений_НДСЗаписиКнигиПокупок;
	Движения.НДСЗаписиКнигиПокупок.ДобавитьДвижение(Ложь);
	
КонецПроцедуры

Процедура ДвиженияПоНДСВключенныйВСтоимость(СтруктураШД, ТаблицаПоНДСВключенныйВСтоимость, Отказ, Заголовок)
	Если ТаблицаПоНДСВключенныйВСтоимость.КОличество()=0 Тогда Возврат; КонецЕсли; 
	
	ТаблицаДвижений_НДСНачисленный = Движения.НДСНачисленный.ВыгрузитьКолонки();
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоНДСВключенныйВСтоимость,ТаблицаДвижений_НДСНачисленный);
	ТаблицаДвижений_НДСНачисленный.ЗаполнитьЗначения(Перечисления.СтавкиНДС.БезНДС,"СтавкаНДС");
	
	Движения.НДСНачисленный.мПериод = СтруктураШД.Дата;
	Движения.НДСНачисленный.мТаблицаДвижений = ТаблицаДвижений_НДСНачисленный;
	Движения.НДСНачисленный.ВыполнитьРасход();

	ТаблицаДвижений_НДСЗаписиКнигиПокупок = Движения.НДСЗаписиКнигиПокупок.ВыгрузитьКолонки();
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоНДСВключенныйВСтоимость,ТаблицаДвижений_НДСЗаписиКнигиПокупок);
	ТаблицаДвижений_НДСЗаписиКнигиПокупок.Свернуть("Период,Активность,Организация,СчетФактура,ДокументОплаты, ДатаОплаты,СтавкаНДС,СчетУчетаНДС,Поставщик,ДатаСобытия,Событие,ВидЦенности,ЗаписьДополнительногоЛиста,КорректируемыйПериод,ДоговорКонтрагента,КодВидаОперации","СуммаБезНДС,НДС");
	Для КАждого СтрокаКниги ИЗ ТаблицаДвижений_НДСЗаписиКнигиПокупок Цикл
		СтрокаКниги.СуммаБезНДС=-СтрокаКниги.СуммаБезНДС;
		СтрокаКниги.НДС=-СтрокаКниги.НДС;
	КонецЦикла;	
	
	Движения.НДСЗаписиКнигиПокупок.мПериод 			= СтруктураШД.Дата;
	Движения.НДСЗаписиКнигиПокупок.мТаблицаДвижений = ТаблицаДвижений_НДСЗаписиКнигиПокупок;
	Движения.НДСЗаписиКнигиПокупок.ДобавитьДвижение(Ложь);

	
	// Сформировать проводи по записям книги покупок
	Для каждого ТекСтрокаВычета Из ТаблицаПоНДСВключенныйВСтоимость Цикл
		Если ТекСтрокаВычета.НДС = 0 Тогда ПродолжитЬ; КонецЕсли; 
		                                                                                                                                                                                               
		
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.Период = СтруктураШД.Дата;
		Движение.Организация =  СтруктураШД.Организация;
		Движение.Сумма = -ТекСтрокаВычета.НДС;
		Движение.Содержание = "НДС";
		
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.НДС; //68.02
		БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, "ВидыПлатежейВГосБюджет", Перечисления.ВидыПлатежейВГосБюджет.Налог);
		
		Движение.СчетКт = ТекСтрокаВычета.СчетУчетаНДС; //19.чч
		Если Движение.СчетДт.НалоговыйУчет Тогда
			Движение.СуммаНУДт=Движение.Сумма;
		КонецЕсли;
		Если Движение.СчетКт.НалоговыйУчет Тогда
			Движение.СуммаНУКт=Движение.Сумма;
		КонецЕсли;

		БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "Контрагенты", ТекСтрокаВычета.Поставщик);
		БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "СФПолученные", ТекСтрокаВычета.СчетФактура);

		Движение = Движения.Хозрасчетный.Добавить();
		Движение.Период = СтруктураШД.Дата;
		Движение.Организация =  СтруктураШД.Организация;
		Движение.Сумма = ТекСтрокаВычета.НДС;
		Движение.Содержание = "НДС";
		
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.СебестоимостьПродажЕНВД; //90.02.2
		БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, "НоменклатурныеГруппы", НоменклатурнаяГруппа);
		
		Движение.СчетКт = ТекСтрокаВычета.СчетУчетаНДС; //19.чч
		Если Движение.СчетДт.НалоговыйУчет Тогда
			Движение.СуммаНУДт=Движение.Сумма;
		КонецЕсли;
		Если Движение.СчетКт.НалоговыйУчет Тогда
			Движение.СуммаНУКт=Движение.Сумма;
		КонецЕсли;

		БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "Контрагенты", ТекСтрокаВычета.Поставщик);
		БухгалтерскийУчет.УстановитьСубконтоПоСчету(Движение.СчетКт, Движение.СубконтоКт, "СФПолученные", ТекСтрокаВычета.СчетФактура);
		
	КонецЦикла; 

КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УправлениеДокументамиСервер.ПередПроведением(Отказ, РежимПроведения, ЭтотОбъект);
	Если Отказ Тогда Возврат; КонецЕсли; 

	Заголовок=ДополнительныеСвойства.Заголовок;
	СтруктураШД=ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураШД.Вставить("НДСНалоговыйПериод", СтруктураШД.УчетнаяПолитика.НДСНалоговыйПериод);

	СтруктураПолей=Новый Структура;
	СтруктураПолей.Вставить("Организация",					"Ссылка.Организация");
	СтруктураПолей.Вставить("ВидЦенности",					"ВидЦенности");
	СтруктураПолей.Вставить("Поставщик",					"Поставщик");
	СтруктураПолей.Вставить("СчетФактура",					"СчетФактура");
	СтруктураПолей.Вставить("ДатаСчетаФактуры",				"СчетФактура.Дата");
	СтруктураПолей.Вставить("ДокументОплаты",				"ДокументОплаты");
	СтруктураПолей.Вставить("ДатаОплаты",					"ДатаОплаты");
	СтруктураПолей.Вставить("ДатаДокументаОплаты",			"ДокументОплаты.Дата");
	СтруктураПолей.Вставить("ДатаСобытия",					"ДатаОплаты");
	СтруктураПолей.Вставить("СтавкаНДС",					"СтавкаНДС");
	СтруктураПолей.Вставить("СуммаБезНДС",					"СуммаБезНДС");
	СтруктураПолей.Вставить("НДС",							"НДС");
	СтруктураПолей.Вставить("СчетУчетаНДС",					"СчетУчетаНДС");
	СтруктураПолей.Вставить("ЗаписьДополнительногоЛиста",	"ЗаписьДополнительногоЛиста");
	СтруктураПолей.Вставить("КорректируемыйПериод",			"КорректируемыйПериод");
	СтруктураПолей.Вставить("КодВидаОперации",	"КодВидаОперации");
	Если СтруктураШД.ПредъявленНДСКВычету0 Тогда
		СтруктураПолей.Вставить("ДокументОтгрузки",	"ДокументОтгрузки");
		СтруктураПолей.Вставить("ДокументОтгрузкиДата",	"ДокументОтгрузки.Дата");
		СтруктураПолей.Вставить("Состояние",	"Состояние");
	КонецЕсли; 
	РезультатЗапросаПоВычетам = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ВычетПоПриобретеннымЦенностям", СтруктураПолей);
	ТаблицаПоВычетам=ПодготовитьТаблицуПоВычетам(РезультатЗапросаПоВычетам,СтруктураШД, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиПоВычетам(СтруктураШД,ТаблицаПоВычетам, Отказ, Заголовок);
	
	СтруктураПолей=Новый Структура;
	СтруктураПолей.Вставить("Организация",		 "Ссылка.Организация");
	СтруктураПолей.Вставить("Покупатель",		 "Покупатель");
	СтруктураПолей.Вставить("Поставщик",		 "Покупатель");
	СтруктураПолей.Вставить("ДоговорКонтрагента","ДоговорКонтрагента");
	СтруктураПолей.Вставить("СчетФактура",	 	 "СчетФактура");
	СтруктураПолей.Вставить("СтавкаНДС",		 "СтавкаНДС");
	СтруктураПолей.Вставить("СуммаБезНДС",		 "СуммаБезНДС");
	СтруктураПолей.Вставить("НДС",				 "НДС");
	СтруктураПолей.Вставить("ВалютнаяСуммаСНДС", "ВалютнаяСумма");
	СтруктураПолей.Вставить("ВалютаАванса",	 	 "ВалютаДокумента");
	СтруктураПолей.Вставить("ДатаСобытия",	 	 "ДатаСобытия");
	СтруктураПолей.Вставить("ДатаОплаты",		 "ДатаСобытия");
	СтруктураПолей.Вставить("СчетПокупателя",	 "СчетПокупателя");
	СтруктураПолей.Вставить("ЗаписьДополнительногоЛиста",	"ЗаписьДополнительногоЛиста");
	СтруктураПолей.Вставить("КорректируемыйПериод",			"КорректируемыйПериод");
	СтруктураПолей.Вставить("КодВидаОперации",	"КодВидаОперации");
	Если СтруктураШД.ПредъявленНДСКВычету0 Тогда
		СтруктураПолей.Вставить("ДокументОтгрузки",	"ДокументОтгрузки");
		СтруктураПолей.Вставить("ДокументОплаты",	"ДокументОтгрузки");
		СтруктураПолей.Вставить("ДокументОтгрузкиДата",	"ДокументОтгрузки.Дата");
		СтруктураПолей.Вставить("Состояние",	"Состояние");
	КонецЕсли; 
	РезультатЗапросаПоАвансам = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "НДСсАвансов", СтруктураПолей);
	ТаблицаПоАвансам = 			ПодготовитьТаблицуПоАвансам(РезультатЗапросаПоАвансам, СтруктураШД);
	ПроверитьЗаполнениеТабличнойЧастиПоАвансам(СтруктураШД, ТаблицаПоАвансам, Отказ, Заголовок);
	
	СтруктураПолей=Новый Структура;
	СтруктураПолей.Вставить("Организация",		 "Ссылка.Организация");
	СтруктураПолей.Вставить("Поставщик",		 "Поставщик");
	СтруктураПолей.Вставить("ДоговорКонтрагента","ДоговорКонтрагента");
	СтруктураПолей.Вставить("СчетФактура",	 	 "СчетФактура");
	СтруктураПолей.Вставить("СтавкаНДС",		 "СтавкаНДС");
	СтруктураПолей.Вставить("СуммаБезНДС",		 "СуммаБезНДС");
	СтруктураПолей.Вставить("НДС",				 "НДС");
	СтруктураПолей.Вставить("ЗаписьДополнительногоЛиста",	"ЗаписьДополнительногоЛиста");
	СтруктураПолей.Вставить("КорректируемыйПериод",			"КорректируемыйПериод");
	СтруктураПолей.Вставить("КодВидаОперации",	"КодВидаОперации");
	РезультатЗапросаПоАвансамВыданным = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "НДСсАвансовВыданных", СтруктураПолей);
	ТаблицаПоАвансамВыданным =ПодготовитьТаблицуПоАвансамВыданным(РезультатЗапросаПоАвансамВыданным, СтруктураШД);
	ТаблицаПоАвансамВыданным.Колонки.Добавить("ДатаОплаты");
	ТаблицаПоАвансамВыданным.Колонки.Добавить("ДокументОплаты");
	Для КАждого СтрокаТз ИЗ ТаблицаПоАвансамВыданным Цикл
		СтрокаТз.ДатаОплаты=СтрокаТз.СчетФактура.Дата;
		Если ТипЗнч(СтрокаТз.СчетФактура)=Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") Тогда
			СтрокаТз.ДатаОплаты=СтрокаТз.СчетФактура.ДатаОплаты;
		КонецЕсли;	
		СтрокаТз.ДокументОплаты=СтрокаТз.СчетФактура;
	КонецЦикла;	

	СтруктураПолей=Новый Структура;
	СтруктураПолей.Вставить("Организация",					"Ссылка.Организация");
	СтруктураПолей.Вставить("ВидЦенности",					"ВидЦенности");
	СтруктураПолей.Вставить("Поставщик",					"Поставщик");
	СтруктураПолей.Вставить("СчетФактура",					"СчетФактура");
	СтруктураПолей.Вставить("СтавкаНДС",					"СтавкаНДС");
	СтруктураПолей.Вставить("СуммаБезНДС",					"СуммаБезНДС");
	СтруктураПолей.Вставить("НДС",							"НДС");
	СтруктураПолей.Вставить("СчетУчетаНДС",					"СчетУчетаНДС");
	СтруктураПолей.Вставить("ДокументОтгрузки",	"ДокументОтгрузки");
	СтруктураПолей.Вставить("КодВидаОперации",	"КодВидаОперации");
	РезультатЗапросаНДСВключенныйВСтоимость= УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "НДСВключенныйВСтоимость", СтруктураПолей);
	ТаблицаПоНДСВключенныйВСтоимость=РезультатЗапросаНДСВключенныйВСтоимость.Выгрузить();
	
	мВестиУчетНДС = Истина;

	ДвиженияПоРегистрам(СтруктураШД, ТаблицаПоВычетам,ТаблицаПоАвансам,ТаблицаПоНДСВключенныйВСтоимость,ТаблицаПоАвансамВыданным, Отказ, Заголовок);	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПредъявленНДСКВычету0 Тогда
		ПроверяемыеРеквизиты.Добавить("Состояние"); 
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Операторы основной программы

УправлениеДокументамиСервер.ИнициализацияМодуля(ДополнительныеСвойства, "Покупка");