#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	//*** СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ТребуемыеПараметры);

	//ККТ
	// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
	// следует инициализировать сразу группой. для того, чтобы избежать их повторной инициализации, 
	// имена уже установленных параметров сеанса сохраняются в структуре УстановленныеПараметры.
	Если НЕ ТребуемыеПараметры=Неопределено Тогда
		УстановленныеПараметры=Новый Массив();
		Для Каждого ИмяПараметра Из ТребуемыеПараметры Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
		Возврат;
	КонецЕсли;

	ПараметрыСеанса.ОбщиеЗначения=Новый ХранилищеЗначения(Новый Структура);
	ПараметрыСеанса.БуферОбмена=Новый ХранилищеЗначения(Новый Структура);
	ПараметрыСеанса.ОрганизацияГрупповогоПроведения=Справочники.Организации.ПустаяСсылка();

	ПолныеПрава.УстановитьПараметрыСеанса();
	
	Если НЕ ПустаяСтрока(ПараметрыСеанса.ТекущийПользователь.Стиль) Тогда
		Попытка ГлавныйСтиль=БиблиотекаСтилей[ПараметрыСеанса.ТекущийПользователь.Стиль];
		Исключение
		КонецПопытки;
	КонецЕсли;	
КонецПроцедуры

Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)
	Если НЕ УстановленныеПараметры.Найти(ИмяПараметра)=Неопределено Тогда Возврат; КонецЕсли;
	Если ОбщегоНазначенияСервер.ПроверкаРасширения("БиблиотекаПодключаемогоОборудования") Тогда
		МодульМенеджерОборудованияВызовСервера=ОбщегоНазначения.ОбщийМодуль("МенеджерОборудованияВызовСервера");
		МодульМенеджерОборудованияВызовСервера.УстановитьПараметрыСеансаПодключаемогоОборудования(ИмяПараметра, УстановленныеПараметры);
	КонецЕсли;
КонецПроцедуры

#КонецЕсли