Процедура ОбновитьПредопределенныеСервер() Экспорт
	КлассификаторXML=Справочники.Подвиды.ПолучитьМакет("Предопределенные").ПолучитьТекст();

	дзДанные=ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	Для каждого СтрокаКоллекции Из дзДанные Цикл		
		Владелец=УправлениеКонфигурациейСервер.ИдентификаторОбъектовМетаданныхСсылка("Документ_"+СтрокаКоллекции.DocName);
		СправочникСсылка=Справочники.Подвиды.НайтиПоРеквизиту("ИмяПредопределеного", СтрокаКоллекции.ID,,Владелец);
		Если СправочникСсылка.Пустая() Тогда
			СправочникСсылка=Справочники.Подвиды.СоздатьЭлемент();
			СправочникСсылка.Наименование=СтрокаКоллекции.Name;
			СправочникСсылка.ИмяПредопределеного=СтрокаКоллекции.ID;
			СправочникСсылка.Владелец=Владелец;
			СправочникСсылка.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры