&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	ЗагрузитьКлассификаторБанков();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКлассификаторБанков()
	//СтруктураПараметров=Новый Структура;
	//Если ВариантЗагрузки="Файл" Тогда
	//	СтруктураПараметров.Вставить("Файл", Путь);		
	//Иначе
	//	СтруктураПараметров.Вставить("Интернет", ВариантЗагрузки);
	//КонецЕсли; 
	//*** Обработки.ЗагрузкаКлассификатораБанков.ЗагрузитьДанныеИзФайла(СтруктураПараметров);
	Обработки.ЗагрузкаКлассификатораБанков.ЗагрузитьКлассификаторБанков(?(ВариантЗагрузки="Файл", Путь, ВариантЗагрузки));
КонецПроцедуры 

&НаКлиенте
Процедура ДоступностьВидимостьЭлементов()
	Элементы.Путь.Доступность=ВариантЗагрузки="Файл";
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики оповещений

&НаКлиенте
Процедура ОбработчикОповещения_ВыборФайла(ВыбранныйПуть, ДополнительныеПараметры) Экспорт 
	Файл=Новый Файл(ВыбранныйПуть[0]);
	Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ОбработчикОповещения_ПроверкаСуществованияФайла", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещения_ПроверкаСуществованияФайла(Существует, ДополнительныеПараметры) Экспорт 
	Если Не Существует Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru ='По указанному пути файл классификатора не обнаружен.'"),, "Путь");
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="ВариантЗагрузки" Тогда
		ДоступностьВидимостьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Атрибут_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элемент.Имя="Путь" Тогда
		Диалог=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок=НСтр("ru = 'Укажите путь к файлу классификатора'");
		Диалог.Каталог=Путь;
		Диалог.Показать(Новый ОписаниеОповещения("ОбработчикОповещения_ВыборФайла", ЭтотОбъект));
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
КонецПроцедуры

