Процедура ЗаписатьОшибку(ИмяБазы, Действие, ОтветHTTP, Сообщать=Ложь) Экспорт
	НоваяЗапись=РегистрыСведений.ОшибкиCouchDB.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период=ТекущаяДата();
	НоваяЗапись.ИмяБазы=ИмяБазы;
	НоваяЗапись.Действие=Действие;
	Если ТипЗнч(ОтветHTTP)=Тип("Строка") Тогда
		НоваяЗапись.Описание=ОтветHTTP;
	Иначе
		НоваяЗапись.Код=ОтветHTTP.КодСостояния;
		НоваяЗапись.Описание=ОтветHTTP.ПолучитьТелоКакСтроку();	
	КонецЕсли;	
	НоваяЗапись.Записать(Ложь);

	Если Сообщать Тогда		
		стрОшибка="Ошибка CouchDB:"+Действие;
		Если НЕ ТипЗнч(ОтветHTTP)=Тип("Строка") Тогда
			стрОшибка=стрОшибка+", код ошибки:"+ОтветHTTP.КодСостояния;
		КонецЕсли;
		Сообщить(стрОшибка);
	КонецЕсли;	
КонецПроцедуры

Функция ПрочитатьОтвет(Ответ) Экспорт
	ЧтениеJSON=Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(?(ТипЗнч(Ответ)=Тип("HTTPОтвет"), Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8), Ответ));
	Данные=ПрочитатьJSON(ЧтениеJSON, Истина);
	ЧтениеJSON.Закрыть();
	Возврат Данные;
КонецФункции