
// Процедура вызывается перед записью набора регистра сведений
//
Процедура ПередЗаписью(Отказ, Замещение)

	Если НЕ ОбменДанными.Загрузка Тогда

		Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Номенклатура должна быть заполнена обязательно!", Отказ);
			ИначеЕсли ЗаписьРегистра.Номенклатура.Услуга Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Номенклатура не может быть услугой!", Отказ);
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Склад) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Склад должен быть заполнена обязательно!", Отказ);
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.МестоХранения) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Место хранения должно быть заполнена обязательно!", Отказ);
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
