&НаКлиенте
Процедура СформироватьШтрихКод(Команда)
	Объект.КодКарты=УправлениеРозничнойТорговлейСервер.СформироватьШтрихКод();
КонецПроцедуры

&НаКлиенте
Процедура Атриубт_ПриИзменении(Элемент)
	Если Элемент.Имя="ВидКарты" Тогда

	ИначеЕсли Элемент.Имя="ТипКарты" Тогда
		Объект.ВладелецКарты=Элементы.ВладелецКарты.ОграничениеТипа.ПривестиЗначение(Объект.ВладелецКарты);
	КонецЕсли;	 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры
