//////////////////////////////////////////////////////
//Управление печатными формами

Процедура СтруктураПечатныхФорм(Структура) Экспорт
	Структура.Вставить("РаспределениеНДС", "Распределение НДС");
КонецПроцедуры

Функция ПолучитьДанныеДокумента(СсылкаНаОбъект, стрРеквизиты="")
	Если НЕ ПустаяСтрока(стрРеквизиты) Тогда стрРеквизиты=","+стрРеквизиты; КонецЕсли; 
	Для каждого мдРеквизит Из СсылкаНаОбъект.Метаданные().Реквизиты Цикл
		стрРеквизиты=стрРеквизиты+","+Символы.ПС+мдРеквизит.Имя;
	КонецЦикла;	

	Запрос=Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("ТекущийДокумент", СсылкаНаОбъект);
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Дата,
	|	Номер,
	|	Проведен
	|	"+стрРеквизиты+"
	|ИЗ
	|	Документ.РаспределениеНДС КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Ссылка = &ТекущийДокумент
	|";
	
	#Если НаСервере Тогда
	Запрос.Выполнить();
	#КонецЕсли
	РеквизитыШапки=Запрос.Результат.Выбрать();
	РеквизитыШапки.Следующий();

	Возврат РеквизитыШапки;
КонецФункции 	

Функция ПечатьОтчетаОРаспределенииНДСКосвенныхРасходов(СтруктураПараметров)
	СсылкаНаОбъект=СтруктураПараметров.СсылкаНаОбъект;
	ДанныеДокумента=ПолучитьДанныеДокумента(СсылкаНаОбъект);
	
	Отчет=Отчеты.РаспределениеНДСКосвенныхРасходов.Создать();
	Отчет.Организация = ДанныеДокумента.Организация;
	Отчет.ДокументРаспределения = СсылкаНаОбъект;
	Отчет.ВыручкаПоДокументам = Истина;
	Отчет.ДатаНачала = ДанныеДокумента.НачалоПериода;
	Отчет.ДатаКонца = УчетНалоговСервер.КонецПериодаПоУчетнойПолитике(ДанныеДокумента.Организация, ДанныеДокумента.НачалоПериода);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ВысотаЗаголовка = 0;
	
	Отчет.СформироватьОтчет(ТабличныйДокумент, Истина, ВысотаЗаголовка);
	
	Возврат ТабличныйДокумент;	
КонецФункции

Функция Печать(СтруктураПараметров, КоличествоЭкземпляров=1, НаПринтер=Ложь, ТабДокумент=Неопределено) Экспорт
	Если СтруктураПараметров.ИмяМакета="РаспределениеНДС" Тогда
		ТабДокумент=ПечатьОтчетаОРаспределенииНДСКосвенныхРасходов(СтруктураПараметров);
	КонецЕсли;
	Возврат ТабДокумент;
КонецФункции