Процедура ВидмимостьЭлементовФормы()
	Элементы.Код.Видимость=Объект.Предопределенная;
	Элементы.Ячейка.Видимость=НЕ Объект.Предопределенная;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов шапки

&НаКлиенте
Процедура АтрибутФормы_ПриИзменении(Элемент)
	Если Элемент.Имя="Предопределенная" Тогда
		ВидмимостьЭлементовФормы();
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидмимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РодительВторогоУровня=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Родитель, "Родитель");
	Если РодительВторогоУровня=Неопределено Или РодительВторогоУровня.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Полка должна быть второго уровня!",,,"Объект.Родитель"); 
		Отказ=Истина; Возврат;
	КонецЕсли;
	
	Если Не Объект.Предопределенная Тогда
		Если ПустаяСтрока(Объект.Наименование) Тогда Объект.Наименование="Ячейка №"+СокрЛП(Ячейка); КонецЕсли;
		РодительПервогоУровня=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Родитель,  "Родитель");
		КодРодительПервогоУровня=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(РодительПервогоУровня,  "Код");
		КодРодительВторогоУровня=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Объект.Родитель,  "Код");
		Объект.Код=СокрЛП(КодРодительПервогоУровня)+"."+СокрЛП(КодРодительВторогоУровня)+"-"+Формат(Ячейка, "ЧЦ=3; ЧВН=");
	КонецЕсли; 
КонецПроцедуры