Функция СформироватьДеревоОбновлений()
	стрНомерВерсии2=Константы.НомерВерсииКонфигурации.Получить(); //Текущая версия ИБ
	Если стрНомерВерсии2="" Тогда
		стрНомерВерсии2="0";
	КонецЕсли; 
	
	дзОбновления=Новый ДеревоЗначений;
	дзОбновления.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	дзОбновления.Колонки.Добавить("ПредставлениеВерсии", Новый ОписаниеТипов("Строка"));
	дзОбновления.Колонки.Добавить("НомерВерсии", Новый ОписаниеТипов("Строка"));
	дзОбновления.Колонки.Добавить("НомерПроцедуры", Новый ОписаниеТипов("Число"));
	//дзОбновления.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	
	Макет=ПолучитьМакет("ОписаниеОбновлений");	
	Для НомерСтроки=2 По Макет.ВысотаТаблицы Цикл
		стрНомерВерсии=Макет.Область(НомерСтроки, 1).Текст;
		НомерПроцедуры=Макет.Область(НомерСтроки, 2).Текст;
		ОписаниеВерсии=Макет.Область(НомерСтроки, 3).Текст;
		
		//4.0.1.2
		//4.11.04.11
		//4.11.04.12
		
		НомерВерсии1=Число(СтрЗаменить(стрНомерВерсии , ".", ""));
		НомерВерсии2=Число(СтрЗаменить(стрНомерВерсии2, ".", ""));
		Если НомерВерсии1 <= НомерВерсии2 Тогда Продолжить; КонецЕсли;
		
		СтрокаВерсии=дзОбновления.Строки.Найти(стрНомерВерсии, "ПредставлениеВерсии");
		Если СтрокаВерсии=Неопределено Тогда
			СтрокаВерсии=дзОбновления.Строки.Добавить();
			СтрокаВерсии.НомерВерсии=стрНомерВерсии;
			СтрокаВерсии.ПредставлениеВерсии=стрНомерВерсии;
			СтрокаВерсии.НомерПроцедуры=НомерПроцедуры;
			СтрокаВерсии.Пометка=Не ПустаяСтрока(НомерПроцедуры);
			//СтрокаВерсии.Порядок=НомерСтроки;
		КонецЕсли;
		
		НоваяСтрока=СтрокаВерсии.Строки.Добавить();
		НоваяСтрока.НомерВерсии=стрНомерВерсии;
		НоваяСтрока.ПредставлениеВерсии=ОписаниеВерсии;
		НоваяСтрока.НомерПроцедуры=НомерПроцедуры;		
		НоваяСтрока.Пометка=?(ПустаяСтрока(НомерПроцедуры), 2, 1);
		//НоваяСтрока.Порядок=НомерСтроки;
	КонецЦикла;
	//дзОбновления.Строки.Сортировать("Порядок Убыв");
	
	Возврат дзОбновления;
КонецФункции 

Процедура ВыполнитьОбновление(ДеревоОбновлений=Неопределено) Экспорт
	Если ДеревоОбновлений=Неопределено Тогда
		ДеревоОбновлений=СформироватьДеревоОбновлений();
	КонецЕсли;
	Для каждого СтрокаКоллекции1 Из ДеревоОбновлений.Строки Цикл
		Если Не СтрокаКоллекции1.Пометка Тогда Продолжить; КонецЕсли;
		Для каждого СтрокаКоллекции2 Из СтрокаКоллекции1.Строки Цикл
			Если Не СтрокаКоллекции2.Пометка=1 Тогда Продолжить; КонецЕсли;
			
			НомерПроцедуры=СтрокаКоллекции2.НомерПроцедуры;
			Если НомерПроцедуры=0 Тогда Продолжить; КонецЕсли;
			стрНомерВерсии=СокрЛП(СтрокаКоллекции2.НомерВерсии);
			стрНомерВерсии=СтрЗаменить(стрНомерВерсии, ".", "");			
			
			стрКомментарийЖР="Запущена обработка обновления, номер версии:"+СокрЛП(СтрокаКоллекции2.НомерВерсии)+" ("+СокрЛП(НомерПроцедуры)+")";
			ЗаписьЖурналаРегистрации("ИнформационнаяБаза.ОбновлениеИБ", УровеньЖурналаРегистрации.Информация, ЭтотОбъект.Метаданные(),,стрКомментарийЖР);
			Выполнить("ВыполнитьОбновление_"+стрНомерВерсии+"("+НомерПроцедуры+")");
		КонецЦикла; 
	КонецЦикла;
	
	Константы.НомерВерсииКонфигурации.Установить(Метаданные.Версия);
	ОбновлениеВыполнено=Истина;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// процедуры обновлений

Процедура ВыполнитьОбновление_5200323(НомерПроцедуры) Экспорт
	Если НомерПроцедуры=1 Тогда
	Конецесли;
КонецПроцедуры
