Процедура ЗаполнитьПоУмолчанию(ИспользоватьТЧ=Истина) Экспорт
	МенеджерЗаписи=РегистрыСведений.СтруктураПодчиненности.СоздатьМенеджерЗаписи();

	МассивМетаданных=Новый Массив;
	МассивМетаданных.Добавить(Метаданные.Документы);
	МассивМетаданных.Добавить(Метаданные.Задачи);
	МассивМетаданных.Добавить(Метаданные.БизнесПроцессы);
	//*** МассивМетаданных.Добавить(Метаданные.Справочники);

	ВсегоОбъектов=0; Индекс=1; 
	Для каждого ОбъектМетаданых Из МассивМетаданных Цикл
		ВсегоОбъектов=ВсегоОбъектов+ОбъектМетаданых.Количество();
	КонецЦикла;
	
	Для каждого ОбъектМетаданых Из МассивМетаданных Цикл
		Для каждого мдОбъект Из ОбъектМетаданых Цикл
			Сообщение=Новый СообщениеПользователю;
			Сообщение.Текст=СокрЛП(мдОбъект.Представление())+";"+СокрЛП(Индекс)+";"+СокрЛП(ВсегоОбъектов);
			Сообщение.Сообщить(); Индекс=Индекс+1;

			Ссылка=УправлениеКонфигурациейСервер.ИдентификаторОбъектовМетаданныхСсылка(мдОбъект.ПолноеИмя());
			стрЗапрос=РегистрыСведений.СтруктураПодчиненности.СформироватьЗапросПоУмолчанию(Ссылка,,ИспользоватьТЧ);
			Если ПустаяСтрока(стрЗапрос) Тогда
				Сообщение=Новый СообщениеПользователю;
				Сообщение.Текст="Ошибка: не удалось сформировать запрос по объекту '"+мдОбъект.Представление()+"'";
				Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;

			МенеджерЗаписи.Документ=Ссылка;
			МенеджерЗаписи.Прочитать();
			Если НЕ МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Документ=Ссылка;
			КонецЕсли;
			МенеджерЗаписи.Запрос=стрЗапрос;
			МенеджерЗаписи.ЗапросРодители=РегистрыСведений.СтруктураПодчиненности.СформироватьЗапросПоУмолчанию_Родитель(Ссылка,ИспользоватьТЧ);
			МенеджерЗаписи.Записать();
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры 