Функция ЦветСтиля(ИмяЦветаСтиля) Экспорт
	Возврат ОбщегоНазначенияВызовСервера.ЦветСтиля(ИмяЦветаСтиля);	
КонецФункции

Функция ШрифтСтиля(ИмяШрифтаСтиля) Экспорт
	Возврат ОбщегоНазначенияВызовСервера.ШрифтСтиля(ИмяШрифтаСтиля);
КонецФункции

Функция ЭтоВебКлиентПодMacOS() Экспорт
	
#Если Не ВебКлиент Тогда
	Возврат Ложь;  // Только в веб клиенте этот код работает.
#КонецЕсли
	
	СистемнаяИнфо=Новый СистемнаяИнформация;
	Если СтрНайти(СистемнаяИнфо.ИнформацияПрограммыПросмотра, "Macintosh") <> 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;	
КонецФункции

Функция ТипПлатформыКлиента() Экспорт
	СистемнаяИнфо=Новый СистемнаяИнформация;
	Возврат СистемнаяИнфо.ТипПлатформы;
КонецФункции