&НаКлиенте
Функция ВидРасходаДопускаетсяВСписокПрямых(ВидРасхода) 
	Если (ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.ДобровольноеЛичноеСтрахование")) Или 
	     (ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности")) Или  
	     (ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников")) Или   
	     (ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.АмортизационнаяПремия")) Или   
		 (ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.РасходыНаРекламуНормируемые")) Или   
	     (ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.ПредставительскиеРасходы")) Тогда  
		Сообщить("Вид расхода " + ВидРасхода +" может быть только косвенным");
		Возврат Ложь;
	КонецЕсли;  
	Возврат Истина; 
КонецФункции

&НаКлиенте
Процедура АтрибутФормы_ПриИзменении(Элемент)
	Если Элемент.Имя="СтатьяЗатрат" Тогда
		Если Не ЗначениеЗаполнено(Запись.СтатьяЗатрат) Тогда  
			Возврат; 
		ИначеЕсли НЕ ВидРасходаДопускаетсяВСписокПрямых(Запись.ВидРасходовНУ) Тогда  
			Запись.СтатьяЗатрат=ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
			Возврат;
		КонецЕсли;
		Если Не ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Запись.СтатьяЗатрат, "ВидРасходовНУ")=Запись.ВидРасходовНУ Тогда
			Сообщить("Укажите статью затрат с видом расходов (НУ): " + Запись.ВидРасходовНУ);
			Запись.СтатьяЗатрат=ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
		КонецЕсли;

	ИначеЕсли Элемент.Имя="ВидРасходовНУ" Тогда
		Если Не ЗначениеЗаполнено(Запись.ВидРасходовНУ) Тогда  
			Возврат;   
		ИначеЕсли НЕ ВидРасходаДопускаетсяВСписокПрямых(Запись.ВидРасходовНУ) Тогда
			Запись.ВидРасходовНУ = ПредопределенноеЗначение("Перечисление.ВидыРасходовНУ.ПустаяСсылка"); 
			Возврат;
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(Запись.СтатьяЗатрат) Тогда 
			Если НЕ ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Запись.СтатьяЗатрат, "ВидРасходовНУ") = Запись.ВидРасходовНУ Тогда
				Запись.СтатьяЗатрат = ПредопределенноеЗначение("Справочник.СтатьиЗатрат.ПустаяСсылка");
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

