&НаКлиенте
Процедура ОК(Команда)
	Если Элементы.СписокЗначенийПометка.Видимость Тогда
		ЭтаФорма.Закрыть(СписокЗначений.Скопировать());
	Иначе
		ЭтаФорма.Закрыть(Элементы.СписокЗначений.ТекущиеДанные.Значение);
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пометка=?(Параметры.Свойство("Пометка"), Параметры.Пометка, Ложь);
	Элементы.СписокЗначенийПометка.Видимость=Пометка;
	Элементы.ГруппаПометка.Видимость=Пометка;
	
//***	Элементы.СписокЗначенийКартинка.Видимость=?(Параметры.Свойство("Картинка"), Параметры.Картинка, Ложь);
	Элементы.СписокЗначений.ИзменятьСоставСтрок=?(Параметры.Свойство("ИзменятьСоставСтрок"), Параметры.ИзменятьСоставСтрок, Ложь);	
	Элементы.СписокЗначений.РежимВыбора=?(Параметры.Свойство("РежимВыбора"), Параметры.РежимВыбора, Ложь);;
	Элементы.СписокЗначений.МножественныйВыбор=?(Параметры.Свойство("МножественныйВыбор"), Параметры.МножественныйВыбор, Ложь);
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок=Параметры.Заголовок;	
	КонецЕсли;
	
	Для каждого СтрокаКоллекции Из Параметры.СписокЗначений Цикл
		СписокЗначений.Добавить(СтрокаКоллекции.Значение, СтрокаКоллекции.Представление, СтрокаКоллекции.Пометка, СтрокаКоллекции.Картинка);	
	КонецЦикла; 
КонецПроцедуры