Функция ПолныйПуть(Ссылка) Экспорт
	Если Ссылка.ЭтоГруппа Тогда Возврат ""; КонецЕсли; 

	ИмяФайла=КаталогВременныхФайлов()+стрПолучитьСтроку(Ссылка.Алгоритм, 1);
	ДвоичныеДанные=Ссылка.Хранилище.Получить();
	Попытка ДвоичныеДанные.Записать(ИмяФайла);
	Исключение ОбщегоНазначенияКлиентСервер.СообщитьПользователю("{"+СокрЛП(Ссылка)+"} описание ошибки: "+ОписаниеОшибки()); ИмяФайла="";
	КонецПопытки;

	Возврат ИмяФайла; 
КонецФункции

Функция Подключить(Ссылка, АдресХранилища, стрФайл) Экспорт
	Если НЕ ДоступРазрешен(Ссылка) Тогда Возврат ""; КонецЕсли; 

	стрВид=ВнешниеОбработки.Подключить(АдресХранилища,,Ссылка.БезопасныйРежим);
	Объект=ВнешниеОбработки.Создать(стрФайл, Ссылка.БезопасныйРежим);		

	Возврат "ВнешняяОбработка."+стрВид+".Форма."+Объект.Метаданные().ОсновнаяФорма.Имя;
КонецФункции

Функция ДоступРазрешен(Ссылка) Экспорт
	Если Ссылка.Доступ.Количество()=0 Тогда  Возврат Истина; КонецЕсли; 

	Для каждого СтрокаКоллекции Из Ссылка.Доступ Цикл
		Если СтрокаКоллекции.Пользователь.ЭтоГруппа Тогда
			Если ПараметрыСеанса.ТекущийПользователь.ПринадлежитЭлементу(СтрокаКоллекции.Пользователь) Тогда
				Возврат Истина; 
			КонецЕсли; 
		Иначе
			Если СтрокаКоллекции.Пользователь=ПараметрыСеанса.ТекущийПользователь Тогда
				Возврат Истина;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь; 
КонецФункции

Функция ПараметрыАлгоритма(Ссылка) Экспорт
	СтруктураПараметров=Новый Структура;
	Для каждого СтрокаКоллекции Из Ссылка.ПараметрыАлгоритма Цикл
		СтруктураПараметров.Вставить(СтрокаКоллекции.Ключ, СтрокаКоллекции.Значение);
	КонецЦикла;
	Возврат СтруктураПараметров;
КонецФункции

Функция ИмяОсновнойФормы(ИмяОбработки) Экспорт
	Возврат Метаданные.Обработки[ИмяОбработки].ОсновнаяФорма.Имя;
КонецФункции	 