&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	ДинамическиеСпискиКлиент.ВыполнитьДействие(Команда.Имя, ЭтаФорма);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий табличного поля "Динамический список"

&НаКлиенте
Процедура ДинамическийСписок_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДинамическиеСпискиКлиент.Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписок_ВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Если ТипЗнч(Значение)=Тип("Массив") Тогда
		ОповеститьОВыборе(Значение[0]);
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДинамическиеСпискиСервер.НастройкаПоПравилам(ДинамическийСписок, ЭтаФорма);
	Элементы.ДинамическийСписок.РежимВыбора=Параметры.РежимВыбора;	
	Если Параметры.РежимВыбора Тогда
		Элементы.ДинамическийСписок.Отображение=ОтображениеТаблицы.Список;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭлементОтбораПоРодителю=ОтборыСписковКлиентСервер.НайтиЭлементОтбораПоПолю(ДинамическийСписок.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы, "Родитель");
	Если НЕ ЭлементОтбораПоРодителю=Неопределено Тогда
		ЭлементОформления=ДинамическийСписок.УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Использование=Истина;
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);

		//ОформляемоеПоле=ЭлементОформления.Поля.Элементы.Добавить();
		//ОформляемоеПоле.Поле=Новый ПолеКомпоновкиДанных("Наименование");

		ЭлементОтбора=ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВИерархии;
		ЭлементОтбора.ПравоеЗначение = ЭлементОтбораПоРодителю.ПравоеЗначение;

		Заголовок=СокрЛП(ЭлементОтбораПоРодителю.ПравоеЗначение);
	КонецЕсли;
	ДинамическиеСпискиКлиент.ПриОткрытии(Отказ, ДинамическийСписок, ЭтаФорма);
КонецПроцедуры