&НаСервере
Функция ЕстьРежимПроведения(Ссылка)
	Возврат Ссылка.Метаданные().Движения.Количество() > 0;
КонецФункции

&НаСервере
Функция СтруктураОбъекта(Ссылка)
	Возврат УправлениеКонфигурациейСервер.СтруктураОбъекта(Ссылка.Метаданные().ПолноеИмя());
КонецФункции

&НаСервере
Функция ВладелецПечатнойФормы(СтруктураОбъекта)
	Владелец=Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", СтруктураОбъекта.Тип+"."+СтруктураОбъекта.Вид);
	Если Владелец.Пустая() Тогда
		Владелец=ПредопределенноеЗначение("Справочник.ИдентификаторыОбъектовМетаданных."+СтруктураОбъекта.Тип+"_"+СтруктураОбъекта.Вид);
	КонецЕсли;
	Возврат Владелец; 
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТекущийЭлемент=ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент;
	
	Если НЕ ПараметрыВыполненияКоманды.Источник.Параметры.Свойство("Ключ") И ТипЗнч(ТекущийЭлемент)=Тип("ТаблицаФормы") Тогда
		МассивСтрок=ТекущийЭлемент.ВыделенныеСтроки;
		Если МассивСтрок.Количество()=0 Тогда Возврат; КонецЕсли; 
	Иначе
		МассивСтрок=Новый Массив;
		МассивСтрок.Добавить(ПараметрКоманды);
	КонецЕсли;
	
	МассивСсылок=Новый Массив;
	
	СтруктураОбъекта=СтруктураОбъекта(ПараметрКоманды);
	Если СтруктураОбъекта="Документ" Тогда
		Для каждого Ссылка Из МассивСтрок Цикл
			Если ЕстьРежимПроведения(Ссылка) Тогда
				Проведен=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Ссылка, "Проведен");
				Если Не УправлениеПользователямиСервер.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
					ПоказатьПредупреждение(, "Недостаточно полномочий для печати непроведенного документа:"+СокрЛП(Ссылка));
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			МассивСсылок.Добавить(Ссылка);
		КонецЦикла;
	Иначе
		МассивСсылок=МассивСтрок;
	КонецЕсли;

	ПараметрыФормы=Новый Структура;
	ПараметрыФормы.Вставить("Ссылка", МассивСсылок); 
	ПараметрыФормы.Вставить("Владелец", ВладелецПечатнойФормы(СтруктураОбъекта));

	ОткрытьФорму("Справочник.ПечатныеФормы.Форма.ФормаВыбораДляПечати", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры