
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого Строка Из ВладелецФормы.Объект.СчетаРасчетаРеализованногоНаложения Цикл
		ЗаполнитьЗначенияСвойств(Объект.СчетаРасчетаРеализованногоНаложения.Добавить(), Строка);
	КонецЦикла;
	Для Каждого Строка Из ВладелецФормы.Объект.НоменклатураРеализованногоНаложения Цикл
		ЗаполнитьЗначенияСвойств(Объект.НоменклатураРеализованногоНаложения.Добавить(), Строка);
	КонецЦикла;
	Для Каждого Строка Из ВладелецФормы.Объект.СкладыРеализованногоНаложения Цикл
		ЗаполнитьЗначенияСвойств(Объект.СкладыРеализованногоНаложения.Добавить(), Строка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ВладелецФормы.Объект.СчетаРасчетаРеализованногоНаложения.Очистить();
	Для Каждого Строка Из Объект.СчетаРасчетаРеализованногоНаложения Цикл
		ЗаполнитьЗначенияСвойств(ВладелецФормы.Объект.СчетаРасчетаРеализованногоНаложения.Добавить(), Строка);
	КонецЦикла;
	ВладелецФормы.Объект.НоменклатураРеализованногоНаложения.Очистить();
	Для Каждого Строка Из Объект.НоменклатураРеализованногоНаложения Цикл
		ЗаполнитьЗначенияСвойств(ВладелецФормы.Объект.НоменклатураРеализованногоНаложения.Добавить(), Строка);
	КонецЦикла;
	ВладелецФормы.Объект.СкладыРеализованногоНаложения.Очистить();
	Для Каждого Строка Из Объект.СкладыРеализованногоНаложения Цикл
		ЗаполнитьЗначенияСвойств(ВладелецФормы.Объект.СкладыРеализованногоНаложения.Добавить(), Строка);
	КонецЦикла;
КонецПроцедуры
