&НаКлиенте
Процедура ОбновитьЗаголовокСтраницыРегистра(РеквизитЗаголовка, СписокРегистров)
	РеквизитЗаголовка=Строка(ПолучитьКоличествоПомеченных(СписокРегистров))+"/"+Строка(СписокРегистров.Количество());
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСписокРегистровДляКорректировки(РезультатСписок, СписокРегистров)
	Для Каждого Элемент Из СписокРегистров Цикл
		РегистрИспользуется=СписокИспользуемыхРегистров.НайтиПоЗначению(Элемент.Значение) <> Неопределено;
		// Необходимо отключить регистр.
		Если Элемент.Пометка И Не РегистрИспользуется Тогда
			РезультатСписок.Добавить(Элемент.Значение, Элемент.Представление, Истина);

		// Необходимо добавить регистр.
		ИначеЕсли Не Элемент.Пометка И РегистрИспользуется Тогда
			РезультатСписок.Добавить(Элемент.Значение, Элемент.Представление, Ложь);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКоличествоПомеченных(СписокЗначений)
	Результат=0;
	Для Каждого Элемент Из СписокЗначений Цикл
		Если Элемент.Пометка Тогда
			Результат=Результат+1;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	Результат=Новый СписокЗначений;

	СоздатьСписокРегистровДляКорректировки(Результат, СписокРегистровНакопления);
	СоздатьСписокРегистровДляКорректировки(Результат, СписокРегистровБухгалтерии);
	СоздатьСписокРегистровДляКорректировки(Результат, СписокРегистровСведений);
	
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура СписокРегистровНакопленияПриИзменении(Элемент)
	ОбновитьЗаголовокСтраницыРегистра(ЗаголовокСтраницыРегистрыНакопления, СписокРегистровНакопления);
КонецПроцедуры

&НаКлиенте
Процедура СписокРегистровБухгалтерииПриИзменении(Элемент)
	ОбновитьЗаголовокСтраницыРегистра(ЗаголовокСтраницыРегистрыБухгалтерии, СписокРегистровБухгалтерии);
КонецПроцедуры

&НаКлиенте
Процедура СписокРегистровСведенийПриИзменении(Элемент)
	ОбновитьЗаголовокСтраницыРегистра(ЗаголовокСтраницыРегистрыСведений, СписокРегистровСведений);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокИспользуемыхРегистров.ЗагрузитьЗначения(Параметры.СписокИспользуемыхРегистров.ВыгрузитьЗначения());

	//Регистры  накопления
	Для Каждого Регистр Из Метаданные.Документы.КорректировкаЗаписейРегистров.Движения Цикл
		Если Метаданные.РегистрыНакопления.Содержит(Регистр) Тогда
			Пометка=НЕ СписокИспользуемыхРегистров.НайтиПоЗначению(Регистр.Имя)=Неопределено;
			СписокРегистровНакопления.Добавить(Регистр.Имя, Регистр.Синоним, Пометка);
		КонецЕсли;
	КонецЦикла;
	СписокРегистровНакопления.СортироватьПоЗначению(НаправлениеСортировки.Возр);

	//Регистры бухгалтерии
	Для Каждого Регистр Из Метаданные.Документы.КорректировкаЗаписейРегистров.Движения Цикл
		Если Метаданные.РегистрыБухгалтерии.Содержит(Регистр) Тогда
			Пометка=НЕ СписокИспользуемыхРегистров.НайтиПоЗначению(Регистр.Имя)=Неопределено;
			СписокРегистровБухгалтерии.Добавить(Регистр.Имя, Регистр.Синоним, Пометка);
		КонецЕсли;
	КонецЦикла;
	СписокРегистровБухгалтерии.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	//Регистры сведений
	Для Каждого Регистр Из Метаданные.Документы.КорректировкаЗаписейРегистров.Движения Цикл
		Если Метаданные.РегистрыСведений.Содержит(Регистр) Тогда
			Пометка=НЕ  СписокИспользуемыхРегистров.НайтиПоЗначению(Регистр.Имя)=Неопределено;
			СписокРегистровСведений.Добавить(Регистр.Имя, Регистр.Синоним, Пометка);
		КонецЕсли;
	КонецЦикла;
	СписокРегистровСведений.СортироватьПоЗначению(НаправлениеСортировки.Возр);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЗаголовокСтраницыРегистра(ЗаголовокСтраницыРегистрыНакопления, СписокРегистровНакопления);
	ОбновитьЗаголовокСтраницыРегистра(ЗаголовокСтраницыРегистрыСведений, СписокРегистровСведений);
	ОбновитьЗаголовокСтраницыРегистра(ЗаголовокСтраницыРегистрыБухгалтерии, СписокРегистровБухгалтерии);
КонецПроцедуры