Функция Share_GET(Запрос)
	Ответ=Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");

	ID=Запрос.ПараметрыURL.Получить("ID");
	Если ID=Неопределено Тогда
		Ответ.КодСостояния=201;
		Ответ.УстановитьТелоИзСтроки("В параметрах запроса отсутствует строка ID!");
		Возврат Ответ;
	КонецЕсли;

	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ID", ID);
	Запрос.Текст="
	|ВЫБРАТЬ *
	|ИЗ
	|	РегистрСведений.Share КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.ID = &ID
	|";
	Выборка=Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Ответ.КодСостояния=202;
		Ответ.УстановитьТелоИзСтроки("Ссылка больше не активна!");
		Возврат Ответ;		
	КонецЕсли;
	стрТип=СокрЛП(Выборка.Тип);

	Если Лев(стрТип, 3)="XLS" Тогда
		Ответ.Заголовки.Вставить("Content-Type", "application/vnd.ms-excel");
	ИначеЕсли стрТип="PDF" Тогда
		Ответ.Заголовки.Вставить("Content-Type", "application/pdf");
	КонецЕсли;
	Ответ.Заголовки.Вставить("Accept-Encoding", "gzip");

	Ответ.УстановитьТелоИзДвоичныхДанных(Выборка.Данные.Получить());

	Если Выборка.ВариантУдаления=1 Тогда
		МенеджерЗаписи=РегистрыСведений.Share.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ID=ID;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			УстановитьПривилегированныйРежим(Истина);
			МенеджерЗаписи.Удалить();
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;

	Возврат Ответ;
КонецФункции