Процедура ПередЗаписью(Отказ)

	Если НЕ ОбменДанными.Загрузка И НЕ ЭтоНовый() Тогда
		СуществуютСсылки = Неопределено;
		Если ТипНоменклатуры <> Ссылка.ТипНоменклатуры И ПолныеПрава.ВидыНоменклатуры_СуществуютСсылкиВНоменклатуре(Ссылка, СуществуютСсылки) Тогда
			ТекстСообщения = "Вид номенклатуры """ + СокрЛП(Ссылка) + """ выбран в элементах справочника ""Номенклатура"".
			|Тип не может быть изменен!";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


