Процедура тзСвойства_ДобавитьСтроку(Идентификатор, Представление, Значение=Неопределено, Группа=Ложь)
	НоваяСтрока=тзСвойства.Добавить();
	НоваяСтрока.Идентификатор=Идентификатор;
	НоваяСтрока.Представление=Представление;
	НоваяСтрока.Значение=Значение;
	НоваяСтрока.Группа=Группа;

КонецПроцедуры
 
&НаСервере
Процедура тзСвойства_Инициализация()
	тзСвойства_ДобавитьСтроку("Основные", "Основные",, Истина);
	тзСвойства_ДобавитьСтроку("ПоложениеЗаголовка", "Положение заголовка");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	тзСвойства_Инициализация();
КонецПроцедуры
