&НаКлиенте
Процедура Проверить(Команда)
	ПроверитьПоДанымСайтаФНС();
КонецПроцедуры

Процедура ПроверитьПоДанымСайтаФНС()
	Объект.ДанныеПроверки.Очистить();
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ИНН", "");
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.Ссылка Как Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = Ложь И Контрагенты.ИНН <> &ИНН
	|";
	тзДанные=Запрос.Выполнить().Выгрузить();

	Обработки.ПроверкаИНН.ПроверитьИНН(тзДанные);
	Для каждого СтрокаКоллекции Из тзДанные Цикл
		ЗаполнитьЗначенияСвойств(Объект.ДанныеПроверки.Добавить(), СтрокаКоллекции);
	КонецЦикла;
КонецПроцедуры	 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПроверитьПоДанымСайтаФНС();
КонецПроцедуры