&НаКлиенте
Процедура Страницы_ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя="СтраницаДерево" Тогда
		Если Объект.Дерево.ПолучитьЭлементы().Количество()=0 Тогда
			ДеревоXML_Заполнить();
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ДеревоXML_Заполнить()
	Если НЕ ПустаяСтрока(Объект.ДокументXML) Тогда
		дзБуфер=Обработки.ЧтениеXML.ДеревоЗначений(Объект.ДокументXML);
		Если дзБуфер.Строки.Количество() > 0 Тогда
			ЗначениеВРеквизитФормы(дзБуфер, "Объект.Дерево");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	Объект.Атрибуты.Очистить();
	Данные=Элемент.ТекущиеДанные;
	Если Данные=Неопределено Тогда Возврат; КонецЕсли;

	АтрибутыДерева=Данные.Атрибуты;
	Если ТипЗнч(АтрибутыДерева)=Тип("Соответствие") Тогда
		Для каждого АтрибутДерева Из АтрибутыДерева Цикл
			СтрокаТаблицы=Объект.Атрибуты.Добавить();
			СтрокаТаблицы.Атрибут=АтрибутДерева.Ключ;
			СтрокаТаблицы.ЗначениеАтрибута=АтрибутДерева.Значение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ДокументXML", Объект.ДокументXML);
	Если НЕ ПустаяСтрока(Объект.ДокументXML) Тогда
		ДеревоXML_Заполнить();
	КонецЕсли;

	//ПредставлениеXML=КаталогВременныхФайлов()+"1.xml";
	//ТекстовыйДокумент=Новый ТекстовыйДокумент;
	//ТекстовыйДокумент.ДобавитьСтроку(Объект.ДокументXML);
	//ТекстовыйДокумент.Записать(ПредставлениеXML);
КонецПроцедуры