&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Форма=ПараметрыВыполненияКоманды.Источник;
	Объект=Форма.Объект;

	МассивЭлементов=Новый Массив;
	Для каждого Элемент Из Форма.Элементы Цикл
		Если Прав(Элемент.Имя, 20)="РасширеннаяПодсказка" Или Прав(Элемент.Имя, 15)="КонтекстноеМеню" Тогда
			Продолжить;
		КонецЕсли;			
		МассивЭлементов.Добавить(Элемент.Имя);	
	КонецЦикла;
	
	КомпоновщикНастроек=СформироватьКомпоновщикНастроек(Объект.Ссылка, МассивЭлементов, ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор);
	
	ПараметрыФормы=Новый Структура;
	ПараметрыФормы.Вставить("КомпоновщикНастроек", КомпоновщикНастроек); 	
	
	ОткрытьФорму("ОбщаяФорма.УсловноеОформлениеФормы", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаСервере
Функция СформироватьКомпоновщикНастроек(Знач Ссылка, МассивЭлементов, Знач УникальныйИдентификатор)
	СхемаКомпоновкиДанных=Новый СхемаКомпоновкиДанных;
	
	стрЗапрос="Выбрать";
	
	мдОбъект=Ссылка.Метаданные();
	Для каждого СтрокаКоллекции Из мдОбъект.СтандартныеРеквизиты Цикл
		стрЗапрос=стрЗапрос+?(стрЗапрос="Выбрать", "", ",")+Символы.ПС+"ИсточникДанных."+СтрокаКоллекции.Имя;
	КонецЦикла; 	
	Для каждого СтрокаКоллекции Из мдОбъект.Реквизиты Цикл
		стрЗапрос=стрЗапрос+?(стрЗапрос="Выбрать", "", ",")+Символы.ПС+"ИсточникДанных."+СтрокаКоллекции.Имя;
	КонецЦикла; 
	Для каждого СтрокаКоллекции Из мдОбъект.ТабличныеЧасти Цикл
		стрЗапрос=стрЗапрос+?(стрЗапрос="Выбрать", "", ",")+Символы.ПС+"ИсточникДанных."+СтрокаКоллекции.Имя;
	КонецЦикла;	
	
	Для каждого СтрокаКоллекции Из МассивЭлементов Цикл
		стрЗапрос=стрЗапрос+Символы.ПС+","""+СтрокаКоллекции+""" Как "+СтрокаКоллекции;
	КонецЦикла;

	тзРеквизиты=МетаконфигураторСервер.ТаблицаДополнительныхРеквизитовОбъекта(СтрЗаменить(мдОбъект.ПолноеИмя(), ".", "_"));
	Для каждого СтрокаКоллекции Из тзРеквизиты Цикл
		стрЗапрос=стрЗапрос+Символы.ПС+","""+МетаконфигураторСервер.АтрибутВСтроку(СтрокаКоллекции.Реквизит, СтрокаКоллекции.ВладелецИмяПредопределенныхДанных)+""" Как "+СтрокаКоллекции.Код;
	КонецЦикла;
	
	стрЗапрос=стрЗапрос+Символы.ПС+"ИЗ "+мдОбъект.ПолноеИмя()+" Как ИсточникДанных";
	
	ИсточникДанных=СхемаКомпоновкиДанных.ИсточникиДанных.Добавить(); 
	ИсточникДанных.Имя="ИсточникДанных";
	ИсточникДанных.СтрокаСоединения="";
	ИсточникДанных.ТипИсточникаДанных="Local";
	
	НаборДанных=СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя="НаборДанных";
	НаборДанных.ИсточникДанных="ИсточникДанных";
	НаборДанных.АвтоЗаполнениеДоступныхПолей=Истина;
	НаборДанных.Запрос=стрЗапрос;
	
	
	//Поле=НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	//
	////Поле.ОграничениеИспользования.Группировка=Истина;
	////Поле.ОграничениеИспользования.Условие=Истина;
	////Поле.ОграничениеИспользования.Порядок=Истина;
	//
	//Поле.ПутьКДанным="ZZZ";
	//Поле.Заголовок="ZZZ";
	//Поле.Поле="ZZZ";
	
	////1.2.1 добавляем поля 
	//ПолеНоменклатуры = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	//ПолеНоменклатуры.ПутьКДанным = "Номенклатура";
	//ПолеНоменклатуры.Заголовок 	 = "Номенклатура";
	//ПолеНоменклатуры.Поле		 = "Номенклатура";
	
	АдресСхемыКомпоновкиДанных=ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	КомпоновщикНастроек=Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	
	Возврат КомпоновщикНастроек;
КонецФункции
