Функция ПолучитьСимволыШтрихКода(СЗ_СимволыБарКода,ВзялИндекс)
	ВзялЭлемент=""+СЗ_СимволыБарКода.Получить(ВзялИндекс).Значение;
	Результат="";
	Для А = 1 По СтрДлина(ВзялЭлемент)/2 Цикл
		Результат = Результат + Символ(37 + Сред(ВзялЭлемент,(А-1)*2+1,2));
	КонецЦикла;
	Возврат Результат;
КонецФункции

Процедура ВывестиСообщениеОбОшибке(Сообщение)
	Сообщение=Новый СообщениеПользователю;
	Сообщение.Текст=Сообщение;
	Сообщение.Сообщить(); 
КонецПроцедуры

Функция ВернутьШК_Code128(СЗ_СимволыБарКода, ТЗ_НаборCodeC, ТЗ_НаборCodeB, Знач ВзялСтрокуДляШК) Экспорт 
	
	ТекущийНабор = "";
	СЗ_НомернаяПоследовательность = Новый СписокЗначений;
	
	ТекПоз = 1;
	Пока ТекПоз <= СтрДлина(ВзялСтрокуДляШК) Цикл
		Отбор = Новый Структура();
		Отбор.Вставить("Значение" , "" + Сред(ВзялСтрокуДляШК , ТекПоз , 2));
		ВзялМассив = ТЗ_НаборCodeC.НайтиСтроки(Отбор);
		Если ВзялМассив.Количество() > 0 Тогда // последовательность из двух цифр - CODE C
			Если ТекущийНабор <> 105 Тогда
				Если ПустаяСтрока(ТекущийНабор) Тогда
					СЗ_НомернаяПоследовательность.Добавить(105);
				Иначе
					СЗ_НомернаяПоследовательность.Добавить(99);
				КонецЕсли;
				ТекущийНабор = 105;
			КонецЕсли;
			СЗ_НомернаяПоследовательность.Добавить(ВзялМассив.Получить(0).Индекс);
			ТекПоз = ТекПоз + 2;
			Продолжить;
		КонецЕсли;
		Отбор = Новый Структура();
		Отбор.Вставить("Значение" , "" + Сред(ВзялСтрокуДляШК,ТекПоз,1));
		ВзялМассив = ТЗ_НаборCodeB.НайтиСтроки(Отбор);
		Если ВзялМассив.Количество() > 0 Тогда // последовательность CODE B
			Если ТекущийНабор <> 104 Тогда
				Если ПустаяСтрока(ТекущийНабор) Тогда
					СЗ_НомернаяПоследовательность.Добавить(104);
				Иначе
					СЗ_НомернаяПоследовательность.Добавить(100);
				КонецЕсли;
				ТекущийНабор = 104;
			КонецЕсли;
			СЗ_НомернаяПоследовательность.Добавить(ВзялМассив.Получить(0).Индекс);
			ТекПоз = ТекПоз + 1;
			Продолжить;
		КонецЕсли;
		ВывестиСообщениеОбОшибке("В указанном значении присутствуют неразрешенные символы. Для создания штрих-кода не используйте кирилические и спец.символы.");
		Возврат "";
	КонецЦикла;
	
	ШтрихКод = "";
	ДляРасчетаКонтрольногоЧисла = 0;
	Для А = 0 По СЗ_НомернаяПоследовательность.Количество()-1 Цикл
		ВзялНомер = СЗ_НомернаяПоследовательность.Получить(А).Значение;
		ШтрихКод = ШтрихКод + ПолучитьСимволыШтрихКода(СЗ_СимволыБарКода,ВзялНомер);
		Коэффициент = ?(А = 0 , 1 , А);
		ДляРасчетаКонтрольногоЧисла = ДляРасчетаКонтрольногоЧисла + (ВзялНомер * Коэффициент);
	КонецЦикла;
	КонтрольноеЧисло = ДляРасчетаКонтрольногоЧисла%103;
	ШтрихКод = ШтрихКод + ПолучитьСимволыШтрихКода(СЗ_СимволыБарКода,КонтрольноеЧисло);
	ШтрихКод = ШтрихКод + ПолучитьСимволыШтрихКода(СЗ_СимволыБарКода,106);
	
	Возврат ШтрихКод;
КонецФункции
































////Функция ИнициализироватьТаблицыСимволов_Code128()
////	Возврат ГенераторШтрихкодовПовтИсп.ИнициализироватьТаблицыСимволов();
////КонецФункции

////Функция ИнициализироватьТаблицыСимволов_Code128_И_ВернутьШК_Code128(Знач ВзялСтрокуДляШК)
////	таблицыДляРаботыШК=ИнициализироватьТаблицыСимволов_Code128();
////	Возврат ГенераторШтрихкодов.ВернутьШК_Code128(таблицыДляРаботыШК.СЗ_СимволыБарКода,таблицыДляРаботыШК.ТЗ_НаборCodeC,таблицыДляРаботыШК.ТЗ_НаборCodeB,Строка(ВзялСтрокуДляШК));
////КонецФункции

////Функция ВернутьКонтрольнуюЦифру(Штрих) 
////	Штрих1=СокрЛП(Штрих);
////	Если НЕ СтрДлина(Штрих1)=13 И НЕ СтрДлина(Штрих1)=8 Тогда Возврат "";  КонецЕсли; 
////	
////	Если СтрДлина(Штрих1)=13 Тогда 
////		Четн = 0;
////		Для Инд = 1 По 6 Цикл
////			Четн = Четн + Сред(Штрих1,2*Инд,1);
////		КонецЦикла;
////		Четн = Четн * 3;
////		
////		Нечетн = 0;
////		Для Инд = 1 По 6 Цикл
////			Нечетн = Нечетн + Сред(Штрих1,2*Инд-1,1);
////		КонецЦикла;
////		
////		КонтЦифра=(Четн+Нечетн)/10-Цел((Четн+Нечетн)/10);
////		КонтЦифра=10-Цел(КонтЦифра*10);
////		Если КонтЦифра = 10
////			Тогда
////			КонтЦифра = 0;
////		КонецЕсли;
////	Иначе
////		Четн = 0;
////		Для Инд = 1 По 3 Цикл
////			Четн = Четн + Число(Сред(Штрих1,2*Инд,1));
////		КонецЦикла;
////		
////		Нечетн = 0;
////		Для Инд = 1 По 4 Цикл
////			Нечетн = Нечетн + Сред(Штрих1,2*Инд-1,1);
////		КонецЦикла;
////		Нечетн = Нечетн * 3;
////		
////		КонтЦифра=(Четн+Нечетн)/10-Цел((Четн+Нечетн)/10);
////		КонтЦифра=10-Цел(КонтЦифра*10);
////		Если КонтЦифра = 10
////			Тогда
////			КонтЦифра = 0;
////		КонецЕсли;
////	КонецЕсли;
////	Возврат  Строка(КонтЦифра) ;
////КонецФункции

////Функция NumberToUpperChar( Num )
////	UpperCharSet = "ABCDEFGHIJ";
////	Num = Число(Прав(Num,1));
////	Возврат Сред(UpperCharSet, Num + 1, 1);
////КонецФункции

////Функция NumberToLowerChar( Num )
////	LowerCharSet = "abcdefghij";
////	Num = Число(Прав(Num,1));
////	Возврат Сред(LowerCharSet, Num + 1, 1);
////КонецФункции

////Функция EAN13CodeGenerate(код) 
////	Если НЕ ЗначениеЗаполнено(Код) Тогда Возврат ""; КонецЕсли;

////	ПервыйФлаг = Число(Сред(код,1,1));
////	левстр     = Сред(код,2,6);
////	правстр    = Сред(код,8,6);
////	
////	правкод = "";
////	Для Поз = 1 По 6 Цикл
////		правкод = правкод + NumberToLowerChar(Сред(правстр,Поз,1));
////	КонецЦикла;
////	
////	//  Формирование левой части кода зависит от значениа ПервыйФлаг
////	Если ПервыйФлаг=0 Тогда // A  A  A  A  A
////		левкод="#!"+Лев(левстр, 1)+Сред(левстр, 2, 1)+Сред(левстр, 3, 1)+Сред(левстр, 4, 1)+Сред(левстр, 5, 1)+Сред(левстр, 6, 1);

////	ИначеЕсли ПервыйФлаг=1 Тогда // A  A  B  A  B  B
////		левкод="$!"+Лев(левстр, 1)+Сред(левстр, 2, 1)+NumberToUpperChar(Сред(левстр, 3, 1))+Сред(левстр,4,1)+NumberToUpperChar(Сред(левстр, 5, 1))+NumberToUpperChar(Сред(левстр, 6, 1));

////	ИначеЕсли ПервыйФлаг=2 Тогда // A  A  B  B  A  B
////		левкод="%!"+Лев(левстр, 1)+Сред(левстр, 2, 1)+NumberToUpperChar(Сред(левстр, 3, 1))+NumberToUpperChar(Сред(левстр, 4, 1))+Сред(левстр, 5, 1)+NumberToUpperChar(Сред(левстр, 6, 1));

////	ИначеЕсли ПервыйФлаг = 3 Тогда // A  A  B  B  B  A
////		левкод="&!"+Лев(левстр, 1)+Сред(левстр, 2, 1)+NumberToUpperChar(Сред(левстр, 3, 1))+NumberToUpperChar(Сред(левстр, 4, 1))+NumberToUpperChar(Сред(левстр, 5, 1))+Сред(левстр,6,1);

////	ИначеЕсли ПервыйФлаг = 4 Тогда // A  B  A  A  B  B
////		левкод = "'!"
////		+ Лев(левстр,1)
////		+ NumberToUpperChar(Сред(левстр,2,1))
////		+ Сред(левстр,3,1)
////		+ Сред(левстр,4,1)
////		+ NumberToUpperChar(Сред(левстр,5,1))
////		+ NumberToUpperChar(Сред(левстр,6,1));

////	ИначеЕсли ПервыйФлаг = 5 Тогда // A  B  B  A  A  B
////		левкод = "(!"
////		+ Лев(левстр,1)
////		+ NumberToUpperChar(Сред(левстр,2,1))
////		+ NumberToUpperChar(Сред(левстр,3,1))
////		+ Сред(левстр,4,1)
////		+ Сред(левстр,5,1)
////		+ NumberToUpperChar(Сред(левстр,6,1));

////	ИначеЕсли ПервыйФлаг = 6 Тогда // A  B  B  B  A  A
////		левкод = ")!"
////		+ Лев(левстр,1)
////		+ NumberToUpperChar(Сред(левстр,2,1))
////		+ NumberToUpperChar(Сред(левстр,3,1))
////		+ NumberToUpperChar(Сред(левстр,4,1))
////		+ Сред(левстр,5,1)
////		+ Сред(левстр,6,1);

////	ИначеЕсли ПервыйФлаг = 7 Тогда // A  B  A  B  A  B
////		левкод = "*!"
////		+ Лев(левстр,1)
////		+ NumberToUpperChar(Сред(левстр,2,1))
////		+ Сред(левстр,3,1)
////		+ NumberToUpperChar(Сред(левстр,4,1))
////		+ Сред(левстр,5,1)
////		+ NumberToUpperChar(Сред(левстр,6,1));

////	ИначеЕсли ПервыйФлаг = 8 Тогда 	// A  B  A  B  B  A
////		левкод = "+!"
////		+ Лев(левстр,1)
////		+ NumberToUpperChar(Сред(левстр,2,1))
////		+ Сред(левстр,3,1)
////		+ NumberToUpperChar(Сред(левстр,4,1))
////		+ NumberToUpperChar(Сред(левстр,5,1))
////		+ Сред(левстр,6,1);

////	ИначеЕсли ПервыйФлаг = 9 Тогда // A  B  B  A  B  A
////		левкод = ",!"
////		+ Лев(левстр,1)
////		+ NumberToUpperChar(Сред(левстр,2,1))
////		+ NumberToUpperChar(Сред(левстр,3,1))
////		+ Сред(левстр,4,1)
////		+ NumberToUpperChar(Сред(левстр,5,1))
////		+ Сред(левстр,6,1);
////	КонецЕсли;

////	Возврат левкод+"-"+правкод+"!";
////КонецФункции

////Функция EAN8CodeGenerate(код) 
////	Если НЕ ЗначениеЗаполнено(Код) Тогда 
////		Возврат "";
////	КонецЕсли;
////	
////	правстр    = Сред(код,1,4);
////	левстр    = Сред(код,5,8);
////	
////	правкод = "";
////	Для Поз = 1 По 4 Цикл
////		правкод = правкод + NumberToLowerChar(Сред(левстр,Поз,1));
////	КонецЦикла;
////	
////	левкод="";
////	Для Поз = 1 По 4 Цикл
////		левкод = левкод + (Сред(правстр,Поз,1));
////	КонецЦикла;
////	
////	Возврат "!"+левкод + "-" + правкод + "!";
////КонецФункции

