&НаСервере
Функция КомпоновщикНастроек_Выполнить()
	СхемаКомпоновкиДанных=ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);

	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаЗаполнения", Объект.Дата);

	//подготовка к формированию
	КомпоновщикМакета=Новый КомпоновщикМакетаКомпоновкиДанных;

	//Выводить параметры
	СтрокаНастройки=КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы[12];
	СтрокаНастройки.Использование=Истина;
	СтрокаНастройки.Значение=ТипВыводаТекстаКомпоновкиДанных.НеВыводить;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетОформления=ПолучитьОбщийМакет("МакетОформленияСКД");
	МакетКомпоновки=КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных=Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

	тзДанные=Новый ТаблицаЗначений;
	ПроцессорВывода=Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.ОтображатьПроцентВывода=Истина;
	ПроцессорВывода.УстановитьОбъект(тзДанные);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	ЗначениеДанных=ЗначениеВСтрокуВнутр(тзДанные);
	
	Возврат ЗначениеДанных; 
КонецФункции

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	дзДанные=КомпоновщикНастроек_Выполнить();
	ОповеститьОВыборе(дзДанные);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СхемаКомпоновкиДанных=Обработки.ПечатьЭтикеток.ПолучитьМакет("СхемаКомпоновкиДанных");
	АдресСхемыКомпоновкиДанных=ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
КонецПроцедуры
