&НаКлиенте
Процедура ОбновлениеОтображения()
	Элементы.НадписьСтоимость.Заголовок="Стоимость: "+Цена*Количество;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьСтруктураТабличнойЧасти(ИмяТабличнойЧасти)
	Структура=Новый Структура;
	Для каждого мдРеквизит Из Метаданные.Документы.Спецификация.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты Цикл
		Структура.Вставить(мдРеквизит.Имя);
	КонецЦикла; 
	Возврат Структура;
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	СтруктураВозврата=СформироватьСтруктураТабличнойЧасти(ИмяТЧ);
	СтруктураВозврата.Вставить("ИмяТЧ", ИмяТЧ);
	СтруктураВозврата.Вставить("Редактирование", Редактирование);
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, ЭтаФорма);
	ЭтаФорма.Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура СтатьяЗатратПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Номенклатура=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(СтатьяЗатрат,"Номенклатура");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ОбновитьОтображениеДанных();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Редактирование=Ложь;
	Если Не Параметры.ДанныеСтроки=Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ДанныеСтроки);
		Редактирование=Истина;
	КонецЕсли; 
	ИмяТЧ=Параметры.ИмяТЧ;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображениеДанных();
КонецПроцедуры
