//Процедура Скопировать(Знач ТаблицаФормы, Знач ВыделенныеСтроки) Экспорт
//	тзБуфер=ТаблицаФормы.Выгрузить();
//	тзБуфер.Очистить();
//	Для каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
//		РезультатПоиска=ТаблицаФормы.НайтиПоИдентификатору(ИдентификаторСтроки);
//		Если РезультатПоиска=Неопределено Тогда Продолжить; КонецЕсли;
//		ЗаполнитьЗначенияСвойств(тзБуфер.Добавить(), РезультатПоиска);
//	КонецЦикла;
//	СтруктураБуфера=ПараметрыСеанса.БуферОбмена.Получить();
//	СтруктураБуфера.Вставить("ТабличнаяЧасть", тзБуфер);
//	//СтруктураБуфера.Вставить("ТабличнаяЧасть", ПоместитьВоВременноеХранилище(тзБуфер));
//	ПараметрыСеанса.БуферОбмена=Новый ХранилищеЗначения(СтруктураБуфера);
//КонецПроцедуры
 
//Процедура Вставить(Форма) Экспорт
//	СтруктураБуфера=ПараметрыСеанса.БуферОбмена.Получить();
//	стрАдрес=""; СтруктураБуфера.Свойство("ТабличнаяЧасть", стрАдрес);
//	Если ПустаяСтрока(стрАдрес) Тогда Возврат; КонецЕсли;
//	
//	тзБуфер=ПолучитьИзВременногоХранилища(стрАдрес);
//	Если НЕ ТипЗнч(тзБуфер)=Тип("ТаблицаЗначений") Тогда
//		Возврат;
//	КонецЕсли;
//	
//	стрТабличнаяЧасть=Форма.ТекущийЭлемент.Имя;
//	Объект=Форма.Объект[стрТабличнаяЧасть];

//	ЕстьКолонкаID=НЕ тзБуфер.Колонки.Найти("ID")=Неопределено;
//	ЕстьКолонкаТОП=НЕ тзБуфер.Колонки.Найти("ТОП")=Неопределено;
//	Для каждого СтрокаКоллекции Из тзБуфер Цикл
//		НоваяСтрока=Объект[стрТабличнаяЧасть].Добавить();
//		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКоллекции);
//		Если ЕстьКолонкаID Тогда
//			НоваяСтрока.ID=СокрЛП(Новый УникальныйИдентификатор);
//			СтрокаКоллекции.ID=НоваяСтрока.ID; //Для возможной обработки в модуле вызова установки значений ID_Товары,ID_Владелец и т.д. (что бы можно бло найти добавленные строки)
//		КонецЕсли;
//		Если ЕстьКолонкаТОП Тогда
//			НоваяСтрока.ТОП=Справочники.ТиповыеОперации.ПустаяСсылка();
//			ОбработкаТабличныхЧастей.УстановитьТиповуюОперацию(СтрокаКоллекции, Объект, Форма, стрТабличнаяЧасть);
//		КонецЕсли; 
//	КонецЦикла;
//КонецПроцедуры
// 


Функция МассивСтрок() Экспорт
	СтруктураБуфера=ПараметрыСеанса.БуферОбмена.Получить();
	Если НЕ СтруктураБуфера.Свойство("ТабличнаяЧасть") Тогда Возврат Неопределено; КонецЕсли; 
	Если НЕ ТипЗнч(СтруктураБуфера.ТабличнаяЧасть)=Тип("Массив") Тогда Возврат Неопределено; КонецЕсли;
	Возврат ?(ТипЗнч(СтруктураБуфера.ТабличнаяЧасть)=Тип("Массив"), СтруктураБуфера.ТабличнаяЧасть, Неопределено); 
КонецФункции