&НаСервере
Процедура ПереместитьКолонкуДинамическогоСписка(ИмяДинамическогоСписка)
	ДС=Элементы[ИмяДинамическогоСписка];
	Если ПустаяСтрока(ДС.Подсказка) Тогда Возврат; КонецЕсли; 
	Элементы.Переместить(Элементы[ДС.ТекущийЭлемент.Имя], ДС, Элементы[ДС.Подсказка]);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий "Динамический список"

&НаКлиенте
Процедура тпДинамическийСписок_ПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка=Ложь;
	Элемент.Подсказка=?(Поле=Неопределено, "", Поле.Имя);
	Если НЕ Элементы.ГруппаДействия.Видимость Тогда
		Элементы.ГруппаДействия.Видимость=Истина;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура тпДинамическийСписок_ОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	ПереместитьКолонкуДинамическогоСписка(Элемент.Имя);
	Элементы.ГруппаДействия.Видимость=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура тпДинамическийСписок_Перетаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	//Сообщить("Перетаскивание");
КонецПроцедуры