&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	Если Команда.Имя="ДанныеКонтрагентаПоИНН" Тогда
		стрВариант="РеквизитыЮрЛицаПоИНН";
		Если Не ВладелецФормы=Неопределено Тогда
			стрВариант="РеквизитыПредпринимателяПоИНН";
			Если ВладелецФормы.Объект.ЮрФизЛицо=ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
				стрВариант=?(ВариантПоиска="ИНН", "РеквизитыЮрЛицаПоИНН", "РеквизитыЮрЛицПоНаименованию");
			КонецЕсли;
		КонецЕсли;
		ВыполнитьПоиск(стрВариант);
		
	ИначеЕсли Команда.Имя="ЗаполнитьДанныеКонтрагента" Тогда
		Если Не ВладелецФормы=Неопределено Тогда
			ВладелецФормы.Объект.КПП=ЗначениеРеквизитаКонтрагента("КПП");
			ВладелецФормы.Объект.Наименование=ЗначениеРеквизитаКонтрагента("Наименование");
			ВладелецФормы.Объект.НаименованиеПолное=ЗначениеРеквизитаКонтрагента("НаименованиеСокращенное");
			ВладелецФормы.Объект.ЕГРН=ЗначениеРеквизитаКонтрагента("РегистрационныйНомер");

			//Контактная информация (Юридический адрес)
			ЮридическийАдрес=тпДанные_НайтиЗначение("ЮридическийАдрес");
			Если ЗначениеЗаполнено(ЮридическийАдрес) Тогда
				ЗаписатьКонтактнуюИнформацию(ЮридическийАдрес, ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"), ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента"));
			КонецЕсли;
			// Заполнение телефона
			Телефон=тпДанные_НайтиЗначение("Телефон");
			Если ЗначениеЗаполнено(Телефон) Тогда
				ЗаписатьКонтактнуюИнформацию(Телефон, ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"), ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента"));
			КонецЕсли; 
			// Заполнение контактного лица
			//***ДополнительныеСвойства.Вставить("КонтактноеЛицоКонтрагента", РК.Руководитель);
		КонецЕсли; 
	КонецЕсли;	 
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоиск(стрВариант)
	Если стрВариант="РеквизитыЮрЛицаПоИНН" Тогда
		Реквизиты=Обработки.ПроверкаИНН.РеквизитыЮрЛицаПоИНН(СокрЛП(Объект.ИНН));

	ИначеЕсли стрВариант="РеквизитыПредпринимателяПоИНН" Тогда
		Реквизиты=Обработки.ПроверкаИНН.РеквизитыПредпринимателяПоИНН(СокрЛП(Объект.ИНН));
		
	ИначеЕсли стрВариант="РеквизитыЮрЛицПоНаименованию" Тогда
		Реквизиты=Обработки.ПроверкаИНН.РеквизитыЮрЛицПоНаименованию(СокрЛП(Объект.ИНН), СокрЛП(Объект.КодРегионаПоиска), СокрЛП(Объект.АдресПоиска));
	КонецЕсли;
	Если НЕ ТипЗнч(Реквизиты)=Тип("Структура") Тогда Возврат; КонецЕсли;

	дзБуфер=РеквизитФормыВЗначение("дзДанные");
	дзБуфер.Строки.Очистить();
	Если Реквизиты.Свойство("КоличествоНайденных") Тогда
		Для каждого СтрокаКоллекции Из Реквизиты.РеквизитыЮрЛиц Цикл
			НоваяСтрока=дзБуфер.Строки.Добавить();
			НоваяСтрока.Представление=СтрокаКоллекции.Наименование;
			дзДанные_ЗаполнитьВетку(НоваяСтрока, СтрокаКоллекции);
		КонецЦикла; 
		ДоступностьКнопки=Ложь;
	Иначе
		дзДанные_ЗаполнитьВетку(дзБуфер, Реквизиты);
		ДоступностьКнопки=Истина;
	КонецЕсли; 
	ЗначениеВРеквизитФормы(дзБуфер, "дзДанные");
	
	Элементы.дзДанныеЗаполнитьДанныеКонтрагента.Доступность=ДоступностьКнопки;
КонецПроцедуры	 

&НаСервере
Процедура ЗаписатьКонтактнуюИнформацию(Значение, Тип, Вид)
	Если Объект.Контрагент.Пустая() Тогда Возврат; КонецЕсли;
	//МенеджерЗаписи=РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	//МенеджерЗаписи.Объект=Объект.Контрагент;
	//МенеджерЗаписи.Тип=Тип;
	//МенеджерЗаписи.Вид=Вид;
	//МенеджерЗаписи.Прочитать();
	//Если НЕ МенеджерЗаписи.Выбран() Тогда
	//	МенеджерЗаписи.Объект=Объект.Контрагент;
	//	МенеджерЗаписи.Тип=Тип;
	//	МенеджерЗаписи.Вид=Вид;		
	//КонецЕсли;
	//МенеджерЗаписи.Представление=Значение;
	//МенеджерЗаписи.Записать();

	НаборЗаписей=РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Объект.Контрагент);
	НаборЗаписей.Отбор.Тип.Установить(Тип);
	НаборЗаписей.Прочитать();

	Обработки.ПроверкаИНН.ЗаполнитьЭлементКонтактнойИнформации(НаборЗаписей, Значение, Вид);
	
	//МенеджерЗаписи.Тип=Тип;
	//МенеджерЗаписи.Вид=Вид;
	НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВариантПоиска_ПриИзменении(Элемент)
	Элементы.ИНН.Видимость=ВариантПоиска="ИНН";
	Элементы.КодРегионаПоиска.Видимость=НЕ ВариантПоиска="ИНН";
	Элементы.АдресПоиска.Видимость=НЕ ВариантПоиска="ИНН";
	Элементы.ДанныеКонтрагентаПоИНН.Заголовок="Найти данные контрагента по "+?(ВариантПоиска="ИНН", "ИНН", "коду региона\адресу");
КонецПроцедуры
 
////////////////////////////////////////////////////////////////////////////////
// Обработчики событий табличной части "Данные"

&НаСервере
Функция ЗначениеРеквизитаКонтрагента(Идентификатор)
	дзБуфер=РеквизитФормыВЗначение("дзДанные");
	РезультатПоиска=дзБуфер.Строки.Найти(Идентификатор, "Идентификатор", Истина);
	Возврат ?(РезультатПоиска=Неопределено, Неопределено, РезультатПоиска.Значение); 
КонецФункции

&НаСервере
Функция тпДанные_НайтиЗначение(Идентификатор)
	дзБуфер=РеквизитФормыВЗначение("дзДанные");
	РезультатПоиска=дзБуфер.Строки.Найти(Идентификатор, "Идентификатор", Истина);
	Возврат ?(РезультатПоиска=Неопределено, "", ?(ТипЗнч(РезультатПоиска.Данные)=Тип("Структура"), РезультатПоиска.Данные, РезультатПоиска.Значение)); 
КонецФункции

&НаСервере
Процедура дзДанные_ЗаполнитьВетку(Ветка, Реквизиты)
	Соответсвия=Новый Структура;
	Соответсвия.Вставить("ИНН", "ИНН");
	Соответсвия.Вставить("КПП", "КПП");
	Соответсвия.Вставить("Наименование", "Наименование");
	Соответсвия.Вставить("НаименованиеПолное", "Наименование полное");
	Соответсвия.Вставить("НаименованиеСокращенное", "Наименование сокращенное");
	Соответсвия.Вставить("РегистрационныйНомер", "Регистрационный номер");
	Соответсвия.Вставить("ПравоваяФорма", "Правовая форма");
	Соответсвия.Вставить("ЮридическийАдрес", "Юридический адрес");
	Соответсвия.Вставить("РегистрацияВНалоговомОргане", "Регистрация в налоговом органе");
	Соответсвия.Вставить("ДатаРегистрации", "Дата регистрации");
	Соответсвия.Вставить("РегистрацияВПенсионномФонде", "Регистрация в пенсионном фонде");
	Соответсвия.Вставить("РегистрационныйНомерПФР", "Регистрационный номер");
	Соответсвия.Вставить("КодОрганаПФР", "Код органа");
	Соответсвия.Вставить("НаименованиеОрганаПФР", "Наименование органа");
	Соответсвия.Вставить("РегистрацияВФСС", "Регистрация");
	Соответсвия.Вставить("РегистрационныйНомерФСС", "Регистрационный номер");
	Соответсвия.Вставить("КодПодчиненности", "Код подчиненности");
	Соответсвия.Вставить("КодОрганаФСС", "Код органа");
	Соответсвия.Вставить("НаименованиеОрганаФСС", "Наименование органа");
	Соответсвия.Вставить("КодОКВЭД", "Код ОКВЭД");
	Соответсвия.Вставить("ОписаниеОшибки", "Описание ошибки");

	Для каждого СтрокаКоллекции1 Из Реквизиты Цикл
		СтрокаДерева=Ветка.Строки.Добавить();
		СтрокаДерева.Идентификатор=СтрокаКоллекции1.Ключ;
		Попытка СтрокаДерева.Представление=Соответсвия[СтрокаКоллекции1.Ключ];
		Исключение СтрокаДерева.Представление=СтрокаДерева.Идентификатор;
		КонецПопытки;
		СтрокаДерева.Значение=СтрокаКоллекции1.Значение;
		СтрокаДерева.Данные=СтрокаКоллекции1.Значение; //***
		Если ТипЗнч(СтрокаКоллекции1.Значение)=Тип("Структура") Тогда
			Для каждого СтрокаКоллекции2 Из СтрокаКоллекции1.Значение Цикл
				НоваяСтрока=СтрокаДерева.Строки.Добавить();
				НоваяСтрока.Идентификатор=СтрокаКоллекции2.Ключ;
				Попытка НоваяСтрока.Представление=Соответсвия[СтрокаКоллекции2.Ключ];
				Исключение НоваяСтрока.Представление=НоваяСтрока.Идентификатор;
				КонецПопытки; 
				
				НоваяСтрока.Значение=СтрокаКоллекции2.Значение;
				НоваяСтрока.Данные=СтрокаКоллекции2.Значение; //***
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВариантПоиска="ИНН";
	Если Не ВладелецФормы=Неопределено Тогда
		Объект.ИНН=ВладелецФормы.Объект.ИНН;
		Объект.Контрагент=ВладелецФормы.Объект.Ссылка;
	КонецЕсли;
КонецПроцедуры
