
&НаКлиенте
Процедура АтрибутыФормы_ПриИзменении(Элемент)
	Если Элемент.Имя="БанковскийСчет" Тогда
		Если ЗначениеЗаполнено(Запись.БанковскийСчет) Тогда
			Запись.Организация = ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Запись.БанковскийСчет, "Владелец");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АтрибутыФормы_Открытие(Элемент, СтандартнаяОбработка)
	Если Элемент.Имя="ФайлЗагрузки" Тогда
		СтандартнаяОбработка = Ложь;
		ФайлНаДиске = Новый Файл(Запись.ФайлЗагрузки);
		Если Не ФайлНаДиске.Существует() Тогда
			ПоказатьПредупреждение(, "Не найден файл!", 20, "Внимание");
			Возврат;
		КонецЕсли;
		Текст = Новый ТекстовыйДокумент();
		Если Запись.Кодировка = "DOS" Тогда
			Кодир = КодировкаТекста.OEM;
		Иначе
			Кодир = КодировкаТекста.ANSI;
		КонецЕсли;
		Текст.Прочитать(Запись.ФайлЗагрузки, Кодир);
		Текст.Показать(Элемент.Имя,Запись.ФайлЗагрузки);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура  АтрибутыФормы_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элемент.Имя="ФайлЗагрузки" Тогда
		ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		
		ДиалогФыбораФайла.Фильтр                      = "Текстовый файл (*.txt)|*.txt";
		ДиалогФыбораФайла.Заголовок                   = "Выберите файл для загрузки данных из клиента банка";
		ДиалогФыбораФайла.ПредварительныйПросмотр     = Ложь;
		ДиалогФыбораФайла.Расширение                  = "txt";
		ДиалогФыбораФайла.ИндексФильтра               = 0;
		ДиалогФыбораФайла.ПолноеИмяФайла              = Запись.ФайлЗагрузки;
		ДиалогФыбораФайла.ПроверятьСуществованиеФайла = Ложь;
		
		Если ДиалогФыбораФайла.Выбрать() Тогда
			Запись.ФайлЗагрузки = ДиалогФыбораФайла.ПолноеИмяФайла;
		КонецЕсли;
	ИначеЕсли Элемент.Имя="ФайлВыгрузки" Тогда
		ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		
		ДиалогФыбораФайла.Фильтр                      = "Текстовый файл (*.txt)|*.txt";
		ДиалогФыбораФайла.Заголовок                   = "Выберите файл для выгрузки данных из клиента банка";
		ДиалогФыбораФайла.ПредварительныйПросмотр     = Ложь;
		ДиалогФыбораФайла.Расширение                  = "txt";
		ДиалогФыбораФайла.ИндексФильтра               = 0;
		ДиалогФыбораФайла.ПолноеИмяФайла              = Запись.ФайлВыгрузки;
		ДиалогФыбораФайла.ПроверятьСуществованиеФайла = ложь;
		
		Если ДиалогФыбораФайла.Выбрать() Тогда
			Запись.ФайлВыгрузки = ДиалогФыбораФайла.ПолноеИмяФайла;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
