//Оставлены для совместимости с рег.отчетами

Функция СчетМожноИспользоватьВПроводках(Счет, Сообщать = Истина) Экспорт
	//Если НЕ ТипЗнч(Счет)=Тип("ПланСчетовСсылка.Хозрасчетный") Тогда	Возврат Ложь; КонецЕсли;
	//Если Счет=ПланыСчетов.Хозрасчетный.ПустаяСсылка() Тогда Возврат Истина; КонецЕсли;

	//Если Счет.ЗапретитьИспользоватьВПроводках Тогда
	//	Если Сообщать Тогда
	//		Предупреждение("Счет "+СокрЛП(Счет)+" """+Счет.Наименование+""" нельзя использовать в проводках.");
	//	КонецЕсли;
	//	Возврат Ложь; // Счет использовать в проводках нельзя
	//КонецЕсли;
	Возврат Истина; // Счет можно использовать в проводках 
КонецФункции

Функция ВернутьШестнадцатиричноеПредставлениеЦвета(ВыбранныйЦвет) Экспорт
	Если ТипЗнч(ВыбранныйЦвет) <> Тип("Цвет") Тогда Возврат ""; КонецЕсли;
	
	Красный	= ДесятичноеВШестнадцатиричное(ВыбранныйЦвет.Красный);
	Зеленый	= ДесятичноеВШестнадцатиричное(ВыбранныйЦвет.Зеленый);
	Синий	= ДесятичноеВШестнадцатиричное(ВыбранныйЦвет.Синий);
	
	Возврат "#"+Красный+Зеленый+Синий;	
КонецФункции

Функция ДесятичноеВШестнадцатиричное(Источник) Экспорт
	ШеснадцатиричныеСимволы = "0123456789ABCDEF";
	
	Если Источник < 0 Тогда Возврат "00"; КонецЕсли;
	Если Источник > 255 Тогда Возврат "FF"; КонецЕсли;
	
	ПервыйСимвол = Цел(Источник / 16) + 1;
	ВтройСимвол	 = Источник % 16;

	Возврат Сред(ШеснадцатиричныеСимволы, ПервыйСимвол, 1) + Сред(ШеснадцатиричныеСимволы, ВтройСимвол, 1);	
КонецФункции