&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	Если Команда.Имя="Заполнить" Тогда
		ОткрытьФорму("РегистрСведений.НастройкиФормыСписка.Форма.ФормаЗаполнения",, ЭтаФорма, УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	ИначеЕсли Команда.Имя="ЗаполнитьПоУмолчанию" Тогда
		ЗаполнитьПоУмолчанию();
		Элементы.Список.Обновить();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчанию()
	РегистрыСведений.НастройкиФормыСписка.ЗаполнитьПоУмолчанию("Документ");
	РегистрыСведений.НастройкиФормыСписка.ЗаполнитьПоУмолчанию("Справочник");
	РегистрыСведений.НастройкиФормыСписка.ЗаполнитьПоУмолчанию("ЖурналДокументов");
	РегистрыСведений.НастройкиФормыСписка.ЗаполнитьПоУмолчанию("ПланСчетов");
	РегистрыСведений.НастройкиФормыСписка.ЗаполнитьПоУмолчанию("Задача");
КонецПроцедуры