Процедура тзНастройки_Добавить(Имя, Представление, Значение="")
	НоваяСтрока=тзНастройки.Добавить();
	НоваяСтрока.Имя=Имя;
	НоваяСтрока.Представление=Представление;
	НоваяСтрока.Значение=Значение;
КонецПроцедуры

Процедура тпНастройки_Инициализация()
	тзНастройки.Очистить();
	
	Если Запись.Сервис=ПредопределенноеЗначение("Перечисление.ИнтернетСервисы.Yandex") Тогда
		тзНастройки_Добавить("ТокенПредиктор", "Токен предиктор");
		тзНастройки_Добавить("ТокенПереводчик", "Токен переводчик");
		//тзНастройки_Добавить("OAuthАвторизация_ID", "OAuth - Авторизация (ID)");
		//тзНастройки_Добавить("OAuthАвторизация_Пароль", "OAuth - Авторизация (Пароль)");

	ИначеЕсли Запись.Сервис=ПредопределенноеЗначение("Перечисление.ИнтернетСервисы.Google") Тогда
		
	ИначеЕсли Запись.Сервис=ПредопределенноеЗначение("Перечисление.ИнтернетСервисы.Dadata") Тогда
		тзНастройки_Добавить("Токен", "Токен");
		тзНастройки_Добавить("СекретныйТокен", "Секретный токен");
		
	ИначеЕсли Запись.Сервис=ПредопределенноеЗначение("Перечисление.ИнтернетСервисы.C1") Тогда
	
	КонецЕсли; 
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов формы

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="Сервис" Тогда
		тпНастройки_Инициализация();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	тпНастройки_Инициализация();

	СтруктураДанных=ТекущийОбъект.Настройка.Получить();
	Если ТипЗнч(СтруктураДанных)=Тип("Структура") Тогда
		Для каждого СтрокаКоллекции Из СтруктураДанных Цикл
			МассивСтрок=тзНастройки.НайтиСтроки(Новый Структура("Имя", СтрокаКоллекции.Ключ));
			Если МассивСтрок.Количество()=0 Тогда Продолжить; КонецЕсли;
			МассивСтрок[0].Значение=СтрокаКоллекции.Значение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Структура=Новый Структура;
	Для каждого СтрокаКоллекции Из тзНастройки Цикл
		Структура.Вставить(СтрокаКоллекции.Имя, СтрокаКоллекции.Значение);
	КонецЦикла;
	ТекущийОбъект.Настройка=Новый ХранилищеЗначения(Структура, Новый СжатиеДанных(9));
КонецПроцедуры

