&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОписаниеОповещения=Новый ОписаниеОповещения("ОбработчикОповещение_ВыборДаты", ЭтотОбъект, Новый Структура("Форма", ПараметрыВыполненияКоманды.Источник));

	ПараметрыФормы=Новый Структура("Дата", ТекущаяДата());
	ОткрытьФорму("ОбщаяФорма.ВыборДаты", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещение_ВыборДаты(Параметр1, Параметр2) Экспорт
	Если Параметр1=Неопределено Тогда Возврат; КонецЕсли;

	Период=Параметр2.Форма.Элементы.ДинамическийСписок.Период;
	Период.ДатаНачала=НачалоДня(Параметр1);
	Период.ДатаОкончания=КонецДня(Параметр1);

	Параметр2.Форма.Элементы.ДинамическийСписок.Обновить();
КонецПроцедуры
