Процедура УстановитьЗначение(Идентификатор, Значение, СоздаватьПриОтсутствии=Истина) Экспорт
	РезультатПоиска=Справочники.КлассификаторКонстант.НайтиПоКоду(Идентификатор);
	Если НЕ РезультатПоиска.Пустая() Тогда
		Объект=РезультатПоиска.ПолучитьОбъект();
	ИначеЕсли СоздаватьПриОтсутствии Тогда
		Объект=Справочники.КлассификаторКонстант.СоздатьЭлемент();
		Объект.Код=Идентификатор;
		Объект.Наименование=Идентификатор;
		Объект.Родитель=Справочники.КлассификаторКонстант.Пользовательские;
	КонецЕсли;

	Если Не Объект=Неопределено Тогда		
		Объект.ЗначениеКонстанты=Значение;
		Объект.Записать();
	Иначе
		Сообщить("Не найдена пользовательская константа <"+Идентификатор+">");
	КонецЕсли; 
КонецПроцедуры

Функция Значение(Идентификатор, ЗначениеПоУмолчанию=Неопределено, СообщатьПриОтсутствии=Ложь) Экспорт
	РезультатПоиска=Справочники.КлассификаторКонстант.НайтиПоКоду(Идентификатор);
	Если РезультатПоиска.Пустая() Тогда
		Если СообщатьПриОтсутствии Тогда
			Сообщить("Не найдена пользовательская константа <"+Идентификатор+">");
		КонецЕсли;
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Возврат РезультатПоиска.ЗначениеКонстанты;
КонецФункции