////////////////////////////////////////////////////////////////////////////////
//Управление печатными формами

Процедура СтруктураПечатныхФорм(Структура) Экспорт
	Структура.Вставить("РеквизитыОрганизации" , "Реквизиты организации");
КонецПроцедуры

Функция Печать_РеквизитыОрганизации(СтруктураПараметров)
	СсылкаНаОбъект=СтруктураПараметров.СсылкаНаОбъект;
	ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Организации_Реквизиты";
	
	Макет = ПолучитьМакет("Реквизиты");
	Секция = Макет.ПолучитьОбласть("Шапка_Общие");
	ТабДокумент.Вывести(Секция);
	Секция = Макет.ПолучитьОбласть("Строка_Общие");
	Если ЗначениеЗаполнено(СсылкаНаОбъект.ЮрФизЛицо) Тогда
		Если СсылкаНаОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			Секция.Параметры.ЮрФизЛицо = "Юридическое лицо";
		Иначе
			Секция.Параметры.ЮрФизЛицо = "Физическое лицо";
		КонецЕсли; 
	Иначе
		Секция.Параметры.ЮрФизЛицо = "Не задано";
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект.ГоловнаяОрганизация) Тогда
		СтрокаГоловногоКонтрагента = Строка(СсылкаНаОбъект.ГоловнаяОрганизация);
		Если ЗначениеЗаполнено(СсылкаНаОбъект.ГоловнаяОрганизация.ЮрФизЛицо) Тогда
			Если СсылкаНаОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
				СтрокаГоловногоКонтрагента = СтрокаГоловногоКонтрагента + " (Юридическое лицо)";
			Иначе //Физическое лицо
				СтрокаГоловногоКонтрагента = СтрокаГоловногоКонтрагента + " (Физическое лицо)";
			КонецЕсли; 
		КонецЕсли; 
		Секция.Параметры.ГоловнаяОрганизация = СтрокаГоловногоКонтрагента;
	//	Секция.Области.ГоловнаяОрганизация.Расшифровка = СсылкаНаОбъект.ГоловнаяОрганизация;
	Иначе
		Секция.Параметры.ГоловнаяОрганизация = "Не задан";
	КонецЕсли;
	
	СтрокаВидовДеятельности = "";
	Если НЕ ПустаяСтрока(СсылкаНаОбъект.НаименованиеОКВЭД) Тогда
		Секция.Параметры.ВидыДеятельности = СсылкаНаОбъект.НаименованиеОКВЭД;
	КонецЕсли;
	ТабДокумент.Вывести(Секция);
	
	//Секция = Макет.ПолучитьОбласть("Шапка_ИнформацияКонтрагента");
	//Таб.Вывести(Секция, 2);
	
	Если СсылкаНаОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда //Юридическое лицо
		
		Секция = Макет.ПолучитьОбласть("ИнформацияЮрЛицо");
		Секция.Параметры.ИНН       = СсылкаНаОбъект.ИНН;
		Секция.Параметры.КПП       = СсылкаНаОбъект.КПП;
		Секция.Параметры.КодПоОКПО = СсылкаНаОбъект.КодПоОКПО;
		
	Иначе //Физическое лицо
		
		Секция = Макет.ПолучитьОбласть("ИнформацияФизЛицо");
		Секция.Параметры.ИНН                = СсылкаНаОбъект.ИНН;
		Секция.Параметры.ДокументУдЛичность = СсылкаНаОбъект.ДокументУдостоверяющийЛичность;
		
	КонецЕсли; 
	
	ТабДокумент.Вывести(Секция);
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект.ОсновнойБанковскийСчет) тогда
		Секция = Макет.ПолучитьОбласть("БанкКонтрагента");
		Секция.Параметры.НомерСчета = СсылкаНаОбъект.ОсновнойБанковскийСчет.НомерСчета;
		Если ЗначениеЗаполнено(СсылкаНаОбъект.ОсновнойБанковскийСчет.Банк) Тогда
			Секция.Параметры.Банк       = СсылкаНаОбъект.ОсновнойБанковскийСчет.Банк.ПолноеНаименование() + " " + СсылкаНаОбъект.ОсновнойБанковскийСчет.Банк.Город;
			Секция.Параметры.Бик        = СсылкаНаОбъект.ОсновнойБанковскийСчет.Банк.Код;
			Секция.Параметры.КорСчет    = СсылкаНаОбъект.ОсновнойБанковскийСчет.Банк.КоррСчет;
		КонецЕсли; 
		ТабДокумент.Вывести(Секция);
	КонецЕсли;
	
	Секция = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокумент.Вывести(Секция);
	
	//Контактная информация контрагента
	Секция = Макет.ПолучитьОбласть("Шапка_КонтактнаяИнформация");
	ТабДокумент.Вывести(Секция);
	
	СтруктураКонтактнойИнформации=КонтактнаяИнформацияСервер.СведенияОЮрФизЛице(СсылкаНаОбъект);
	Для каждого СтрокаКИ Из СтруктураКонтактнойИнформации Цикл
		Секция = Макет.ПолучитьОбласть("Строка_КонтактнаяИнформация");
		Секция.Параметры.ВидКИ = СтрокаКИ.Ключ;
		Секция.Параметры.Значение = СтрокаКИ.Значение;
		ТабДокумент.Вывести(Секция);
	КонецЦикла; 
	
	Секция = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокумент.Вывести(Секция);
	
	
	//Контактные лица контрагента
	Секция = Макет.ПолучитьОбласть("Шапка_КонтактныеЛица");
	ТабДокумент.Вывести(Секция);
	ТаблицаКЛ = ПечатныеФормыСервер.ОтветственныеЛицаОрганизации(СсылкаНаОбъект, ТекущаяДата());
	Секция = Макет.ПолучитьОбласть("Строка_КонтактныеЛица");
	ПредставлениеКонтактногоЛица = "Руководитель"; //СокрЛП(СтрокаКЛ.Фамилия) + " "+ СокрЛП(СтрокаКЛ.Имя) + " " + СокрЛП(СтрокаКЛ.Отчество);
	Секция.Параметры.ПредставлениеКонтактногоЛица   = ПредставлениеКонтактногоЛица;
	ТабДокумент.Вывести(Секция);
	
	СекцияКИ = Макет.ПолучитьОбласть("КонтИнф_КонтактныеЛица");
	Если ПустаяСтрока(ТаблицаКЛ.РуководительДолжность) Тогда
		СекцияКИ.Параметры.ВидКИ = ПредставлениеКонтактногоЛица;
	Иначе
		СекцияКИ.Параметры.ВидКИ = ТаблицаКЛ.РуководительДолжность; //?(ТипЗнч(СтрокаКИ.Вид)=Тип("Строка"),СокрЛП(СтрокаКИ.Вид),СтрокаКИ.Вид.Наименование);
	КонецЕсли;
	СекцияКИ.Параметры.Значение = ТаблицаКЛ.Руководитель; //СтрокаКИ.Представление;
	ТабДокумент.Вывести(СекцияКИ);
	Секция = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТабДокумент.Вывести(Секция);
	
	ТабДокумент.АвтоМасштаб=Истина;
	ТабДокумент.ОтображатьСетку=Ложь;
	ТабДокумент.ОтображатьЗаголовки=Ложь;
	Возврат ТабДокумент;
КонецФункции

Функция Печать(СтруктураПараметров, КоличествоЭкземпляров=1, НаПринтер=Ложь) Экспорт
    ТабДокумент=Неопределено;
	ИмяМакета=СтруктураПараметров.ИмяМакета;
	//СсылкаНаОбъект=СтруктураПараметров.СсылкаНаОбъект;

	Если ИмяМакета="РеквизитыОрганизации" Тогда
		ТабДокумент=Печать_РеквизитыОрганизации(СтруктураПараметров);
	КонецЕсли;

	Возврат ТабДокумент;
КонецФункции
