Процедура ОбновитьИконки() Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ИсточникДанных.Родитель Как Родитель
	|ИЗ
	|	Справочник.Подразделения КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Родитель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|";
	тзДанные=Запрос.Выполнить().Выгрузить();
	тзДанные.Свернуть("Родитель", "");
	Для каждого СтрокаКоллекции Из тзДанные Цикл
		Объект=СтрокаКоллекции.Родитель.ПолучитьОбъект();
		Объект.ИндексКартинки=1;
		Объект.Записать();
	КонецЦикла;
КонецПроцедуры
 