Процедура ПриИзменении(Форма, Элемент) Экспорт
	
КонецПроцедуры 

Процедура НачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтоПроводка=Ложь) Экспорт
	Если Элемент.Имя="Подвид" Или ЭтоПроводка Тогда
		МассивПараметров=Новый Массив(); СтруктураОбъекта=УправлениеКонфигурациейСервер.СтруктураОбъекта(Форма.ИмяФормы);
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Владелец", УправлениеКонфигурациейСервер.ИдентификаторОбъектовМетаданныхСсылка(СтруктураОбъекта.Тип+"."+СтруктураОбъекта.Вид)));
		Форма.Элементы[Элемент.Имя].ПараметрыВыбора=Новый ФиксированныйМассив(МассивПараметров);
	КонецЕсли;
КонецПроцедуры

Процедура Нажатие(Форма, Элемент, СтандартнаяОбработка) Экспорт
	//ОбщегоНазначенияКлиент.ФормаПоЭлементу(Элемент);
	Если Элемент.Имя="ИнфНадписьДолга" Тогда
		УправлениеДиалогамиКлиент.ОбновитьНадписиДолга(Форма, Ложь);

	ИначеЕсли Элемент.Имя="Ответственный" Тогда
		ПараметрыФормы=Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, Элемент, Форма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	ИначеЕсли Элемент.Имя="Время" Тогда
		ПараметрыФормы=Новый Структура("Дата,ПоказыватьВремя", Форма.Объект.Дата, Истина); СтандартнаяОбработка=Ложь;	
		ОткрытьФорму("ОбщаяФорма.ВыборДаты", ПараметрыФормы, Форма.Элементы.Дата, Форма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

Процедура Открытие(Форма, Элемент, СтандартнаяОбработка) Экспорт
	//Если ТипЗнч(Форма.Объект[Элемент.Имя])=Тип("Строка") Тогда
		//Модуль=ОбщегоНазначенияКлиент.ОбщийМодуль("ЯндексСервисыКлиент");
		//Если НЕ Модуль=Неопределено Тогда
		//	СтандартнаяОбработка=Ложь;
		//	Модуль.ПоказатьФормуРедактированияТекста(Элемент.ТекстРедактирования, Форма, "Объект."+Элемент.Имя, Элемент.Заголовок);
		//КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

Процедура АвтоПодбор(Форма, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) Экспорт
	//Модуль=ОбщегоНазначенияКлиент.ОбщийМодуль("ЯндексСервисыКлиент");
	//Если Модуль=Неопределено Тогда Возврат; КонецЕсли; 
	//Модуль.Предиктор_АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	//Модуль=ОбщегоНазначенияКлиент.ОбщийМодуль("ЯндексСервисыКлиент");
	//Если Модуль=Неопределено Тогда Возврат; КонецЕсли; 
	//Модуль.Предиктор_ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, Форма.Объект, Элемент.Имя);
КонецПроцедуры

Процедура ОбработкаНавигационнойСсылки(Форма, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

