////////////////////////////////////////////////////////////////////////////////
// Обработчики событий днамического списка "Динамический список"

&НаКлиенте
Процедура ДинамическийСписок_ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Ссылка=?(Объект=Неопределено, ВладелецФормы, Объект);
	КонтактнаяИнформацияКлиент.ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр, ЭтаФорма, Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписок_ПередНачаломИзменения(Элемент, Отказ)
	КонтактнаяИнформацияКлиент.ПередНачаломИзменения(Элемент, Отказ, ЭтаФорма);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Объект", Объект) Тогда
		Элементы.Объект.Видимость=Ложь;
	КонецЕсли;
КонецПроцедуры