Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

Процедура ВыполнитьПриход() Экспорт
	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);
КонецПроцедуры

Процедура ВыполнитьРасход() Экспорт
	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);
КонецПроцедуры

Процедура ВыполнитьДвижения() Экспорт
	Загрузить(мТаблицаДвижений);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
//	РегистрыСведений.НастройкаЗаписейРегистров.ВыполнитьНастройки(ЭтотОбъект, Отказ, Замещение);
КонецПроцедуры