&НаСервере
Функция ТипЦенПлановойСебестоимости()
	Возврат Константы.ТипЦенПлановойСебестоимостиНоменклатуры.Получить();
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьСтруктураТабличнойЧасти(ИмяТабличнойЧасти)
	Структура=Новый Структура;
	Для каждого мдРеквизит Из Метаданные.Документы.ВыпускПродукции.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты Цикл
		Структура.Вставить(мдРеквизит.Имя);
	КонецЦикла; 
	Возврат Структура;
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	СтруктураВозврата=СформироватьСтруктураТабличнойЧасти(ИмяТЧ);
	СтруктураВозврата.Вставить("ИмяТЧ", ИмяТЧ);
	СтруктураВозврата.Вставить("Редактирование", Редактирование);
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, ЭтаФорма);
	ЭтаФорма.Закрыть(СтруктураВозврата);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Редактирование=Ложь;
	Если Не Параметры.ДанныеСтроки=Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ДанныеСтроки);
		Редактирование=Истина;
		//ПоказатьИзображениеТовара();
	КонецЕсли; 
	ИмяТЧ=Параметры.ИмяТЧ;
	ВидОбъекта=Параметры.ИмяТЧ;
	
	Если Качество.Пустая() Тогда Качество=Справочники.Качество.Новый; КонецЕсли; 
	
	стрЗаголовок=стрЗаменить(ВидОбъекта, "СтатьяЗатрат", "Статья затрат");
	стрЗаголовок=стрЗаменить(стрЗаголовок, "ПобочныеПродукты", "Побочные продукты");
	стрЗаголовок=стрЗаменить(стрЗаголовок, "Комплектующие", "Комплектующие");
	Элементы.ГруппаИзделие.Заголовок=стрЗаголовок;
	
	Заголовок="Редактирование "+?(стрЗаголовок="Товары","продукции", стрЗаголовок);
	
	Если ВидОбъекта="Комплектующая" Тогда
		Элементы.ГруппаЗаказСтоимость.Заголовок="Заказ №";
		Элементы.ЗаказПокупателя.Видимость=Истина;
		Элементы.ГруппаСтоимость.Видимость=Ложь;
		Видимость=Истина;
	Иначе //Изделие или побочный продукт
		Элементы.ГруппаЗаказСтоимость.Заголовок="Стоимость изделия (плановая)";
		Элементы.ЗаказПокупателя.Видимость=Ложь;
		Элементы.ГруппаСтоимость.Видимость=Истина;
		Видимость=Ложь;
	КонецЕсли; 

	Элементы.СтатьяЗатрат.Видимость=ВидОбъекта="Комплектующие" ИЛИ ВидОбъекта="ПобочныеПродукты";
	Элементы.ЗаказНаПроизводство.Видимость=НЕ ВидОбъекта="Комплектующие";
	Элементы.СпецификацияНоменклатуры.Доступность=НЕ ВидОбъекта="Комплектующие";
КонецПроцедуры

&НаКлиенте
Процедура АтрибутФормы_ПриИзменении(Элемент)
	стрИмя=Элемент.Имя; ПересчитатьОстаток=Истина;
	
	Если стрИмя="Номенклатура" Тогда
		Если Номенклатура=Неопределено Тогда Возврат; КонецЕсли; 
		Если ТипЗнч(Номенклатура)=Тип("СправочникСсылка.ОбъектыСтроительства") Тогда Возврат; КонецЕсли; 
			
		текНоменклатура=Номенклатура;
		Если ТипЗнч(текНоменклатура)=Тип("СправочникСсылка.СтатьиЗатрат") Тогда
			текНоменклатура=текНоменклатура.Номенклатура;
		КонецЕсли;

		ЕдиницаИзмеренияНом=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(текНоменклатура,"ЕдиницаХраненияОстатков");
		СтруктураЕдиницаИзмерения=ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта(ЕдиницаИзмеренияНом,"Владелец,Коэффициент");
		
		Коэффициент=СтруктураЕдиницаИзмерения.Коэффициент;
		Если текНоменклатура=СтруктураЕдиницаИзмерения.Владелец Тогда
			ЕдиницаИзмерения=ЕдиницаИзмеренияНом;
			Коэффициент=СтруктураЕдиницаИзмерения.Коэффициент;
		КонецЕсли;

		
		ВладелецСерияНоменклатуры=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(СерияНоменклатуры,"Владелец");
		Если Не текНоменклатура=ВладелецСерияНоменклатуры Тогда
			СерияНоменклатуры=Неопределено;
		КонецЕсли;

		ВладелецХарактеристикаНоменклатуры=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ХарактеристикаНоменклатуры,"Владелец");
		Если Не текНоменклатура=ВладелецХарактеристикаНоменклатуры Тогда
			ХарактеристикаНоменклатуры=Неопределено;
		КонецЕсли;
		
		ВладелецСпецификацияНоменклатуры=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(СпецификацияНоменклатуры,"Владелец");
		Если Не текНоменклатура=ВладелецСпецификацияНоменклатуры Тогда
			СпецификацияНоменклатуры=Неопределено;
		КонецЕсли;

		СтруктураТекНоменклатура=ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта(текНоменклатура,"НоменклатурнаяГруппа,СтатьяЗатрат,ОсновнаяСпецификация");
		
		Если НоменклатурнаяГруппа.Пустая() Тогда
			НоменклатурнаяГруппа=СтруктураТекНоменклатура.НоменклатурнаяГруппа;
		КонецЕсли;
		
		Если СтатьяЗатрат.Пустая() Тогда
			СтатьяЗатрат=СтруктураТекНоменклатура.СтатьяЗатрат;
		КонецЕсли;

		Если СпецификацияНоменклатуры.Пустая() Тогда
			СпецификацияНоменклатуры=СтруктураТекНоменклатура.ОсновнаяСпецификация;
		КонецЕсли;

		текТипЦен=?(ЭтаФорма.ВладелецФормы.Объект.ТипЦен.Пустая(), ТипЦенПлановойСебестоимости(), ЭтаФорма.ВладелецФормы.Объект.ТипЦен);
		Если Не текТипЦен.Пустая() Тогда
			ЦенаИзделия=ЦенообразованиеСервер.ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, текТипЦен, ЭтаФорма.ВладелецФормы.Объект.Дата, ЕдиницаИзмерения);
			СтоимостьУУ=ЦенаИзделия*Количество;
			СтоимостьНУ=ЦенаИзделия*Количество;
		КонецЕсли;

	ИначеЕсли стрИмя="ХарактеристикаНоменклатуры" Тогда
		Если ХарактеристикаНоменклатуры.Пустая() Тогда Возврат; КонецЕсли;
		
		ВладелецХарактеристикаНоменклатуры=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ХарактеристикаНоменклатуры,"Владелец");
		Если Не Номенклатура=ВладелецХарактеристикаНоменклатуры Тогда
			Номенклатура=ВладелецХарактеристикаНоменклатуры;
		КонецЕсли;
		
		ЕдиницаИзмеренияНом=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Номенклатура,"ЕдиницаХраненияОстатков");
		ЕдиницаИзмеренияКоэффициент=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ЕдиницаИзмеренияНом,"Коэффициент");
		
		ЕдиницаИзмерения = ЕдиницаИзмеренияНом;
		Коэффициент      = ЕдиницаИзмеренияКоэффициент;

	ИначеЕсли стрИмя="СерияНоменклатуры" Тогда
		Если СерияНоменклатуры.Пустая() Тогда Возврат; КонецЕсли; 
		ВладелецСерияНоменклатуры=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(СерияНоменклатуры,"Владелец");
		Если Не Номенклатура=ВладелецСерияНоменклатуры Тогда
			Номенклатура=ВладелецСерияНоменклатуры;
		КонецЕсли;
		ЕдиницаИзмеренияНом=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Номенклатура,"ЕдиницаХраненияОстатков");
		ЕдиницаИзмеренияКоэффициент=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ЕдиницаИзмеренияНом,"Коэффициент");
		
		ЕдиницаИзмерения = ЕдиницаИзмеренияНом;
		Коэффициент      = ЕдиницаИзмеренияКоэффициент;

	ИначеЕсли стрИмя="СпецификацияНоменклатуры" Тогда
		Если СпецификацияНоменклатуры.Пустая() Тогда Возврат; КонецЕсли; 
		ВладелецСпецификацияНоменклатуры=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(СпецификацияНоменклатуры,"Владелец");
		Если Не Номенклатура=ВладелецСпецификацияНоменклатуры Тогда
			Номенклатура=ВладелецСпецификацияНоменклатуры;
		КонецЕсли;
		ЕдиницаИзмеренияНом=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Номенклатура,"ЕдиницаХраненияОстатков");
		ЕдиницаИзмеренияКоэффициент=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ЕдиницаИзмеренияНом,"Коэффициент");
		
		ЕдиницаИзмерения = ЕдиницаИзмеренияНом;
		Коэффициент      = ЕдиницаИзмеренияКоэффициент;

	ИначеЕсли стрИмя="ЕдиницаИзмерения" Тогда
		ЕдиницаИзмеренияКоэффициент=ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения,"Коэффициент");
		Коэффициент=ЕдиницаИзмеренияКоэффициент;

	ИначеЕсли стрИмя="Количество" Тогда
		текТипЦен=?(ЭтаФорма.ВладелецФормы.Объект.ТипЦен.Пустая(), ТипЦенПлановойСебестоимости(), ЭтаФорма.ВладелецФормы.Объект.ТипЦен);
		Если Не текТипЦен.Пустая() Тогда
			ЦенаИзделия=ЦенообразованиеСервер.ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, текТипЦен, ЭтаФорма.ВладелецФормы.Объект.Дата, ЕдиницаИзмерения);
			СтоимостьУУ=ЦенаИзделия*Количество;
			СтоимостьНУ=ЦенаИзделия*Количество;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
