&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Запись.Организация.Пустая() Тогда
		Запись.Организация=УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Запись.Период=Дата(1,1,1) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата снятия с учета!",,,, Отказ);
	КонецЕсли;
	
	Если Запись.Организация.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана организация!",,,, Отказ);
	КонецЕсли;
	
	Если Запись.ОсновноеСредство.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано основное средство!",,,, Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период",           Запись.Период);
		Запрос.УстановитьПараметр("Организация",      Запись.Организация);
		Запрос.УстановитьПараметр("ОсновноеСредство", Запись.ОсновноеСредство);
		Запрос.Текст="
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(РегистрацияЗемельныхУчастков.ВидЗаписи) КАК ВидЗаписи
		|ИЗ
		|	РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗемельныхУчастков
		|ГДЕ
		|	РегистрацияЗемельныхУчастков.Период = &Период
		|	И РегистрацияЗемельныхУчастков.Организация = &Организация
		|	И РегистрацияЗемельныхУчастков.ОсновноеСредство = &ОсновноеСредство
		|";
		Выборка=Запрос.Выполнить().Выбрать();		
		Если Выборка.Следующий() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Формат(Запись.Период, "ДФ=dd.MM.yyyy") + " по основному средству <" + СокрЛП(Запись.ОсновноеСредство) + ">
			|уже есть запись <" + Выборка.ВидЗаписи + "> в организации <" + СокрЛП(Запись.Организация) + ">!",,,, Отказ);
		КонецЕсли;
	КонецЕсли;

	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Информация не записана.",,,, Отказ);
	КонецЕсли;
КонецПроцедуры

