#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив();	
	Если Количество()=1 Тогда
		Запись=Получить(0);
		Если Запись.ВидЗаписи=Перечисления.ВидЗаписиОРегистрации.СнятиеСРегистрационногоУчета Тогда
			МассивНепроверяемыхРеквизитов.Добавить("РегистрационныйЗнак");
			МассивНепроверяемыхРеквизитов.Добавить("ИдентификационныйНомер");
			МассивНепроверяемыхРеквизитов.Добавить("Марка");
			МассивНепроверяемыхРеквизитов.Добавить("ПостановкаНаУчетВНалоговомОргане");
			МассивНепроверяемыхРеквизитов.Добавить("КодВидаТранспортногоСредства");
			МассивНепроверяемыхРеквизитов.Добавить("НалоговаяБаза");
			МассивНепроверяемыхРеквизитов.Добавить("ЕдиницаИзмеренияНалоговойБазы");
			МассивНепроверяемыхРеквизитов.Добавить("НалоговаяСтавка");
			МассивНепроверяемыхРеквизитов.Добавить("НалоговаяЛьгота");
			МассивНепроверяемыхРеквизитов.Добавить("ЭкологическийКласс");
			МассивНепроверяемыхРеквизитов.Добавить("ВидЗаписи");
		КонецЕсли;
	КонецЕсли;	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;
КонецПроцедуры

#КонецЕсли