&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="ПоказатьПараметры" Тогда
		Элементы.дзСобытияСистемыПараметры.Видимость=ПоказатьПараметры;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий дерева "События системы"

&НаСервере
Процедура дзСобытияСистемы_Инициализация()
	дзБуфер=РеквизитФормыВЗначение("дзСобытияСистемы");
	
	Макет=Перечисления.СобытияСистемы.ПолучитьМакет("События");
	
	СтруктураДерева=Новый Структура;
	СтруктураДерева.Вставить("СобытияМодуляОбъекта", "События модуля объекта");
	СтруктураДерева.Вставить("СобытияМодуляФормыСписка", "События модуля формы списка");
	СтруктураДерева.Вставить("СобытияМодуляФормыОбъекта", "События модуля формы объекта");
	СтруктураДерева.Вставить("СобытияРеквизитаФормы", "События реквизита формы");
	
	Для каждого СтрокаКоллекции Из СтруктураДерева Цикл
		ВеткаДерева=дзБуфер.Строки.Добавить();
		ВеткаДерева.Ссылка=СтрокаКоллекции.Значение;
		ВеткаДерева.Параметры="Параметры";

		ОбластьМакета=Макет.ПолучитьОбласть(СтрокаКоллекции.Ключ);
		Для НомерСтроки=1 По ОбластьМакета.ВысотаТаблицы Цикл
			стрСобытие=СокрЛП(ОбластьМакета.Область(НомерСтроки, 1).Текст);
			НоваяСтрока=ВеткаДерева.Строки.Добавить();
			Попытка НоваяСтрока.Ссылка=Перечисления.СобытияСистемы[стрСобытие];
			Исключение Сообщить(стрСобытие);
			КонецПопытки; 
			
			НоваяСтрока.Параметры=СокрЛП(ОбластьМакета.Область(НомерСтроки, 2).Текст);
		КонецЦикла;
	КонецЦикла;

	ЗначениеВРеквизитФормы(дзБуфер, "дзСобытияСистемы");
КонецПроцедуры

&НаКлиенте
Процедура дзСобытияСистемы_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(Элемент.ТекущиеДанные.Ссылка)=Тип("Строка") Тогда Возврат; КонецЕсли;
	ОповеститьОВыборе(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура дзСобытияСистемы_ВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Если ТипЗнч(Элемент.ТекущиеДанные.Ссылка)=Тип("Строка") Тогда Возврат; КонецЕсли;
	ОповеститьОВыборе(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	дзСобытияСистемы_Инициализация();
	Элементы.дзСобытияСистемы.РежимВыбора=Параметры.РежимВыбора;
КонецПроцедуры