&НаКлиенте
Процедура ОбработчикОповещения_ВыборПериода(Параметр1, Параметр2) Экспорт
	Если Параметр1=КодВозвратаДиалога.Нет Тогда
		Запись.Период=ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры 

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="ФизЛицо" Тогда
		Заголовок="Паспортные данные: "+СокрЛП(Запись.ФизЛицо);

	ИначеЕсли Элемент.Имя="Период" Тогда
		Если Запись.Период > ТекущаяДата() Тогда
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбработчикОповещения_ВыборПериода", ЭтотОбъект), "Вы действительно хотите ввести данные"+Символы.ПС+"об удостоверении личности физлица на будущую дату?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет, "Подтверждение действия", КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Заголовок="Данные удостоверения личности: "+?(Запись.ФизЛицо<>Неопределено, СокрЛП(Запись.ФизЛицо), "");
КонецПроцедуры