Процедура ПодборТоваров(Форма, ПараметрыФормы) Экспорт
	//ОписаниеОповещения=Новый ОписаниеОповещения("ОбработчикОповещения_ОбработкаПодбора", Форма);
	//ОткрытьФорму("Обработка.ПодборТовара.Форма.Форма", ПараметрыФормы, Форма, Форма.УникальныйИдентификатор,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОткрытьФорму("Обработка.ПодборТовара.Форма.Форма", ПараметрыФормы, Форма, Форма.УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры