&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды)=Тип("Массив") Тогда
		ДокументСсылка=ПараметрКоманды.Получить(0);
	Иначе
		ДокументСсылка=ПараметрКоманды;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда Возврат; КонецЕсли;
	ОткрытьФорму("Обработка.ДвиженияДокументаПоРегистрам.Форма.Форма", Новый Структура("ДокументСсылка", ДокументСсылка), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры