&НаСервере
Процедура УстановитьЗначенияОтбораПользовательскойНастройки()
    Для Каждого ЭлементНастройки Из ДинамическийСписок.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если НЕ ТипЗнч(ЭлементНастройки)=Тип("ОтборКомпоновкиДанных") Тогда Продолжить; КонецЕсли;
		Если ЭлементНастройки.Элементы.Количество()=0 Тогда
			ЭлементОтбора=ЭлементНастройки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.Использование=Истина;
			ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Ссылка");
			ЭлементОтбора.ПравоеЗначение=Неопределено; //ПредопределенноеЗначение("Справочник.КлассификаторПеречислений.ПустаяСсылка");
			ЭлементОтбора.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
			ЭлементОтбора.ПредставлениеПользовательскойНастройки="Ссылка";
			ЭлементОтбора.ИдентификаторПользовательскойНастройки="Ссылка";
		КонецЕсли;
		Прервать;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьЗначенияОтбораПользовательскойНастройки();
КонецПроцедуры
