////////////////////////////////////////////////////////////////////////////////
// Общие назначения

Функция ДанныеУпаковать(Данные) Экспорт
	СтрокаBase64=СериализаторXDTO.XMLСтрока(Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9)));
	Возврат Base64Значение(СтрокаBase64); //Возвращаем сжатые двоичные данные
КонецФункции

Функция ДанныеРаспаковать(Данные) Экспорт
	СтрокаBase64=Base64Строка(Данные);
    Возврат СериализаторXDTO.XMLЗначение(Тип("ХранилищеЗначения"), СтрокаBase64).Получить();
КонецФункции

Функция СоединениеHTTP() Экспорт
	Возврат Новый HTTPСоединение("84.201.247.51", 8181, "Пользователь", "1",, 600); //Новый ЗащищенноеСоединениеOpenSSL
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// 

Функция СписокКонфигураций(Логин, Пароль) Экспорт
	Запрос=Новый HTTPЗапрос("HTTP/hs/ExtStore/СписокКонфигураций?Логин="+СокрЛП(Логин)+"&Пароль="+СокрЛП(Пароль));

	Ответ=СоединениеHTTP().ВызватьHTTPМетод("GET", Запрос);
	Если НЕ Ответ.КодСостояния=200 Тогда
		Сообщить("Чтение данных списка конфигурации, код ошибки ("+Ответ.КодСостояния+") описание:"+Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
		Возврат Новый СписокЗначений;
	КонецЕсли;

	Данные=ДанныеРаспаковать(Ответ.ПолучитьТелоКакДвоичныеДанные());
	Возврат ?(НЕ ТипЗнч(Данные)=Тип("СписокЗначений"), Новый СписокЗначений, Данные);
КонецФункции
