//////////////////////////////////////////////////////////////////////////////////
// Проведение по регистрам

Процедура ДвиженияПоРегистрам(СтруктураШД, СтруктураТД, Отказ)
	ДвижениеПоРегистру_ДенежныеСредства(СтруктураШД, СтруктураТД, Отказ);
	ДвижениеПоРегистру_ДвиженияДенежныхСредств(СтруктураШД, СтруктураТД, Отказ);	
КонецПроцедуры

Процедура ДвижениеПоРегистру_ДвиженияДенежныхСредств(СтруктураШД, СтруктураТД, Отказ)
	Если НЕ Оплачено Тогда Возврат; КонецЕсли;

	НоваяСтрока=Движения.ДвиженияДенежныхСредств.Добавить();
	НоваяСтрока.ВидДенежныхСредств=Перечисления.ВидыДенежныхСредств.Безналичные;
	НоваяСтрока.ПриходРасход=Перечисления.ВидыДвиженийПриходРасход.Расход;
	НоваяСтрока.Организация=Организация;
	НоваяСтрока.БанковскийСчетКасса=СчетОрганизации;
	НоваяСтрока.ДокументДвижения=Ссылка;
	НоваяСтрока.СтатьяДвиженияДенежныхСредств=СтатьяДвиженияДенежныхСредств;
	НоваяСтрока.Период=КонецДня(ДатаОплаты);
	НоваяСтрока.Активность=Истина;
	НоваяСтрока.Регистратор=Ссылка;	
	НоваяСтрока["Сумма"+?(Касса.ВалютаДенежныхСредств=ДополнительныеСвойства.ВалютаБухУчета, "", "Упр")]=СуммаДокумента;
КонецПроцедуры

Процедура ДвижениеПоРегистру_ДенежныеСредства(СтруктураШД, СтруктураТД, Отказ)
	Если НЕ Оплачено Тогда Возврат; КонецЕсли;

	НоваяСтрока=Движения.ДенежныеСредства.Добавить();
	НоваяСтрока.Организация=Организация;
	НоваяСтрока.БанковскийСчетКасса=СчетОрганизации;
	НоваяСтрока.ВидДенежныхСредств=Перечисления.ВидыДенежныхСредств.Безналичные;
	НоваяСтрока.ВидДвижения=ВидДвиженияНакопления.Расход;
	НоваяСтрока.Период=КонецДня(ДатаОплаты);
	НоваяСтрока.Активность=Истина;
	НоваяСтрока.Регистратор=Ссылка;
	НоваяСтрока["Сумма"+?(Касса.ВалютаДенежныхСредств=ДополнительныеСвойства.ВалютаБухУчета, "", "Упр")]=СуммаДокумента;
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
// Проведение по регистрам (по нескольким регистрам одного типа)

Процедура ДвижениеПоРегистру_УчетДенежныхСредств(СтруктураШД, СтруктураТД, Отказ)
	ДвижениеПоРегистру_ДенежныеСредства(СтруктураШД, СтруктураТД, Отказ);
	ДвижениеПоРегистру_ДвиженияДенежныхСредств(СтруктураШД, СтруктураТД, Отказ);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий модуля

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УправлениеДокументамиСервер.ПередПроведением(Отказ, РежимПроведения, ЭтотОбъект);
	Если Отказ Тогда Возврат; КонецЕсли; 

	СтруктураШД=ДополнительныеСвойства.СтруктураШД;
	СтруктураТД=ДополнительныеСвойства.СтруктураТД;

	Если ДополнительныеСвойства.Свойство("РегистрыДляПроведения") Тогда
		Для каждого СтрокаМассива Из ДополнительныеСвойства.РегистрыДляПроведения Цикл
			Выполнить("ДвижениеПоРегистру_"+СтрокаМассива+"(СтруктураШД, СтруктураТД, Отказ);");
		КонецЦикла;
		Возврат;
	КонецЕсли;

	ДвиженияПоРегистрам(СтруктураШД, СтруктураТД, Отказ);	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Заголовок=ЗаполнениеДокументов.ПредставлениеДокументаПриПроведении(ЭтотОбъект);

	Если Оплачено Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаОплаты");
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("Заголовок", Заголовок);
	ДополнительныеСвойства.Вставить("СтруктураШД", Новый Структура);
	ДополнительныеСвойства.Вставить("СтруктураТД", Новый Структура);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Операторы основной программы

УправлениеДокументамиСервер.ИнициализацияМодуля(ДополнительныеСвойства);