&НаКлиенте
Процедура УстановитьТипСтруктурнойЕдиницы()
	Если ТипСтруктурнойЕдиницы=ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад") Тогда
		Если НЕ ТипЗнч(Запись.СтруктурнаяЕдиница)=Тип("СправочникСсылка.Склады") Тогда
			Запись.СтруктурнаяЕдиница=ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
		КонецЕсли;
	Иначе
		Если НЕ ТипЗнч(Запись.СтруктурнаяЕдиница)=Тип("СправочникСсылка.Кассы") Тогда
			Запись.СтруктурнаяЕдиница=ПредопределенноеЗначение("Справочник.Кассы.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсторию(Команда)
	СтруктураОтбора=Новый Структура("СтруктурнаяЕдиница", Запись.СтруктурнаяЕдиница);
	ОткрытьФорму("РегистрСведений.ОтветственныеЛица.ФормаСписка", Новый Структура("Отбор", СтруктураОтбора));
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="СтруктурнаяЕдиница" Тогда
		Заголовок="Ответственное лицо для: "+СокрЛП(Запись.СтруктурнаяЕдиница);
	КонецЕсли;
	УстановитьТипСтруктурнойЕдиницы();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Заголовок="Ответственное лицо для: "+СокрЛП(Запись.СтруктурнаяЕдиница);

	Если НЕ ЗначениеЗаполнено(ТипСтруктурнойЕдиницы) Тогда
		Если ТипЗнч(Запись.СтруктурнаяЕдиница) = Тип("СправочникСсылка.Склады") Тогда
			ТипСтруктурнойЕдиницы  = ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Склад");
		Иначе
			ТипСтруктурнойЕдиницы  = ПредопределенноеЗначение("Перечисление.ТипыСтруктурныхЕдиниц.Касса");
		КонецЕсли;
	КонецЕсли;

	Если НЕ ВладелецФормы=Неопределено Тогда
		ФормаВладельца=ОбщегоНазначенияКлиент.ОбъектФормыПоЭлементу(ВладелецФормы, "ФормаКлиентскогоПриложения");
		Если НЕ ФормаВладельца=Неопределено Тогда
			Если ФормаВладельца.ИмяФормы="Справочник.Склады.Форма.ФормаЭлемента" Тогда
			Элементы.ГруппаСтруктурнаяЕдиница.Доступность=Ложь;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	УстановитьТипСтруктурнойЕдиницы();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","ОтветственноеЛицо"), Запись.СтруктурнаяЕдиница);
КонецПроцедуры
