&НаСервере
Процедура тзДанные_Заполнить()
	стрУсловие="";
	Если НЕ Организация.Пустая() Тогда
		стрУсловие=стрУсловие+?(стрУсловие="", "", " И ")+"Организация = &Организация";
	КонецЕсли;
	Если НЕ Склад.Пустая() Тогда
		стрУсловие=стрУсловие+?(стрУсловие="", "", " И ")+"Склад = &Склад";
	КонецЕсли;

	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Товары", РеквизитФормыВЗначение("тзДанные"));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("МоментВремени", ТекущаяДата());	
	Запрос.Текст="
	|ВЫБРАТЬ *
	|ПОМЕСТИТЬ ИсточникДанных
	|ИЗ
	|	&Товары КАК ИсточникДанных
	|;
	|
	|Выбрать
	|	ИсточникДанных.Номенклатура Как Номенклатура,
	|	ИсточникДанных.Количество Как Количество,
	|	ИсточникДанных1.КоличествоОстаток Как Остаток
	|";
	Если ИспользоватьХарактеристики Тогда
		Запрос.Текст=Запрос.Текст+",ИсточникДанных.ХарактеристикаНоменклатуры Как ХарактеристикаНоменклатуры";
	КонецЕсли;
	Если ИспользоватьСерии Тогда
		Запрос.Текст=Запрос.Текст+",ИсточникДанных.СерияНоменклатуры Как СерияНоменклатуры";
	КонецЕсли;
	
	Если ИспользоватьРезерв Тогда
		Запрос.Текст=Запрос.Текст+",
		|	ИсточникДанных2.КоличествоОстаток Как Резерв
		|";
	КонецЕсли;

	Если ИспользоватьПотребности Тогда
		Запрос.Текст=Запрос.Текст+",
		|	ИсточникДанных3.КоличествоОстаток Как Потребность
		|";
	КонецЕсли;
	
	Запрос.Текст=Запрос.Текст+"
	|ИЗ ИсточникДанных
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&МоментВремени, "+стрУсловие+") КАК ИсточникДанных1
	|		ПО ИсточникДанных.Номенклатура = ИсточникДанных1.Номенклатура
	|";
	
	Если ИспользоватьРезерв Тогда
		Запрос.Текст=Запрос.Текст+"
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|		РегистрНакопления.УчетРезервовТМЦ.Остатки(&МоментВремени, "+стрУсловие+") КАК ИсточникДанных2
		|		ПО ИсточникДанных.Номенклатура = ИсточникДанных2.Номенклатура
		|";
		Если ИспользоватьХарактеристики Тогда
			Запрос.Текст=Запрос.Текст+" И ИсточникДанных.ХарактеристикаНоменклатуры = ИсточникДанных2.ХарактеристикаНоменклатуры";
		КонецЕсли; 
		Если ИспользоватьСерии Тогда
			Запрос.Текст=Запрос.Текст+" И ИсточникДанных.СерияНоменклатуры = ИсточникДанных2.СерияНоменклатуры";
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользоватьПотребности Тогда
		Запрос.Текст=Запрос.Текст+"
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|		РегистрНакопления.УчетПотребностей.Остатки(&МоментВремени, "+стрУсловие+") КАК ИсточникДанных3
		|		ПО ИсточникДанных.Номенклатура = ИсточникДанных3.Номенклатура
		|";
		Если ИспользоватьХарактеристики Тогда
			Запрос.Текст=Запрос.Текст+" И ИсточникДанных.ХарактеристикаНоменклатуры = ИсточникДанных3.ХарактеристикаНоменклатуры";
		КонецЕсли;
	КонецЕсли;

	тзДанные.Очистить();
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(тзДанные.Добавить(), Выборка);
	КонецЦикла;	
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов формы

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	тзДанные_Заполнить();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Товары") Тогда Отказ=Истина; Возврат; КонецЕсли;
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Склад", Склад);
	
	ИспользоватьХарактеристики=Константы.ИспользоватьХарактеристикиНоменклатуры.Получить();
	ИспользоватьСерии=Константы.ИспользоватьСерииНоменклатуры.Получить();
	ИспользоватьРезерв=Константы.УчетРезервов.Получить();
	ИспользоватьПотребности=Константы.УчетПотребностей.Получить();

	////тзТовары=Новый ТаблицаЗначений;
	////тзТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	////тзТовары.Колонки.Добавить("Склад",Новый ОписаниеТипов("СправочникСсылка.Склады"));	
	////Если ИспользоватьХарактеристики Тогда
	////	тзТовары.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));	
	////КонецЕсли; 
	////Если ИспользоватьСерии Тогда
	////	тзТовары.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	////КонецЕсли;
	////тзТовары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));

	Для каждого СтрокаКоллекции Из Параметры.Товары Цикл
		НоваяСтрока=тзДанные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКоллекции);
		Если НоваяСтрока.Склад.Пустая() Тогда
			НоваяСтрока.Склад=Склад;
		КонецЕсли; //На будущее (что бы устанавливаь отбор по складу табличной части (сейчас отбор по складу шапки)
	КонецЦикла;
	
	тзДанные_Заполнить();

	//стрКолонки="Номенклатура,Количество";
	//Если ИспользоватьХарактеристики Тогда
	//	стрКолонки=стрКолонки+",ХарактеристикаНоменклатуры";
	//КонецЕсли; 
	//Если ИспользоватьСерии Тогда
	//	стрКолонки=стрКолонки+",СерияНоменклатуры";
	//КонецЕсли;	
	//тзДанные_Заполнить(Параметры.Товары.Выгрузить(,стрКолонки));
КонецПроцедуры
