&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	Если Команда.Имя="Загрузить" Тогда
	    ЗагрузитьРегионы();
		Элементы.ДинамическийСписок.Обновить();
	Иначе
		ДинамическиеСпискиКлиент.ВыполнитьДействие(Команда.Имя, ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРегионы()
	Макет=Справочники.Регионы.ПолучитьМакет("Регионы");
	
	ТабличныйДокумент=Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(Макет);
	
	Для ъ=1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		РегионКод=СокрЛП(ТабличныйДокумент.Область(ъ, 1).Текст);
		РегионИмя=СокрЛП(ТабличныйДокумент.Область(ъ, 2).Текст);

		РегионКод=Лев(РегионКод, 2);
		
		СправочникСсылка=Справочники.Регионы.НайтиПоРеквизиту("КодРегиона", РегионКод);
		Если НЕ СправочникСсылка.Пустая() Тогда Продолжить; КонецЕсли;

		СправочникОбъект=Справочники.Регионы.СоздатьЭлемент();
		СправочникОбъект.КодРегиона=РегионКод;
		//*** СправочникОбъект.Код=РегионКод;
		СправочникОбъект.Наименование=РегионИмя;
		СправочникОбъект.Записать();
	КонецЦикла; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий табличного поля "Динамический список"

&НаКлиенте
Процедура ДинамическийСписок_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДинамическиеСпискиКлиент.Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписок_ВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Если ТипЗнч(Значение)=Тип("Массив") Тогда
		ОповеститьОВыборе(Значение[0]);
		СтандартнаяОбработка=Ложь;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДинамическиеСпискиСервер.НастройкаПоПравилам(ДинамическийСписок, ЭтаФорма);
	Элементы.ДинамическийСписок.РежимВыбора=Параметры.РежимВыбора;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДинамическиеСпискиКлиент.ПриОткрытии(Отказ, ДинамическийСписок, ЭтаФорма);
КонецПроцедуры