&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	Если Команда.Имя="Зарегистрировать" Тогда
		ЗарегистрироватьКонйфигурацию();		
	КонецЕсли; 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Регистрация конфигурации

&НаСервере
Функция ИдентификаторКонфигурации()
	Возврат Обработки.Регистрация.ИдентификаторКонфигурации();
КонецФункции

&НаСервере
Процедура ЗаписатьКлючАктивации()
	Константы.КлючАктивации.Установить(Объект.КлючАктивации);
КонецПроцедуры

&НаСервере
Функция ДанныеУпаковать(Данные)
	СтрокаBase64=СериализаторXDTO.XMLСтрока(Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9)));
	Возврат Base64Значение(СтрокаBase64); //Возвращаем сжатые двоичные данные
КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьКонйфигурацию()
	ДанныеРегистрации=Новый Структура;
	ДанныеРегистрации.Вставить("Организация", Объект.Организация);
	ДанныеРегистрации.Вставить("ИНН", Объект.ИНН);
	ДанныеРегистрации.Вставить("Телефон", Объект.Телефон);
	ДанныеРегистрации.Вставить("Почта", Объект.Почта);
	ДанныеРегистрации.Вставить("ИдентификаторКонфигурации", ИдентификаторКонфигурации());

	Запрос=Новый HTTPЗапрос("HTTP/hs/ExtStore/РегистрацияКонфигурацииСкатАктив");
	Запрос.УстановитьТелоИзДвоичныхДанных(ДанныеУпаковать(ДанныеРегистрации));

	СоединениеHTTP=Новый HTTPСоединение("84.201.247.51", 8181, "Пользователь", "1",, 600); //Новый ЗащищенноеСоединениеOpenSSL
	Ответ=СоединениеHTTP.Записать(Запрос);
	Если Ответ.КодСостояния=200 Тогда
		Объект.КлючАктивации=Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		ЗаписатьКлючАктивации();
		ПоказатьПредупреждение(, "Конфигурация успешно зарегистрирована!", 20, "Внимание");
	Иначе
		Сообщить("Ошибка при регистрации конфигурации: "+Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибутов формы

&НаКлиенте
Процедура Атрибут_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элемент.Имя="Организация" Тогда
		ПараметрыФормы=Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ОткрытьФорму("Справочник.Организации.ФормаВыбора", ПараметрыФормы, Элемент, УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Данные формы

&НаСервере
Процедура СохранитьДанные()
	ДанныеРегистрации=Новый Структура;
	ДанныеРегистрации.Вставить("Организация", Объект.Организация);
	ДанныеРегистрации.Вставить("ИНН", Объект.ИНН);
	ДанныеРегистрации.Вставить("Телефон", Объект.Телефон);
	ДанныеРегистрации.Вставить("Почта", Объект.Почта);
	
	Константы.ДанныеРегистрации.Установить(Новый ХранилищеЗначения(ДанныеРегистрации));
КонецПроцедуры 

&НаСервере
Процедура ПрочитатьДанные()
	ДанныеРегистрации=Константы.ДанныеРегистрации.Получить();
	Если ДанныеРегистрации=Неопределено Тогда Возврат; КонецЕсли;

	СтруктураДанных=ДанныеРегистрации.Получить();
	Если СтруктураДанных=Неопределено Тогда Возврат; КонецЕсли;

	ЗаполнитьЗначенияСвойств(Объект, СтруктураДанных);	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьДанные();
	Объект.КлючАктивации=Константы.КлючАктивации.Получить();	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда Возврат; КонецЕсли;
	
	//Если НЕ УправлениеКонфигурациейСервер.КонфигурацияЗарегистрированна() Тогда
	//	Отказ=Истина; ПоказатьПредупреждение(, "Необходимо зарегистрировать конфигурацию!", 20, "Внимание");
	//КонецЕсли;
	
	СохранитьДанные();
КонецПроцедуры
