Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	мТаблицаДвижений.ЗаполнитьЗначения( мПериод, "Период");
	мТаблицаДвижений.ЗаполнитьЗначения( Истина,  "Активность");

	ПустыеКолонкиСоставногоТипа = Новый Структура;
	ПустыеКолонкиСоставногоТипа.Вставить("ПолучательСкидки");
	ПустыеКолонкиСоставногоТипа.Вставить("ЗначениеУсловия");

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, Неопределено, ПустыеКолонкиСоставногоТипа);

КонецПроцедуры // ВыполнитьДвижения()
