Функция ЗначениеВСтрокуXML(Объект, ИспользоватьXDTO=Истина) Экспорт
	ЗаписьXML=Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку();	
	Если ИспользоватьXDTO Тогда
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Объект);
	Иначе
		ЗаписатьXML(ЗаписьXML, Объект.ПолучитьОбъект());	
	КонецЕсли;
	Возврат ЗаписьXML.Закрыть();
КонецФункции

Функция ЗначениеИзСтрокиXML(СтрокаXML, ИспользоватьXDTO=Истина) Экспорт
	ЧтениеXML=Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	Если ИспользоватьXDTO Тогда
		Объект=СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Иначе
		Объект=ПрочитатьXML(ЧтениеXML);
	КонецЕсли; 
	ЧтениеXML.Закрыть();
	Возврат Объект;	
КонецФункции

Функция ИмяПредопределенныхДанных(Ссылка) Экспорт
	Возврат Ссылка.ИмяПредопределенныхДанных;
КонецФункции
