Процедура ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр, Форма, Ссылка) Экспорт
	спМеню=Новый СписокЗначений; Отказ=Истина;
	спМеню.Добавить("Адрес", "Адрес",, БиблиотекаКартинок.Комментарий);
	спМеню.Добавить("Телефон", "Телефон",,БиблиотекаКартинок.Позвонить);
	спМеню.Добавить("АдресЭлектроннойПочты", "E-Mail",,БиблиотекаКартинок.ОтправитьСообщение);
	спМеню.Добавить("ВебСтраница", "Веб-страница",,БиблиотекаКартинок.КонтактнаяИнформацияПерейтиПоСсылке);
	спМеню.Добавить("Другое", "Другое",,БиблиотекаКартинок.Содержание);
	Форма.ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВыборТипаКонтактнойИнформации", КонтактнаяИнформацияКлиент, Новый Структура("Форма,Ссылка", Форма, Ссылка)), спМеню);
КонецПроцедуры

Процедура ПередНачаломИзменения(Элемент, Отказ, Форма) Экспорт
	ПередаваемыеПараметры=Новый Структура; Отказ=Истина;
	ПередаваемыеПараметры.Вставить("Объект", Элемент.ТекущиеДанные.Объект);
	ПередаваемыеПараметры.Вставить("Тип", Элемент.ТекущиеДанные.Тип);
	ПередаваемыеПараметры.Вставить("Вид", Элемент.ТекущиеДанные.Вид);

	ПараметрыМассив=Новый Массив;
	ПараметрыМассив.Добавить(ПередаваемыеПараметры);

	КлючЗаписиРегистра=Новый("РегистрСведенийКлючЗаписи.КонтактнаяИнформация", ПараметрыМассив);
	стрИмяФормы=?(ПередаваемыеПараметры.Тип=ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"), "ФормаВводаАдреса", "ФормаЗаписи");	
	ОткрытьФорму("РегистрСведений.КонтактнаяИнформация.Форма."+стрИмяФормы, Новый Структура("Ключ", КлючЗаписиРегистра), Форма, Форма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Процедура ВыборТипаКонтактнойИнформации(Параметр1, Параметр2) Экспорт
	Если Параметр1=Неопределено Тогда Возврат; КонецЕсли;

	ПараметрыФормы=Новый Структура;
	ПараметрыФормы.Вставить("Объект", Параметр2.Ссылка);
	ПараметрыФормы.Вставить("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации."+Параметр1.Значение));
	ОткрытьФорму("РегистрСведений.КонтактнаяИнформация.Форма.ФормаЗаписи", ПараметрыФормы, Параметр2.Форма, Параметр2.Форма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
