&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	ДинамическиеСпискиКлиент.ВыполнитьДействие(Команда.Имя, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ОтборПоТипу(стрТип="СтраницаВсе") Экспорт
	ПолеОтбора=Новый ПолеКомпоновкиДанных("Тип");
	Для каждого СтрокаКоллекции Из ДинамическийСписок.Отбор.Элементы Цикл
		Если СтрокаКоллекции.ЛевоеЗначение=ПолеОтбора Тогда
			ЭлементОтбора=СтрокаКоллекции; Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЭлементОтбора=Неопределено Тогда
		ЭлементОтбора=ДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		ЭлементОтбора.ЛевоеЗначение=ПолеОтбора;
	КонецЕсли;
	ЭлементОтбора.Использование=НЕ стрТип="СтраницаВсе";
	ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	Если ЭлементОтбора.Использование Тогда
		ЭлементОтбора.ПравоеЗначение=Тип("ДокументСсылка."+стрТип);
	КонецЕсли;
	ЭлементОтбора.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
КонецПроцедуры

&НаКлиенте
Процедура Страницы_ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПереместитьЭлемент(ТекущаяСтраница.Имя);
	ОтборПоТипу(ТекущаяСтраница.Имя);
КонецПроцедуры

&НаСервере
Процедура Страницы_Инициализация()
	Структура=Новый Структура;
	Структура.Вставить("ДенежныйЧек", "Денежные чеки");
	Структура.Вставить("ПлатежноеПоручениеВходящее", "Платежные поручения входящее");
	Структура.Вставить("ПлатежноеПоручениеИсходящее", "Платежные поручения исходящее");
	Структура.Вставить("ПлатежныйОрдерПоступлениеДенежныхСредств", "Платежные ордера: поступление денежных средств");
	Структура.Вставить("ПлатежныйОрдерСписаниеДенежныхСредств", "Платежные ордера: списание денежных средств");
	Структура.Вставить("ОбъявлениеНаВзносНаличными", "Объявления на взнос наличными");
	Для каждого СтрокаКоллекции Из Структура Цикл
		Страница=ЭтаФорма.Элементы.Добавить(СтрокаКоллекции.Ключ, Тип("ГруппаФормы"), Элементы.Страницы);
		Страница.Заголовок=СокрЛП(СтрокаКоллекции.Значение);
		Страница.РазрешитьИзменениеСостава=Истина;

		А=Элементы.Добавить("Реквизит_"+СтрокаКоллекции.Ключ, Тип("ПолеФормы"), Элементы[СтрокаКоллекции.Ключ]);
		А.ПутьКДанным="РеквизитВидимость";
	КонецЦикла;
КонецПроцедуры
 
&НаСервере
Процедура ПереместитьЭлемент(стрРодитель)
	Для каждого СтрокаКоллекции Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Элементы["Реквизит_"+СтрокаКоллекции.Имя].Видимость=Истина;
	КонецЦикла; 
	Элементы.Переместить(Элементы.ДинамическийСписок, Элементы[стрРодитель]);
	Элементы["Реквизит_"+стрРодитель].Видимость=Ложь;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий табличного поля "Динамический список"

&НаКлиенте
Процедура ДинамическийСписок_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДинамическиеСпискиКлиент.Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДинамическийСписок_ВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Если ТипЗнч(Значение)=Тип("Массив") Тогда
		ОповеститьОВыборе(Значение[0]);
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДинамическиеСпискиСервер.НастройкаПоПравилам(ДинамическийСписок, ЭтаФорма);
	Элементы.ДинамическийСписок.РежимВыбора=Параметры.РежимВыбора;
	Страницы_Инициализация();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДинамическиеСпискиКлиент.ПриОткрытии(Отказ, ДинамическийСписок, ЭтаФорма);
КонецПроцедуры