&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	Если Команда.Имя="Применить" Тогда
		ОповеститьОВыборе(ТекДата);

	ИначеЕсли Команда.Имя="ПоказатьВремя" Тогда
		Элементы.ГруппаВремя.Видимость=НЕ Элементы.ГруппаВремя.Видимость;
		Элементы.Время.Видимость=Элементы.ГруппаВремя.Видимость;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДату()
	Если ВыбГод=0 ИЛИ ВыбМес=0 ИЛИ ВыбДень=0 Тогда Возврат; КонецЕсли; 
	ТекДата=Дата(ВыбГод, ВыбМес, ВыбДень, ВыбЧас, ВыбМин, ВыбСек);
КонецПроцедуры

&НаКлиенте
Процедура Атрибут_ПриИзменении(Элемент)
	Если Элемент.Имя="Часы" ИЛИ Элемент.Имя="Минуты" ИЛИ Элемент.Имя="Секунды" Тогда
		УстановитьДату();
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий атрибута "Выбранная дата"

&НаКлиенте
Процедура ВыбраннаяДата_Выбор(Элемент, ВыбраннаяДата)
	ОповеститьОВыборе(ТекДата);
КонецПроцедуры

&НаКлиенте
Процедура ВыбраннаяДата_ПриАктивизацииДаты(Элемент)
	ВыбГод=Год(ВыбраннаяДата); 
	ВыбМес=Месяц(ВыбраннаяДата); 
	ВыбДень=День(ВыбраннаяДата);	
	УстановитьДату();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Дата", ТекДата);
	Элементы.ГруппаВремя.Видимость=?(Параметры.Свойство("ПоказыватьВремя"), Параметры.ПоказыватьВремя, Ложь);
	Элементы.Время.Видимость=Элементы.ГруппаВремя.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(ТекДата) Тогда
		ТекДата=ТекущаяДата();
	КонецЕсли;

	Заголовок="Выбор даты и времени";
	Если НЕ Элементы.ГруппаВремя.Видимость Тогда
		ТекДата=НачалоДня(ТекДата);
		Заголовок="Выбор даты";
	КонецЕсли;
	
	ВыбГод	= Год(ТекДата); 
	ВыбМес	= Месяц(ТекДата); 
	ВыбДень = День(ТекДата);
	ВыбЧас	= Час(ТекДата); 
	ВыбМин	= Минута(ТекДата); 
	ВыбСек	= Секунда(ТекДата); 

	ВыбраннаяДата=ТекДата;
КонецПроцедуры
