Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
	
		Если НЕ ЭтоГруппа И Не ЗначениеЗаполнено(ВалютаДенежныхСредств) Тогда
			Сообщить("Не указана валюта денежных средств.",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		Если НЕ ЭтоГруппа 
		   И НЕ ЭтоНовый() 
		   И ВалютаДенежныхСредств <> Ссылка.ВалютаДенежныхСредств 
		   И ПолныеПрава.Кассы_СуществуютСсылки(Ссылка) Тогда

			Сообщить("Существуют документы, проведенные по кассе """ + Наименование + """.
			         |Реквизит ""Валюта денежных средств"" не может быть изменен, элемент не записан.", 
			         СтатусСообщения.Важное);

			Отказ = Истина;
		КонецЕсли;
	
	КонецЕсли; 
	
КонецПроцедуры

