

#Область ПриОткрытииПроверкаСостояния

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Запрос=Новый Запрос;
	//Запрос.УстановитьПараметр("ДокументРезерва", ЗаказНаПроизводство);
	//Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//Запрос.УстановитьПараметр("Склад", Объект.Склад);
	//Запрос.Текст="
	
	//|ВЫБРАТЬ
	//|	Номенклатура КАК Номенклатура,
	//|	ИсточникДанных.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|	Сумма(ИсточникДанных.Резерв) КАК Резерв,
	//|	Сумма(ИсточникДанных.Потребность) КАК Потребность
	//|ИЗ
	//|	
	//
	//|(ВЫБРАТЬ
	//|	ИсточникДанных.Номенклатура КАК Номенклатура,
	//|	ИсточникДанных.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|	0 КАК Резерв,	
	//|	Сумма(ИсточникДанных.КоличествоОстаток) КАК Потребность	
	//|ИЗ
	//|	РегистрНакопления.УчетПотребностей.Остатки(, Организация = &Организация И ДокументРезерва = &ДокументРезерва И Склад = &Склад) КАК ИсточникДанных
	//|		
	//|СГРУППИРОВАТЬ ПО	
	//|	ИсточникДанных.Номенклатура,
	//|	ИсточникДанных.ХарактеристикаНоменклатуры
	//|
	//|Объединить ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ИсточникДанных.Номенклатура КАК Номенклатура,
	//|	ИсточникДанных.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	//|	Сумма(ИсточникДанных.КоличествоОстаток) КАК Резерв,
	//|	0 КАК Потребность	
	//|ИЗ
	//|	РегистрНакопления.УчетРезервовТМЦ.Остатки(, Организация = &Организация И Заказ = &ДокументРезерва И Склад = &Склад) КАК ИсточникДанных
	//|		
	//|СГРУППИРОВАТЬ ПО	
	//|	ИсточникДанных.Номенклатура,
	//|	ИсточникДанных.ХарактеристикаНоменклатуры) Как ИсточникДанных
	//
	//|СГРУППИРОВАТЬ ПО	
	//|	ИсточникДанных.Номенклатура,
	//|	ИсточникДанных.ХарактеристикаНоменклатуры
	//
	//|";
	
	
	Искомое = Параметры.Поиск;
	
	Если Параметры.ИскатьВИменах = Неопределено Тогда
		 ИскатьВИменах = Истина;
	 Иначе
		 ИскатьВИменах = Параметры.ИскатьВИменах;
	КонецЕсли;
	
	Если Параметры.ИскатьВТексте = Неопределено Тогда
		 ИскатьВТексте = Истина;
	 Иначе
		 ИскатьВТексте = Параметры.ИскатьВТексте;
	КонецЕсли;
	
	Если Параметры.ВключатьПодчиненные = Неопределено Тогда
		 ВключатьПодчиненные = Истина;
	 Иначе
		 ВключатьПодчиненные = Параметры.ВключатьПодчиненные;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КнопкаПоиска

&НаКлиенте
Процедура КнИскать(Команда)
	Если ПустаяСтрока(Искомое) Тогда
		Сообщить("Значение поиска не задано");
	ИначеЕсли (НЕ ИскатьВИменах) И (НЕ ИскатьВТексте) Тогда
		Сообщить("Область поиска не задана");
	Иначе
		Закрыть();
		ВладелецФормы.ПроизвестиПоиск(Искомое,ИскатьВИменах,ИскатьВТексте,ВключатьПодчиненные);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти





















