&НаКлиенте
Процедура Применить(Команда)
	СтруктураВозврата=Новый Структура;
	СтруктураВозврата.Вставить("ВариантПоставки", ВариантПоставки);
	СтруктураВозврата.Вставить("ВариантОплаты", ВариантОплаты);
	СтруктураВозврата.Вставить("МоиПубликации", ОтборТолькоМоиПубликации);

	ЭтаФорма.Закрыть(СтруктураВозврата);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ВариантПоставки", ВариантПоставки);
	Параметры.Свойство("ВариантОплаты", ВариантОплаты);
	Параметры.Свойство("МоиПубликации", ОтборТолькоМоиПубликации);
	Параметры.Свойство("Логин", Логин);
	Параметры.Свойство("Пароль", Пароль);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры
