Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка  Тогда Возврат; КонецЕсли;

	Для каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Значение <> Неопределено Тогда Продолжить; КонецЕсли;
		Запись.Значение = Запись.Право.ТипЗначения.ПривестиЗначение(Запись.Значение);
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	//текПользователь=ПараметрыСеанса.ТекущийПользователь;
	//текПрава=ПланыВидовХарактеристик.ПраваПользователей;
	//Для каждого СтрокаКоллекции Из ЭтотОбъект Цикл
	//	Если Не СтрокаКоллекции.Пользователь=текПользователь Тогда Продолжить; КонецЕсли; 
	//	стрНастройка=текПрава.ПолучитьИмяПредопределенного(СтрокаКоллекции.Право);
	//	Если НЕ стрНастройка="" Тогда
	//		ПараметрыСеанса.ДопПраваПользователя[стрНастройка]=СтрокаКоллекции.Значение;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры
