////////////////////////////////////////////////////////////////////////////////
// Обработчики событий динамического списка

&НаКлиенте
Процедура ДинамическийСписок_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если Элемент.ТекущиеДанные=Неопределено Тогда Возврат; КонецЕсли;
	Если Элемент.ТекущиеДанные.ЭтоГруппа Тогда СтандартнаяОбработка=Истина; Возврат; КонецЕсли;
	Закрыть(Новый ВыборНастроек(Элемент.ТекущиеДанные.Ссылка));
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГруппаЭлементовОтбора=ОтборыСписковКлиентСервер.СоздатьГруппуЭлементовОтбора(ДинамическийСписок.Отбор.Элементы, "Автор или разрешенный пользователь", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораКоллекции(ГруппаЭлементовОтбора.Элементы, "Автор", ПараметрыСеанса.ТекущийПользователь);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораКоллекции(ГруппаЭлементовОтбора.Элементы, "Доступ.Пользователь", ПараметрыСеанса.ТекущийПользователь);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораКоллекции(ГруппаЭлементовОтбора.Элементы, "ДоступноВсем", Истина);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ДинамическийСписок, "Владелец", УправлениеКонфигурациейСервер.ИдентификаторОбъектовМетаданныхСсылка(Параметры.КлючОбъекта));
КонецПроцедуры